TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:03 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0192411                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 10:37:03 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/drivers/adc/src/32b/f28x/f2806x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab21\Release")
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.4\bin\opt2000.exe C:\\Users\\grant\\AppData\\Local\\Temp\

    2552              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_SocFrc_15"), DW_AT_const_value(0x0f)
    2553                      .dwendtag $C$DW$T$58
    2554              
    2555              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_SocFrc_e")
    2556                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2557                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2558              $C$DW$348       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:03 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0192411                            PAGE   49

    2559                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$59)
    2560              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2561                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$348)
    2562              
    2563              $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    2564                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
    2565              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_TempSensorSrc_Ext"), DW_AT_const_value(0x00)
    2566              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_TempSensorSrc_Int"), DW_AT_const_value(0x01)
    2567                      .dwendtag $C$DW$T$61
    2568              
    2569              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_TempSensorSrc_e")
    2570                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2571                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2572              $C$DW$351       .dwtag  DW_TAG_TI_far_type
    2573                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$62)
    2574              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2575                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$351)
    2576              
    2577              $C$DW$T$64      .dwtag  DW_TAG_enumeration_type
    2578                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    2579              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_VoltageRefSrc_Int"), DW_AT_const_value(0x00)
    2580              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_VoltageRefSrc_Ext"), DW_AT_const_value(0x08)
    2581                      .dwendtag $C$DW$T$64
    2582              
    2583              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_VoltageRefSrc_e")
    2584                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2585                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2586              $C$DW$354       .dwtag  DW_TAG_TI_far_type
    2587                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$65)
    2588              $C$DW$T$66      .dwtag  DW_TAG_const_type
    2589                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$354)
    2590              
    2591              $C$DW$T$67      .dwtag  DW_TAG_enumeration_type
    2592                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
    2593              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_DivideSelect_ClkIn_by_1"), DW_AT_const_value(0x00)
    2594              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_DivideSelect_ClkIn_by_2"), DW_AT_const_value(0x01)
    2595              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_DivideSelect_ClkIn_by_4"), DW_AT_const_value(0x05)
    2596                      .dwendtag $C$DW$T$67
    2597              
    2598              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_DivideSelect_e")
    2599                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2600                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2601              $C$DW$358       .dwtag  DW_TAG_TI_far_type
    2602                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$68)
    2603              $C$DW$T$69      .dwtag  DW_TAG_const_type
    2604                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$358)
    2605              
    2606              $C$DW$T$74      .dwtag  DW_TAG_enumeration_type
    2607                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    2608              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_NoIntTriggersSOC"), DW_AT_const_value(0x00)
    2609              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_Int1TriggersSOC"), DW_AT_const_value(0x01)
    2610              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_Int2TriggersSOC"), DW_AT_const_value(0x02)
    2611                      .dwendtag $C$DW$T$74
    2612              
    2613              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_IntTriggerSOC_e")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:03 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0192411                            PAGE   50

    2614                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2615                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2616              $C$DW$362       .dwtag  DW_TAG_TI_far_type
    2617                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$75)
    2618              $C$DW$T$76      .dwtag  DW_TAG_const_type
    2619                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$362)
    2620              
    2621              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2622                      .dwattr $C$DW$T$27, DW_AT_name("_ADC_Obj_")
    2623                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x6650)
    2624              $C$DW$363       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$21)
    2626                      .dwattr $C$DW$363, DW_AT_name("ADCRESULT")
    2627                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_ADCRESULT")
    2628                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2630              $C$DW$364       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$22)
    2632                      .dwattr $C$DW$364, DW_AT_name("resvd_1")
    2633                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_resvd_1")
    2634                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2635                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2636              $C$DW$365       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    2638                      .dwattr $C$DW$365, DW_AT_name("ADCCTL1")
    2639                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_ADCCTL1")
    2640                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    2641                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2642              $C$DW$366       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    2644                      .dwattr $C$DW$366, DW_AT_name("ADCCTL2")
    2645                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_ADCCTL2")
    2646                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    2647                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2648              $C$DW$367       .dwtag  DW_TAG_member
    2649                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
    2650                      .dwattr $C$DW$367, DW_AT_name("rsvd_2")
    2651                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_rsvd_2")
    2652                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    2653                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2654              $C$DW$368       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2656                      .dwattr $C$DW$368, DW_AT_name("ADCINTFLG")
    2657                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_ADCINTFLG")
    2658                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    2659                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$369       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    2662                      .dwattr $C$DW$369, DW_AT_name("ADCINTFLGCLR")
    2663                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    2664                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    2665                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2666              $C$DW$370       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    2668                      .dwattr $C$DW$370, DW_AT_name("ADCINTOVF")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:03 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0192411                            PAGE   51

    2669                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_ADCINTOVF")
    2670                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    2671                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2672              $C$DW$371       .dwtag  DW_TAG_member
    2673                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    2674                      .dwattr $C$DW$371, DW_AT_name("ADCINTOVFCLR")
    2675                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    2676                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    2677                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2678              $C$DW$372       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$24)
    2680                      .dwattr $C$DW$372, DW_AT_name("INTSELxNy")
    2681                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_INTSELxNy")
    2682                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    2683                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2684              $C$DW$373       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$25)
    2686                      .dwattr $C$DW$373, DW_AT_name("rsvd_3")
    2687                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd_3")
    2688                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    2689                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2690              $C$DW$374       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    2692                      .dwattr $C$DW$374, DW_AT_name("SOCPRICTRL")
    2693                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_SOCPRICTRL")
    2694                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    2695                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2696              $C$DW$375       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    2698                      .dwattr $C$DW$375, DW_AT_name("rsvd_4")
    2699                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_rsvd_4")
    2700                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    2701                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$376       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    2704                      .dwattr $C$DW$376, DW_AT_name("ADCSAMPLEMODE")
    2705                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    2706                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    2707                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2708              $C$DW$377       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    2710                      .dwattr $C$DW$377, DW_AT_name("rsvd_5")
    2711                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_rsvd_5")
    2712                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    2713                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2714              $C$DW$378       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    2716                      .dwattr $C$DW$378, DW_AT_name("ADCINTSOCSEL1")
    2717                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    2718                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    2719                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2720              $C$DW$379       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    2722                      .dwattr $C$DW$379, DW_AT_name("ADCINTSOCSEL2")
    2723                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:03 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0192411                            PAGE   52

    2724                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    2725                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2726              $C$DW$380       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$23)
    2728                      .dwattr $C$DW$380, DW_AT_name("rsvd_6")
    2729                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd_6")
    2730                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    2731                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2732              $C$DW$381       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    2734                      .dwattr $C$DW$381, DW_AT_name("ADCSOCFLG1")
    2735                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    2736                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    2737                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$382       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    2740                      .dwattr $C$DW$382, DW_AT_name("rsvd_7")
    2741                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_rsvd_7")
    2742                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    2743                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$383       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    2746                      .dwattr $C$DW$383, DW_AT_name("ADCSOCFRC1")
    2747                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    2748                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    2749                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2750              $C$DW$384       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$20)
    2752                      .dwattr $C$DW$384, DW_AT_name("rsvd_8")
    2753                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_rsvd_8")
    2754                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    2755                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$385       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    2758                      .dwattr $C$DW$385, DW_AT_name("ADCSOCOVF1")
    2759                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    2760                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    2761                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$386       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    2764                      .dwattr $C$DW$386, DW_AT_name("rsvd_9")
    2765                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_rsvd_9")
    2766                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    2767                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$387       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    2770                      .dwattr $C$DW$387, DW_AT_name("ADCSOCOVFCLR1")
    2771                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    2772                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    2773                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2774              $C$DW$388       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$20)
    2776                      .dwattr $C$DW$388, DW_AT_name("rsvd_10")
    2777                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd_10")
    2778                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:03 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0192411                            PAGE   53

    2779                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2780              $C$DW$389       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$21)
    2782                      .dwattr $C$DW$389, DW_AT_name("ADCSOCxCTL")
    2783                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    2784                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    2785                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$390       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$21)
    2788                      .dwattr $C$DW$390, DW_AT_name("rsvd_11")
    2789                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_rsvd_11")
    2790                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    2791                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2792              $C$DW$391       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    2794                      .dwattr $C$DW$391, DW_AT_name("ADCREFTRIM")
    2795                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_ADCREFTRIM")
    2796                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    2797                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2798              $C$DW$392       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    2800                      .dwattr $C$DW$392, DW_AT_name("ADCOFFTRIM")
    2801                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    2802                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    2803                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2804              $C$DW$393       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$26)
    2806                      .dwattr $C$DW$393, DW_AT_name("resvd_12")
    2807                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_resvd_12")
    2808                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    2809                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2810              $C$DW$394       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    2812                      .dwattr $C$DW$394, DW_AT_name("ADCREV")
    2813                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_ADCREV")
    2814                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    2815                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2816                      .dwendtag $C$DW$T$27
    2817              
    2818              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    2819                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$27)
    2820                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2821              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    2822                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$27)
    2823                      .dwattr $C$DW$T$70, DW_AT_address_class(0x20)
    2824              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    2825                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2826                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2827              $C$DW$395       .dwtag  DW_TAG_TI_far_type
    2828                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$71)
    2829              $C$DW$T$78      .dwtag  DW_TAG_const_type
    2830                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$395)
    2831              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2832                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2833              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:03 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0192411                            PAGE   54

    2834                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2835                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2836              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2837                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2838                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2839                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2840              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2841                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2842                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2843                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2844              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2845                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2846                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2847                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2848              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2849                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2850                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2851                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2852              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2853                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2854                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2855                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2856              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2857                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2858                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2859                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2860              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2861                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2862                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2863                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2864              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2865                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
