TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:03 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0757210                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 10:37:03 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/drivers/clk/src/32b/f28x/f2806x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab21\Release")
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.4\bin\opt2000.exe C:\\Users\\grant\\AppData\\Local\\Temp\

    3310              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Osc2Src_e")
    3311                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    3312                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3313              $C$DW$264       .dwtag  DW_TAG_TI_far_type
    3314                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$43)
    3315              $C$DW$T$44      .dwtag  DW_TAG_const_type
    3316                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$264)
    3317              
    3318              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    3319                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    3320              $C$DW$265       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_XClkInSrc_Gpio38"), DW_AT_const_value(0x00)
    3321              $C$DW$266       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_XClkInSrc_Gpio19"), DW_AT_const_value(0x40)
    3322                      .dwendtag $C$DW$T$45
    3323              
    3324              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_XClkInSrc_e")
    3325                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3326                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3327              $C$DW$267       .dwtag  DW_TAG_TI_far_type
    3328                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$46)
    3329              $C$DW$T$47      .dwtag  DW_TAG_const_type
    3330                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$267)
    3331              
    3332              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    3333                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    3334              $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_1"), DW_AT_const_value(0x00)
    3335              $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_2"), DW_AT_const_value(0x20)
    3336              $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_4"), DW_AT_const_value(0x40)
    3337              $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_8"), DW_AT_const_value(0x60)
    3338              $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_16"), DW_AT_const_value(0x80)
    3339                      .dwendtag $C$DW$T$48
    3340              
    3341              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Timer2PreScaler_e")
    3342                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3343                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3344              $C$DW$273       .dwtag  DW_TAG_TI_far_type
    3345                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$49)
    3346              $C$DW$T$50      .dwtag  DW_TAG_const_type
    3347                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$273)
    3348              
    3349              $C$DW$T$51      .dwtag  DW_TAG_enumeration_type
    3350                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    3351              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_SysClk"), DW_AT_const_value(0x00)
    3352              $C$DW$275       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_ExtOsc"), DW_AT_const_value(0x08)
    3353              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_IntOsc1"), DW_AT_const_value(0x10)
    3354              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_IntOsc2"), DW_AT_const_value(0x18)
    3355                      .dwendtag $C$DW$T$51
    3356              
    3357              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Timer2Src_e")
    3358                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:03 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0757210                            PAGE   63

    3359                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3360              $C$DW$278       .dwtag  DW_TAG_TI_far_type
    3361                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$52)
    3362              $C$DW$T$53      .dwtag  DW_TAG_const_type
    3363                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$278)
    3364              
    3365              $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
    3366                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    3367              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_WdClkSrc_IntOsc1"), DW_AT_const_value(0x00)
    3368              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_WdClkSrc_ExtOscOrIntOsc2"), DW_AT_const_value(0x04
    3369                      .dwendtag $C$DW$T$54
    3370              
    3371              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_WdClkSrc_e")
    3372                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3373                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3374              $C$DW$281       .dwtag  DW_TAG_TI_far_type
    3375                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$55)
    3376              $C$DW$T$56      .dwtag  DW_TAG_const_type
    3377                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$281)
    3378              
    3379              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3380                      .dwattr $C$DW$T$23, DW_AT_name("_CLK_Obj_")
    3381                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x11)
    3382              $C$DW$282       .dwtag  DW_TAG_member
    3383                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    3384                      .dwattr $C$DW$282, DW_AT_name("XCLK")
    3385                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_XCLK")
    3386                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3387                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3388              $C$DW$283       .dwtag  DW_TAG_member
    3389                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    3390                      .dwattr $C$DW$283, DW_AT_name("rsvd_1")
    3391                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_rsvd_1")
    3392                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3393                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3394              $C$DW$284       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    3396                      .dwattr $C$DW$284, DW_AT_name("CLKCTL")
    3397                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_CLKCTL")
    3398                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3399                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3400              $C$DW$285       .dwtag  DW_TAG_member
    3401                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
    3402                      .dwattr $C$DW$285, DW_AT_name("rsvd_2")
    3403                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_rsvd_2")
    3404                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3405                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3406              $C$DW$286       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    3408                      .dwattr $C$DW$286, DW_AT_name("LOSPCP")
    3409                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_LOSPCP")
    3410                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3411                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3412              $C$DW$287       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:03 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0757210                            PAGE   64

    3414                      .dwattr $C$DW$287, DW_AT_name("PCLKCR0")
    3415                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_PCLKCR0")
    3416                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3417                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3418              $C$DW$288       .dwtag  DW_TAG_member
    3419                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    3420                      .dwattr $C$DW$288, DW_AT_name("PCLKCR1")
    3421                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_PCLKCR1")
    3422                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3423                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3424              $C$DW$289       .dwtag  DW_TAG_member
    3425                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$22)
    3426                      .dwattr $C$DW$289, DW_AT_name("rsvd_3")
    3427                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_rsvd_3")
    3428                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3429                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3430              $C$DW$290       .dwtag  DW_TAG_member
    3431                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    3432                      .dwattr $C$DW$290, DW_AT_name("PCLKCR3")
    3433                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_PCLKCR3")
    3434                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3435                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3436                      .dwendtag $C$DW$T$23
    3437              
    3438              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Obj")
    3439                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$23)
    3440                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3441              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    3442                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    3443                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    3444              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3445                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    3446                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3447              $C$DW$291       .dwtag  DW_TAG_TI_far_type
    3448                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$59)
    3449              $C$DW$T$60      .dwtag  DW_TAG_const_type
    3450                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$291)
    3451              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3452                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3453              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3454                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3455                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3456              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3457                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3458                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3459                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3460              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3461                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3462                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3463                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3464              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3465                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3466                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3467                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3468              $C$DW$T$7       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:03 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0757210                            PAGE   65

    3469                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3470                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3471                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3472              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3473                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3474                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3475                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3476              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3477                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3478                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3479                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3480              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3481                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3482                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3483                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3484              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3485                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
