TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:06 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0293611                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 10:37:06 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/drivers/flash/src/32b/f28x/f280
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab21\Release")
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.4\bin\opt2000.exe C:\\Users\\grant\\AppData\\Local\\Temp\

    1031              $C$DW$109       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_3"), DW_AT_const_value(0x03)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:06 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0293611                            PAGE   20

    1032              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_4"), DW_AT_const_value(0x04)
    1033              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_5"), DW_AT_const_value(0x05)
    1034              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_6"), DW_AT_const_value(0x06)
    1035              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_7"), DW_AT_const_value(0x07)
    1036              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_8"), DW_AT_const_value(0x08)
    1037              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_9"), DW_AT_const_value(0x09)
    1038              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_10"), DW_AT_const_value(0x0a
    1039              $C$DW$117       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_11"), DW_AT_const_value(0x0b
    1040              $C$DW$118       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_12"), DW_AT_const_value(0x0c
    1041              $C$DW$119       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_13"), DW_AT_const_value(0x0d
    1042              $C$DW$120       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_14"), DW_AT_const_value(0x0e
    1043              $C$DW$121       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumRandomWaitStates_15"), DW_AT_const_value(0x0f
    1044                      .dwendtag $C$DW$T$40
    1045              
    1046              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_NumRandomWaitStates_e")
    1047                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1048                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1049              $C$DW$122       .dwtag  DW_TAG_TI_far_type
    1050                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$41)
    1051              $C$DW$T$42      .dwtag  DW_TAG_const_type
    1052                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$122)
    1053              
    1054              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    1055                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1056              $C$DW$123       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_1"), DW_AT_const_value(0x01)
    1057              $C$DW$124       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_2"), DW_AT_const_value(0x02)
    1058              $C$DW$125       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_3"), DW_AT_const_value(0x03)
    1059              $C$DW$126       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_4"), DW_AT_const_value(0x04)
    1060              $C$DW$127       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_5"), DW_AT_const_value(0x05)
    1061              $C$DW$128       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_6"), DW_AT_const_value(0x06)
    1062              $C$DW$129       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_7"), DW_AT_const_value(0x07)
    1063              $C$DW$130       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_8"), DW_AT_const_value(0x08)
    1064              $C$DW$131       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_9"), DW_AT_const_value(0x09)
    1065              $C$DW$132       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_10"), DW_AT_const_value(0x0a)
    1066              $C$DW$133       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_11"), DW_AT_const_value(0x0b)
    1067              $C$DW$134       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_12"), DW_AT_const_value(0x0c)
    1068              $C$DW$135       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_13"), DW_AT_const_value(0x0d)
    1069              $C$DW$136       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_14"), DW_AT_const_value(0x0e)
    1070              $C$DW$137       .dwtag  DW_TAG_enumerator, DW_AT_name("FLASH_NumOtpWaitStates_15"), DW_AT_const_value(0x0f)
    1071                      .dwendtag $C$DW$T$43
    1072              
    1073              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_NumOtpWaitStates_e")
    1074                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1075                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1076              $C$DW$138       .dwtag  DW_TAG_TI_far_type
    1077                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$44)
    1078              $C$DW$T$45      .dwtag  DW_TAG_const_type
    1079                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$138)
    1080              
    1081              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1082                      .dwattr $C$DW$T$21, DW_AT_name("_FLASH_Obj_")
    1083                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    1084              $C$DW$139       .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1086                      .dwattr $C$DW$139, DW_AT_name("FOPT")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:06 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0293611                            PAGE   21

    1087                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_FOPT")
    1088                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1090              $C$DW$140       .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1092                      .dwattr $C$DW$140, DW_AT_name("rsvd_1")
    1093                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd_1")
    1094                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1095                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1096              $C$DW$141       .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1098                      .dwattr $C$DW$141, DW_AT_name("FPWR")
    1099                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_FPWR")
    1100                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1101                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1102              $C$DW$142       .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1104                      .dwattr $C$DW$142, DW_AT_name("FSTATUS")
    1105                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_FSTATUS")
    1106                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1107                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1108              $C$DW$143       .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1110                      .dwattr $C$DW$143, DW_AT_name("FSTDBYWAIT")
    1111                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    1112                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1113                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1114              $C$DW$144       .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1116                      .dwattr $C$DW$144, DW_AT_name("FACTIVEWAIT")
    1117                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    1118                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1119                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1120              $C$DW$145       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1122                      .dwattr $C$DW$145, DW_AT_name("FBANKWAIT")
    1123                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_FBANKWAIT")
    1124                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1125                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1126              $C$DW$146       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1128                      .dwattr $C$DW$146, DW_AT_name("FOTPWAIT")
    1129                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_FOTPWAIT")
    1130                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1131                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1132                      .dwendtag $C$DW$T$21
    1133              
    1134              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Obj")
    1135                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$21)
    1136                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1137              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    1138                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
    1139                      .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
    1140              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    1141                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:06 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0293611                            PAGE   22

    1142                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1143              $C$DW$147       .dwtag  DW_TAG_TI_far_type
    1144                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$25)
    1145              $C$DW$T$47      .dwtag  DW_TAG_const_type
    1146                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$147)
    1147              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1148                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1149              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1150                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1151                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1152              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1153                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1154                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1155                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1156              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1157                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1158                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1159                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1160              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1161                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1162                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1163                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1164              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1165                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1166                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1167                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1168              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1169                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1170                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1171                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1172              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1173                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1174                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1175                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1176              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1177                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1178                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1179                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1180              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1181                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
