TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:33 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209211                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 12:49:33 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/modules/pid/src/32b/pid.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab21\Release")
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.4\bin\opt2000.exe C:\\Users\\grant\\AppData\\Local\\Temp\

      38                      .dwattr $C$DW$3, DW_AT_type(*$C$DW$T$25)
      39                      .dwattr $C$DW$3, DW_AT_location[DW_OP_reg0]
      40              
      41              ;***************************************************************
      42              ;* FNAME: _PID_init                     FR SIZE:   0           *
      43              ;*                                                             *
      44              ;* FUNCTION ENVIRONMENT                                        *
      45              ;*                                                             *
      46              ;* FUNCTION PROPERTIES                                         *
      47              ;*                            0 Parameter,  0 Auto,  0 SOE     *
      48              ;***************************************************************
      49              
      50              _PID_init:
      51              ;* AR6   assigned to _numBytes
      52              $C$DW$4 .dwtag  DW_TAG_variable, DW_AT_name("numBytes")
      53                      .dwattr $C$DW$4, DW_AT_TI_symbol_name("_numBytes")
      54                      .dwattr $C$DW$4, DW_AT_type(*$C$DW$T$25)
      55                      .dwattr $C$DW$4, DW_AT_location[DW_OP_reg16]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:33 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209211                            PAGE    2

      56              ;* AR4   assigned to _pMemory
      57              $C$DW$5 .dwtag  DW_TAG_variable, DW_AT_name("pMemory")
      58                      .dwattr $C$DW$5, DW_AT_TI_symbol_name("_pMemory")
      59                      .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$28)
      60                      .dwattr $C$DW$5, DW_AT_location[DW_OP_reg12]
      61                      .dwcfi  cfa_offset, -2
      62                      .dwcfi  save_reg_to_mem, 26, 0
      63 00000000 1EA6          MOVL      XAR6,ACC              ; [CPU_] |57| 
      64                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_14/sw/modules/pid/src/32b/pid.c",line 61,column 3,is_
      65 00000001 0210          MOVB      ACC,#16               ; [CPU_] |61| 
      66 00000002 0FA6          CMPL      ACC,XAR6              ; [CPU_] |61| 
      67 00000003 56C9          BF        $C$L1,LOS             ; [CPU_] |61| 
         00000004 0004 
      68                      ; branchcc occurs ; [] |61| 
      69                      .dwcfi  remember_state
      70                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_14/sw/modules/pid/src/32b/pid.c",line 62,column 5,is_
      71 00000005 D400          MOVB      XAR4,#0               ; [CPU_] |62| 
      72              $C$DW$6 .dwtag  DW_TAG_TI_branch
      73                      .dwattr $C$DW$6, DW_AT_low_pc(0x00)
      74                      .dwattr $C$DW$6, DW_AT_TI_return
      75 00000006 0006          LRETR     ; [CPU_] 
      76                      ; return occurs ; [] 
      77                      .dwcfi  restore_state
      78 00000007       $C$L1:    
      79                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_14/sw/modules/pid/src/32b/pid.h",line 413,column 3,is
      80 00000007 0200          MOVB      ACC,#0                ; [CPU_] |413| 
      81                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_14/sw/modules/pid/src/32b/pid.h",line 400,column 3,is
      82 00000008 D008          MOVB      XAR0,#8               ; [CPU_] |400| 
      83                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_14/sw/modules/pid/src/32b/pid.h",line 413,column 3,is
      84 00000009 1EF4          MOVL      *+XAR4[6],ACC         ; [CPU_] |413| 
      85                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_14/sw/modules/pid/src/32b/pid.h",line 400,column 3,is
      86 0000000a 1E94          MOVL      *+XAR4[AR0],ACC       ; [CPU_] |400| 
      87                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_14/sw/modules/pid/src/32b/pid.h",line 290,column 3,is
      88 0000000b D00A          MOVB      XAR0,#10              ; [CPU_] |290| 
      89 0000000c 1E94          MOVL      *+XAR4[AR0],ACC       ; [CPU_] |290| 
      90              $C$DW$7 .dwtag  DW_TAG_TI_branch
      91                      .dwattr $C$DW$7, DW_AT_low_pc(0x00)
      92                      .dwattr $C$DW$7, DW_AT_TI_return
      93 0000000d 0006          LRETR     ; [CPU_] 
      94                      ; return occurs ; [] 
      95                      .dwattr $C$DW$1, DW_AT_TI_end_file("C:/ti/motorware/motorware_1_01_00_14/sw/modules/pid/src/32b/pid.c
      96                      .dwattr $C$DW$1, DW_AT_TI_end_line(0x49)
      97                      .dwattr $C$DW$1, DW_AT_TI_end_column(0x01)
      98                      .dwendentry
      99                      .dwendtag $C$DW$1
     100              
     101              
     102              ;***************************************************************
     103              ;* TYPE INFORMATION                                            *
     104              ;***************************************************************
     105              
     106              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     107                      .dwattr $C$DW$T$20, DW_AT_name("_PID_Obj_")
     108                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x10)
     109              $C$DW$8 .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:33 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209211                            PAGE    3

     110                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     111                      .dwattr $C$DW$8, DW_AT_name("Kp")
     112                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_Kp")
     113                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     114                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     115              $C$DW$9 .dwtag  DW_TAG_member
     116                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     117                      .dwattr $C$DW$9, DW_AT_name("Ki")
     118                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_Ki")
     119                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     120                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     121              $C$DW$10        .dwtag  DW_TAG_member
     122                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     123                      .dwattr $C$DW$10, DW_AT_name("Kd")
     124                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_Kd")
     125                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     126                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     127              $C$DW$11        .dwtag  DW_TAG_member
     128                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     129                      .dwattr $C$DW$11, DW_AT_name("Ui")
     130                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_Ui")
     131                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     132                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     133              $C$DW$12        .dwtag  DW_TAG_member
     134                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     135                      .dwattr $C$DW$12, DW_AT_name("refValue")
     136                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_refValue")
     137                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     138                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     139              $C$DW$13        .dwtag  DW_TAG_member
     140                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     141                      .dwattr $C$DW$13, DW_AT_name("fbackValue")
     142                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_fbackValue")
     143                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     144                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     145              $C$DW$14        .dwtag  DW_TAG_member
     146                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     147                      .dwattr $C$DW$14, DW_AT_name("outMin")
     148                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_outMin")
     149                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     150                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     151              $C$DW$15        .dwtag  DW_TAG_member
     152                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     153                      .dwattr $C$DW$15, DW_AT_name("outMax")
     154                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_outMax")
     155                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     156                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     157                      .dwendtag $C$DW$T$20
     158              
     159              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
     160                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     161                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     162              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     163                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
     164                      .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:33 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209211                            PAGE    4

     165              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
     166                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     167                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     168              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     169                      .dwattr $C$DW$T$2, DW_AT_name("void")
     170              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     171                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     172                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     173              $C$DW$16        .dwtag  DW_TAG_TI_far_type
     174                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$3)
     175              $C$DW$T$28      .dwtag  DW_TAG_const_type
     176                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$16)
     177              $C$DW$T$4       .dwtag  DW_TAG_base_type
     178                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     179                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     180                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     181              $C$DW$T$5       .dwtag  DW_TAG_base_type
     182                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     183                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     184                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     185              $C$DW$T$6       .dwtag  DW_TAG_base_type
     186                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     187                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     188                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     189              $C$DW$T$7       .dwtag  DW_TAG_base_type
     190                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     191                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     192                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     193              $C$DW$T$8       .dwtag  DW_TAG_base_type
     194                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     195                      .dwattr $C$DW$T$8, DW_AT_name("short")
     196                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     197              $C$DW$T$9       .dwtag  DW_TAG_base_type
     198                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     199                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     200                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     201              $C$DW$T$10      .dwtag  DW_TAG_base_type
     202                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     203                      .dwattr $C$DW$T$10, DW_AT_name("int")
     204                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     205              $C$DW$T$11      .dwtag  DW_TAG_base_type
     206                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
