TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 12:49:33 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/drivers/pie/src/32b/f28x/f2806x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab21\Release")
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.4\bin\opt2000.exe C:\\Users\\grant\\AppData\\Local\\Temp\

    1975              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT5"), DW_AT_const_value(0x05)
    1976              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT6"), DW_AT_const_value(0x06)
    1977              $C$DW$275       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT7"), DW_AT_const_value(0x07)
    1978              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT8"), DW_AT_const_value(0x08)
    1979              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT9"), DW_AT_const_value(0x09)
    1980              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT10"), DW_AT_const_value(0x0a)
    1981              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT11"), DW_AT_const_value(0x0b)
    1982              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT12"), DW_AT_const_value(0x0c)
    1983              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_TINT1"), DW_AT_const_value(0x0d)
    1984              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_TINT2"), DW_AT_const_value(0x0e)
    1985              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_DATALOG"), DW_AT_const_value(0x0f
    1986              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_RTOSINT"), DW_AT_const_value(0x10
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   38

    1987              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_EMUINT"), DW_AT_const_value(0x11)
    1988              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_NMI"), DW_AT_const_value(0x12)
    1989              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_ILLEGAL"), DW_AT_const_value(0x13
    1990              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER1"), DW_AT_const_value(0x14)
    1991              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER2"), DW_AT_const_value(0x15)
    1992              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER3"), DW_AT_const_value(0x16)
    1993              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER4"), DW_AT_const_value(0x17)
    1994              $C$DW$292       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER5"), DW_AT_const_value(0x18)
    1995              $C$DW$293       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER6"), DW_AT_const_value(0x19)
    1996              $C$DW$294       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER7"), DW_AT_const_value(0x1a)
    1997              $C$DW$295       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER8"), DW_AT_const_value(0x1b)
    1998              $C$DW$296       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER9"), DW_AT_const_value(0x1c)
    1999              $C$DW$297       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER10"), DW_AT_const_value(0x1d)
    2000              $C$DW$298       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER11"), DW_AT_const_value(0x1e)
    2001              $C$DW$299       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER12"), DW_AT_const_value(0x1f)
    2002                      .dwendtag $C$DW$T$52
    2003              
    2004              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_SystemInterrupts_e")
    2005                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2006                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2007              $C$DW$300       .dwtag  DW_TAG_TI_far_type
    2008                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$53)
    2009              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2010                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$300)
    2011              
    2012              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    2013                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    2014              $C$DW$301       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_FallingEdge"), DW_AT_const_value(0x
    2015              $C$DW$302       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_RisingEdge"), DW_AT_const_value(0x0
    2016              $C$DW$303       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_RisingAndFallingEdge"), DW_AT_const
    2017                      .dwendtag $C$DW$T$55
    2018              
    2019              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_ExtIntPolarity_e")
    2020                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2021                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2022              $C$DW$304       .dwtag  DW_TAG_TI_far_type
    2023                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$56)
    2024              $C$DW$T$57      .dwtag  DW_TAG_const_type
    2025                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$304)
    2026              
    2027              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2028                      .dwattr $C$DW$T$21, DW_AT_name("_PIE_IERIFR_t")
    2029                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
    2030              $C$DW$305       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$20)
    2032                      .dwattr $C$DW$305, DW_AT_name("IER")
    2033                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_IER")
    2034                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2035                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2036              $C$DW$306       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    2038                      .dwattr $C$DW$306, DW_AT_name("IFR")
    2039                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_IFR")
    2040                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2041                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   39

    2042                      .dwendtag $C$DW$T$21
    2043              
    2044              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
    2045                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    2046                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2047              $C$DW$307       .dwtag  DW_TAG_TI_far_type
    2048                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$22)
    2049              $C$DW$T$23      .dwtag  DW_TAG_volatile_type
    2050                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$307)
    2051              
    2052              $C$DW$T$24      .dwtag  DW_TAG_array_type
    2053                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2054                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    2055                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
    2056              $C$DW$308       .dwtag  DW_TAG_subrange_type
    2057                      .dwattr $C$DW$308, DW_AT_upper_bound(0x0b)
    2058                      .dwendtag $C$DW$T$24
    2059              
    2060              
    2061              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2062                      .dwattr $C$DW$T$33, DW_AT_name("_PIE_Obj_")
    2063                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x639c)
    2064              $C$DW$309       .dwtag  DW_TAG_member
    2065                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
    2066                      .dwattr $C$DW$309, DW_AT_name("PIECTRL")
    2067                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_PIECTRL")
    2068                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2069                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2070              $C$DW$310       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    2072                      .dwattr $C$DW$310, DW_AT_name("PIEACK")
    2073                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_PIEACK")
    2074                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2075                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2076              $C$DW$311       .dwtag  DW_TAG_member
    2077                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$24)
    2078                      .dwattr $C$DW$311, DW_AT_name("PIEIER_PIEIFR")
    2079                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
    2080                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2081                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2082              $C$DW$312       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$25)
    2084                      .dwattr $C$DW$312, DW_AT_name("rsvd_1")
    2085                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_rsvd_1")
    2086                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2087                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2088              $C$DW$313       .dwtag  DW_TAG_member
    2089                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$29)
    2090                      .dwattr $C$DW$313, DW_AT_name("Reset")
    2091                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_Reset")
    2092                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2093                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2094              $C$DW$314       .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$29)
    2096                      .dwattr $C$DW$314, DW_AT_name("INT1")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   40

    2097                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_INT1")
    2098                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2099                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2100              $C$DW$315       .dwtag  DW_TAG_member
    2101                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$29)
    2102                      .dwattr $C$DW$315, DW_AT_name("INT2")
    2103                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_INT2")
    2104                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2105                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2106              $C$DW$316       .dwtag  DW_TAG_member
    2107                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$29)
    2108                      .dwattr $C$DW$316, DW_AT_name("INT3")
    2109                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_INT3")
    2110                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2111                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2112              $C$DW$317       .dwtag  DW_TAG_member
    2113                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$29)
    2114                      .dwattr $C$DW$317, DW_AT_name("INT4")
    2115                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_INT4")
    2116                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2117                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2118              $C$DW$318       .dwtag  DW_TAG_member
    2119                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$29)
    2120                      .dwattr $C$DW$318, DW_AT_name("INT5")
    2121                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_INT5")
    2122                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2123                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2124              $C$DW$319       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$29)
    2126                      .dwattr $C$DW$319, DW_AT_name("INT6")
    2127                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_INT6")
    2128                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2129                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2130              $C$DW$320       .dwtag  DW_TAG_member
    2131                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$29)
    2132                      .dwattr $C$DW$320, DW_AT_name("INT7")
    2133                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_INT7")
    2134                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2135                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2136              $C$DW$321       .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$29)
    2138                      .dwattr $C$DW$321, DW_AT_name("INT8")
    2139                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_INT8")
    2140                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2141                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2142              $C$DW$322       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$29)
    2144                      .dwattr $C$DW$322, DW_AT_name("INT9")
    2145                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_INT9")
    2146                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2147                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2148              $C$DW$323       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$29)
    2150                      .dwattr $C$DW$323, DW_AT_name("INT10")
    2151                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_INT10")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   41

    2152                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2153                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2154              $C$DW$324       .dwtag  DW_TAG_member
    2155                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$29)
    2156                      .dwattr $C$DW$324, DW_AT_name("INT11")
    2157                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_INT11")
    2158                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2159                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2160              $C$DW$325       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$29)
    2162                      .dwattr $C$DW$325, DW_AT_name("INT12")
    2163                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_INT12")
    2164                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2165                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2166              $C$DW$326       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$29)
    2168                      .dwattr $C$DW$326, DW_AT_name("TINT1")
    2169                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_TINT1")
    2170                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2171                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2172              $C$DW$327       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$29)
    2174                      .dwattr $C$DW$327, DW_AT_name("TINT2")
    2175                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_TINT2")
    2176                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2177                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2178              $C$DW$328       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$29)
    2180                      .dwattr $C$DW$328, DW_AT_name("DATALOG")
    2181                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_DATALOG")
    2182                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2183                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2184              $C$DW$329       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$29)
    2186                      .dwattr $C$DW$329, DW_AT_name("RTOSINT")
    2187                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_RTOSINT")
    2188                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2189                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2190              $C$DW$330       .dwtag  DW_TAG_member
    2191                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$29)
    2192                      .dwattr $C$DW$330, DW_AT_name("EMUINT")
    2193                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_EMUINT")
    2194                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2195                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2196              $C$DW$331       .dwtag  DW_TAG_member
    2197                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$29)
    2198                      .dwattr $C$DW$331, DW_AT_name("NMI")
    2199                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_NMI")
    2200                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2201                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2202              $C$DW$332       .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$29)
    2204                      .dwattr $C$DW$332, DW_AT_name("ILLEGAL")
    2205                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_ILLEGAL")
    2206                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   42

    2207                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2208              $C$DW$333       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$29)
    2210                      .dwattr $C$DW$333, DW_AT_name("USER1")
    2211                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_USER1")
    2212                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2213                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2214              $C$DW$334       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$29)
    2216                      .dwattr $C$DW$334, DW_AT_name("USER2")
    2217                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_USER2")
    2218                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2219                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2220              $C$DW$335       .dwtag  DW_TAG_member
    2221                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$29)
    2222                      .dwattr $C$DW$335, DW_AT_name("USER3")
    2223                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_USER3")
    2224                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2225                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2226              $C$DW$336       .dwtag  DW_TAG_member
    2227                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$29)
    2228                      .dwattr $C$DW$336, DW_AT_name("USER4")
    2229                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_USER4")
    2230                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2231                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2232              $C$DW$337       .dwtag  DW_TAG_member
    2233                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$29)
    2234                      .dwattr $C$DW$337, DW_AT_name("USER5")
    2235                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_USER5")
    2236                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2237                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2238              $C$DW$338       .dwtag  DW_TAG_member
    2239                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$29)
    2240                      .dwattr $C$DW$338, DW_AT_name("USER6")
    2241                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_USER6")
    2242                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2243                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2244              $C$DW$339       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$29)
    2246                      .dwattr $C$DW$339, DW_AT_name("USER7")
    2247                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_USER7")
    2248                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2249                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2250              $C$DW$340       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$29)
    2252                      .dwattr $C$DW$340, DW_AT_name("USER8")
    2253                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_USER8")
    2254                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2255                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2256              $C$DW$341       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$29)
    2258                      .dwattr $C$DW$341, DW_AT_name("USER9")
    2259                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_USER9")
    2260                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2261                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   43

    2262              $C$DW$342       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$29)
    2264                      .dwattr $C$DW$342, DW_AT_name("USER10")
    2265                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_USER10")
    2266                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2267                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2268              $C$DW$343       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$29)
    2270                      .dwattr $C$DW$343, DW_AT_name("USER11")
    2271                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_USER11")
    2272                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2273                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2274              $C$DW$344       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$29)
    2276                      .dwattr $C$DW$344, DW_AT_name("USER12")
    2277                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_USER12")
    2278                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2279                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2280              $C$DW$345       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$29)
    2282                      .dwattr $C$DW$345, DW_AT_name("ADCINT1_HP")
    2283                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_ADCINT1_HP")
    2284                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2285                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2286              $C$DW$346       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$29)
    2288                      .dwattr $C$DW$346, DW_AT_name("ADCINT2_HP")
    2289                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_ADCINT2_HP")
    2290                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2291                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2292              $C$DW$347       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$29)
    2294                      .dwattr $C$DW$347, DW_AT_name("rsvd1_3")
    2295                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_rsvd1_3")
    2296                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2297                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2298              $C$DW$348       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$29)
    2300                      .dwattr $C$DW$348, DW_AT_name("XINT1")
    2301                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_XINT1")
    2302                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2303                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2304              $C$DW$349       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$29)
    2306                      .dwattr $C$DW$349, DW_AT_name("XINT2")
    2307                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_XINT2")
    2308                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2309                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2310              $C$DW$350       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$29)
    2312                      .dwattr $C$DW$350, DW_AT_name("ADCINT9")
    2313                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_ADCINT9")
    2314                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2315                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2316              $C$DW$351       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   44

    2317                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$29)
    2318                      .dwattr $C$DW$351, DW_AT_name("TINT0")
    2319                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_TINT0")
    2320                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2321                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2322              $C$DW$352       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$29)
    2324                      .dwattr $C$DW$352, DW_AT_name("WAKEINT")
    2325                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_WAKEINT")
    2326                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2327                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2328              $C$DW$353       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$29)
    2330                      .dwattr $C$DW$353, DW_AT_name("EPWM1_TZINT")
    2331                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    2332                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2333                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2334              $C$DW$354       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$29)
    2336                      .dwattr $C$DW$354, DW_AT_name("EPWM2_TZINT")
    2337                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    2338                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2339                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2340              $C$DW$355       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$29)
    2342                      .dwattr $C$DW$355, DW_AT_name("EPWM3_TZINT")
    2343                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    2344                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2345                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2346              $C$DW$356       .dwtag  DW_TAG_member
    2347                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$29)
    2348                      .dwattr $C$DW$356, DW_AT_name("EPWM4_TZINT")
    2349                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    2350                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2351                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2352              $C$DW$357       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$29)
    2354                      .dwattr $C$DW$357, DW_AT_name("EPWM5_TZINT")
    2355                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_EPWM5_TZINT")
    2356                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2357                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2358              $C$DW$358       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$29)
    2360                      .dwattr $C$DW$358, DW_AT_name("EPWM6_TZINT")
    2361                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_EPWM6_TZINT")
    2362                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2363                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2364              $C$DW$359       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$29)
    2366                      .dwattr $C$DW$359, DW_AT_name("EPWM7_TZINT")
    2367                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_EPWM7_TZINT")
    2368                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2369                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2370              $C$DW$360       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   45

    2372                      .dwattr $C$DW$360, DW_AT_name("EPWM8_TZINT")
    2373                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_EPWM8_TZINT")
    2374                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2375                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2376              $C$DW$361       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$29)
    2378                      .dwattr $C$DW$361, DW_AT_name("EPWM1_INT")
    2379                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_EPWM1_INT")
    2380                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2381                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2382              $C$DW$362       .dwtag  DW_TAG_member
    2383                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$29)
    2384                      .dwattr $C$DW$362, DW_AT_name("EPWM2_INT")
    2385                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_EPWM2_INT")
    2386                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2387                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2388              $C$DW$363       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$29)
    2390                      .dwattr $C$DW$363, DW_AT_name("EPWM3_INT")
    2391                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_EPWM3_INT")
    2392                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2393                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2394              $C$DW$364       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$29)
    2396                      .dwattr $C$DW$364, DW_AT_name("EPWM4_INT")
    2397                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_EPWM4_INT")
    2398                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    2399                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2400              $C$DW$365       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$29)
    2402                      .dwattr $C$DW$365, DW_AT_name("EPWM5_INT")
    2403                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_EPWM5_INT")
    2404                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2405                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2406              $C$DW$366       .dwtag  DW_TAG_member
    2407                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$29)
    2408                      .dwattr $C$DW$366, DW_AT_name("EPWM6_INT")
    2409                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_EPWM6_INT")
    2410                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2411                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2412              $C$DW$367       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$29)
    2414                      .dwattr $C$DW$367, DW_AT_name("EPWM7_INT")
    2415                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_EPWM7_INT")
    2416                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2417                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2418              $C$DW$368       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$29)
    2420                      .dwattr $C$DW$368, DW_AT_name("EPWM8_INT")
    2421                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_EPWM8_INT")
    2422                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    2423                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2424              $C$DW$369       .dwtag  DW_TAG_member
    2425                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$29)
    2426                      .dwattr $C$DW$369, DW_AT_name("ECAP1_INT")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   46

    2427                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ECAP1_INT")
    2428                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2429                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2430              $C$DW$370       .dwtag  DW_TAG_member
    2431                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$29)
    2432                      .dwattr $C$DW$370, DW_AT_name("ECAP2_INT")
    2433                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_ECAP2_INT")
    2434                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2435                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2436              $C$DW$371       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$29)
    2438                      .dwattr $C$DW$371, DW_AT_name("ECAP3_INT")
    2439                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_ECAP3_INT")
    2440                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2441                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2442              $C$DW$372       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$29)
    2444                      .dwattr $C$DW$372, DW_AT_name("rsvd4_4")
    2445                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_rsvd4_4")
    2446                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2447                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2448              $C$DW$373       .dwtag  DW_TAG_member
    2449                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$29)
    2450                      .dwattr $C$DW$373, DW_AT_name("rsvd4_5")
    2451                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd4_5")
    2452                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2453                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2454              $C$DW$374       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$29)
    2456                      .dwattr $C$DW$374, DW_AT_name("rsvd4_6")
    2457                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_rsvd4_6")
    2458                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2459                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2460              $C$DW$375       .dwtag  DW_TAG_member
    2461                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$29)
    2462                      .dwattr $C$DW$375, DW_AT_name("HRCAP1_INT")
    2463                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_HRCAP1_INT")
    2464                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2465                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2466              $C$DW$376       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$29)
    2468                      .dwattr $C$DW$376, DW_AT_name("HRCAP2_INT")
    2469                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_HRCAP2_INT")
    2470                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2471                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2472              $C$DW$377       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$29)
    2474                      .dwattr $C$DW$377, DW_AT_name("EQEP1_INT")
    2475                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_EQEP1_INT")
    2476                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2477                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2478              $C$DW$378       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$29)
    2480                      .dwattr $C$DW$378, DW_AT_name("EQEP2_INT")
    2481                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_EQEP2_INT")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   47

    2482                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2483                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2484              $C$DW$379       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$29)
    2486                      .dwattr $C$DW$379, DW_AT_name("rsvd5_3")
    2487                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_rsvd5_3")
    2488                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2489                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2490              $C$DW$380       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$29)
    2492                      .dwattr $C$DW$380, DW_AT_name("HRCAP3_INT")
    2493                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_HRCAP3_INT")
    2494                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2495                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2496              $C$DW$381       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$29)
    2498                      .dwattr $C$DW$381, DW_AT_name("HRCAP4_INT")
    2499                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_HRCAP4_INT")
    2500                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2501                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2502              $C$DW$382       .dwtag  DW_TAG_member
    2503                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$29)
    2504                      .dwattr $C$DW$382, DW_AT_name("rsvd5_6")
    2505                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_rsvd5_6")
    2506                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2507                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2508              $C$DW$383       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$29)
    2510                      .dwattr $C$DW$383, DW_AT_name("rsvd5_7")
    2511                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_rsvd5_7")
    2512                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2513                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2514              $C$DW$384       .dwtag  DW_TAG_member
    2515                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$29)
    2516                      .dwattr $C$DW$384, DW_AT_name("USB0_INT")
    2517                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_USB0_INT")
    2518                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2519                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2520              $C$DW$385       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$29)
    2522                      .dwattr $C$DW$385, DW_AT_name("SPIRXINTA")
    2523                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_SPIRXINTA")
    2524                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2525                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2526              $C$DW$386       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$29)
    2528                      .dwattr $C$DW$386, DW_AT_name("SPITXINTA")
    2529                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_SPITXINTA")
    2530                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2531                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2532              $C$DW$387       .dwtag  DW_TAG_member
    2533                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$29)
    2534                      .dwattr $C$DW$387, DW_AT_name("SPIRXINTB")
    2535                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_SPIRXINTB")
    2536                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   48

    2537                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2538              $C$DW$388       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$29)
    2540                      .dwattr $C$DW$388, DW_AT_name("SPITXINTB")
    2541                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_SPITXINTB")
    2542                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2543                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2544              $C$DW$389       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$29)
    2546                      .dwattr $C$DW$389, DW_AT_name("MCBSPARX")
    2547                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_MCBSPARX")
    2548                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2549                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2550              $C$DW$390       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$29)
    2552                      .dwattr $C$DW$390, DW_AT_name("MCBSPATX")
    2553                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_MCBSPATX")
    2554                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2555                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2556              $C$DW$391       .dwtag  DW_TAG_member
    2557                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$29)
    2558                      .dwattr $C$DW$391, DW_AT_name("rsvd6_7")
    2559                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_rsvd6_7")
    2560                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2561                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2562              $C$DW$392       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$29)
    2564                      .dwattr $C$DW$392, DW_AT_name("rsvd6_8")
    2565                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_rsvd6_8")
    2566                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    2567                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2568              $C$DW$393       .dwtag  DW_TAG_member
    2569                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$29)
    2570                      .dwattr $C$DW$393, DW_AT_name("DMACH1_INT")
    2571                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_DMACH1_INT")
    2572                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2573                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2574              $C$DW$394       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$29)
    2576                      .dwattr $C$DW$394, DW_AT_name("DMACH2_INT")
    2577                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_DMACH2_INT")
    2578                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    2579                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2580              $C$DW$395       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$29)
    2582                      .dwattr $C$DW$395, DW_AT_name("DMACH3_INT")
    2583                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_DMACH3_INT")
    2584                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2585                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    2586              $C$DW$396       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$29)
    2588                      .dwattr $C$DW$396, DW_AT_name("DMACH4_INT")
    2589                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_DMACH4_INT")
    2590                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2591                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   49

    2592              $C$DW$397       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$29)
    2594                      .dwattr $C$DW$397, DW_AT_name("DMACH5_INT")
    2595                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_DMACH5_INT")
    2596                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2597                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2598              $C$DW$398       .dwtag  DW_TAG_member
    2599                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$29)
    2600                      .dwattr $C$DW$398, DW_AT_name("DMACH6_INT")
    2601                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_DMACH6_INT")
    2602                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    2603                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    2604              $C$DW$399       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$29)
    2606                      .dwattr $C$DW$399, DW_AT_name("rsvd7_7")
    2607                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_rsvd7_7")
    2608                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2609                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    2610              $C$DW$400       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$29)
    2612                      .dwattr $C$DW$400, DW_AT_name("rsvd7_8")
    2613                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_rsvd7_8")
    2614                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2615                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2616              $C$DW$401       .dwtag  DW_TAG_member
    2617                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$29)
    2618                      .dwattr $C$DW$401, DW_AT_name("I2CINT1A")
    2619                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_I2CINT1A")
    2620                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2621                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    2622              $C$DW$402       .dwtag  DW_TAG_member
    2623                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$29)
    2624                      .dwattr $C$DW$402, DW_AT_name("I2CINT2A")
    2625                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_I2CINT2A")
    2626                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2627                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    2628              $C$DW$403       .dwtag  DW_TAG_member
    2629                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$29)
    2630                      .dwattr $C$DW$403, DW_AT_name("rsvd8_3")
    2631                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_rsvd8_3")
    2632                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2633                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    2634              $C$DW$404       .dwtag  DW_TAG_member
    2635                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$29)
    2636                      .dwattr $C$DW$404, DW_AT_name("rsvd8_4")
    2637                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_rsvd8_4")
    2638                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    2639                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    2640              $C$DW$405       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$29)
    2642                      .dwattr $C$DW$405, DW_AT_name("rsvd8_5")
    2643                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_rsvd8_5")
    2644                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2645                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    2646              $C$DW$406       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   50

    2647                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$29)
    2648                      .dwattr $C$DW$406, DW_AT_name("rsvd8_6")
    2649                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_rsvd8_6")
    2650                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    2651                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    2652              $C$DW$407       .dwtag  DW_TAG_member
    2653                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$29)
    2654                      .dwattr $C$DW$407, DW_AT_name("rsvd8_7")
    2655                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_rsvd8_7")
    2656                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2657                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    2658              $C$DW$408       .dwtag  DW_TAG_member
    2659                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$29)
    2660                      .dwattr $C$DW$408, DW_AT_name("rsvd8_8")
    2661                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_rsvd8_8")
    2662                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2663                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    2664              $C$DW$409       .dwtag  DW_TAG_member
    2665                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$29)
    2666                      .dwattr $C$DW$409, DW_AT_name("SCIRXINTA")
    2667                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_SCIRXINTA")
    2668                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2669                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    2670              $C$DW$410       .dwtag  DW_TAG_member
    2671                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$29)
    2672                      .dwattr $C$DW$410, DW_AT_name("SCITXINTA")
    2673                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_SCITXINTA")
    2674                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2675                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    2676              $C$DW$411       .dwtag  DW_TAG_member
    2677                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$29)
    2678                      .dwattr $C$DW$411, DW_AT_name("SCIRXINTB")
    2679                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_SCIRXINTB")
    2680                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2681                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    2682              $C$DW$412       .dwtag  DW_TAG_member
    2683                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$29)
    2684                      .dwattr $C$DW$412, DW_AT_name("SCITXINTB")
    2685                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_SCITXINTB")
    2686                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2687                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    2688              $C$DW$413       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$29)
    2690                      .dwattr $C$DW$413, DW_AT_name("ECAN0INT")
    2691                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_ECAN0INT")
    2692                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2693                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    2694              $C$DW$414       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$29)
    2696                      .dwattr $C$DW$414, DW_AT_name("ECAN1INT")
    2697                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_ECAN1INT")
    2698                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    2699                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    2700              $C$DW$415       .dwtag  DW_TAG_member
    2701                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   51

    2702                      .dwattr $C$DW$415, DW_AT_name("rsvd9_7")
    2703                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_rsvd9_7")
    2704                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    2705                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    2706              $C$DW$416       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$29)
    2708                      .dwattr $C$DW$416, DW_AT_name("rsvd9_8")
    2709                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_rsvd9_8")
    2710                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    2711                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    2712              $C$DW$417       .dwtag  DW_TAG_member
    2713                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$29)
    2714                      .dwattr $C$DW$417, DW_AT_name("ADCINT1")
    2715                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_ADCINT1")
    2716                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    2717                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    2718              $C$DW$418       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$29)
    2720                      .dwattr $C$DW$418, DW_AT_name("ADCINT2")
    2721                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_ADCINT2")
    2722                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    2723                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    2724              $C$DW$419       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$29)
    2726                      .dwattr $C$DW$419, DW_AT_name("ADCINT3")
    2727                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_ADCINT3")
    2728                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    2729                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    2730              $C$DW$420       .dwtag  DW_TAG_member
    2731                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$29)
    2732                      .dwattr $C$DW$420, DW_AT_name("ADCINT4")
    2733                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_ADCINT4")
    2734                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    2735                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    2736              $C$DW$421       .dwtag  DW_TAG_member
    2737                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$29)
    2738                      .dwattr $C$DW$421, DW_AT_name("ADCINT5")
    2739                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_ADCINT5")
    2740                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    2741                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    2742              $C$DW$422       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$29)
    2744                      .dwattr $C$DW$422, DW_AT_name("ADCINT6")
    2745                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_ADCINT6")
    2746                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    2747                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    2748              $C$DW$423       .dwtag  DW_TAG_member
    2749                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$29)
    2750                      .dwattr $C$DW$423, DW_AT_name("ADCINT7")
    2751                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_ADCINT7")
    2752                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    2753                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    2754              $C$DW$424       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$29)
    2756                      .dwattr $C$DW$424, DW_AT_name("ADCINT8")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   52

    2757                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_ADCINT8")
    2758                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    2759                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    2760              $C$DW$425       .dwtag  DW_TAG_member
    2761                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$29)
    2762                      .dwattr $C$DW$425, DW_AT_name("CLAINT1")
    2763                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_CLAINT1")
    2764                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2765                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    2766              $C$DW$426       .dwtag  DW_TAG_member
    2767                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$29)
    2768                      .dwattr $C$DW$426, DW_AT_name("CLAINT2")
    2769                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_CLAINT2")
    2770                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    2771                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    2772              $C$DW$427       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$29)
    2774                      .dwattr $C$DW$427, DW_AT_name("CLAINT3")
    2775                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_CLAINT3")
    2776                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2777                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    2778              $C$DW$428       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$29)
    2780                      .dwattr $C$DW$428, DW_AT_name("CLAINT4")
    2781                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_CLAINT4")
    2782                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    2783                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    2784              $C$DW$429       .dwtag  DW_TAG_member
    2785                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$29)
    2786                      .dwattr $C$DW$429, DW_AT_name("CLAINT5")
    2787                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_CLAINT5")
    2788                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    2789                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    2790              $C$DW$430       .dwtag  DW_TAG_member
    2791                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$29)
    2792                      .dwattr $C$DW$430, DW_AT_name("CLAINT6")
    2793                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_CLAINT6")
    2794                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    2795                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    2796              $C$DW$431       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$29)
    2798                      .dwattr $C$DW$431, DW_AT_name("CLAINT7")
    2799                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_CLAINT7")
    2800                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    2801                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    2802              $C$DW$432       .dwtag  DW_TAG_member
    2803                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$29)
    2804                      .dwattr $C$DW$432, DW_AT_name("CLAINT8")
    2805                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_CLAINT8")
    2806                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    2807                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    2808              $C$DW$433       .dwtag  DW_TAG_member
    2809                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$29)
    2810                      .dwattr $C$DW$433, DW_AT_name("XINT3")
    2811                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_XINT3")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   53

    2812                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2813                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    2814              $C$DW$434       .dwtag  DW_TAG_member
    2815                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$29)
    2816                      .dwattr $C$DW$434, DW_AT_name("rsvd12_2")
    2817                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd12_2")
    2818                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    2819                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    2820              $C$DW$435       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$29)
    2822                      .dwattr $C$DW$435, DW_AT_name("rsvd12_3")
    2823                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_rsvd12_3")
    2824                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    2825                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    2826              $C$DW$436       .dwtag  DW_TAG_member
    2827                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$29)
    2828                      .dwattr $C$DW$436, DW_AT_name("rsvd12_4")
    2829                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_rsvd12_4")
    2830                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    2831                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    2832              $C$DW$437       .dwtag  DW_TAG_member
    2833                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$29)
    2834                      .dwattr $C$DW$437, DW_AT_name("rsvd12_5")
    2835                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_rsvd12_5")
    2836                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2837                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    2838              $C$DW$438       .dwtag  DW_TAG_member
    2839                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$29)
    2840                      .dwattr $C$DW$438, DW_AT_name("rsvd12_6")
    2841                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_rsvd12_6")
    2842                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
    2843                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    2844              $C$DW$439       .dwtag  DW_TAG_member
    2845                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$29)
    2846                      .dwattr $C$DW$439, DW_AT_name("CLAINT_LVF")
    2847                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_CLAINT_LVF")
    2848                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    2849                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    2850              $C$DW$440       .dwtag  DW_TAG_member
    2851                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$29)
    2852                      .dwattr $C$DW$440, DW_AT_name("CLAINT_LUF")
    2853                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_CLAINT_LUF")
    2854                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x11e]
    2855                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    2856              $C$DW$441       .dwtag  DW_TAG_member
    2857                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$30)
    2858                      .dwattr $C$DW$441, DW_AT_name("rsvd13")
    2859                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_rsvd13")
    2860                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2861                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    2862              $C$DW$442       .dwtag  DW_TAG_member
    2863                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$31)
    2864                      .dwattr $C$DW$442, DW_AT_name("XINTnCR")
    2865                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_XINTnCR")
    2866                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6390]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   54

    2867                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    2868              $C$DW$443       .dwtag  DW_TAG_member
    2869                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$32)
    2870                      .dwattr $C$DW$443, DW_AT_name("rsvd14")
    2871                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_rsvd14")
    2872                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6393]
    2873                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    2874              $C$DW$444       .dwtag  DW_TAG_member
    2875                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$31)
    2876                      .dwattr $C$DW$444, DW_AT_name("XINTnCTR")
    2877                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_XINTnCTR")
    2878                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6398]
    2879                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    2880                      .dwendtag $C$DW$T$33
    2881              
    2882              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_Obj")
    2883                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$33)
    2884                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2885              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    2886                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$33)
    2887                      .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    2888              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_Handle")
    2889                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2890                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2891              $C$DW$445       .dwtag  DW_TAG_TI_far_type
    2892                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$62)
    2893              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2894                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$445)
    2895              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2896                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2897              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2898                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2899                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2900              
    2901              $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    2902                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2903              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2904                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2905                      .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    2906              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IntVec_t")
    2907                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2908                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2909              $C$DW$446       .dwtag  DW_TAG_TI_far_type
    2910                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$28)
    2911              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    2912                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$446)
    2913              $C$DW$447       .dwtag  DW_TAG_TI_far_type
    2914                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$28)
    2915              $C$DW$T$70      .dwtag  DW_TAG_const_type
    2916                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$447)
    2917              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    2918                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
    2919                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    2920              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2921                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:34 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0769610                            PAGE   55

    2922                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2923                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2924              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2925                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2926                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2927                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2928              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2929                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2930                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
