TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 10:37:11 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab21\Release")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_d_pu")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_d_pu")

    2902              $C$DW$332       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    2903              $C$DW$333       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    2904              $C$DW$334       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    2905              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    2906              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    2907              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    2908              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    2909              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    2910              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    2911              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    2912              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    2913              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    2914              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    2915              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    2916              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    2917              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    2918              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    2919              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    2920              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    2921              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    2922              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    2923              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   59

    2924              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    2925              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    2926              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    2927              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    2928              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    2929                      .dwendtag $C$DW$T$74
    2930              
    2931              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    2932                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2933                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2934              $C$DW$359       .dwtag  DW_TAG_TI_far_type
    2935                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$75)
    2936              $C$DW$T$77      .dwtag  DW_TAG_const_type
    2937                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$359)
    2938              
    2939              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    2940                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    2941              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    2942              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    2943              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    2944                      .dwendtag $C$DW$T$82
    2945              
    2946              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    2947                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    2948                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2949              $C$DW$363       .dwtag  DW_TAG_TI_far_type
    2950                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$83)
    2951              $C$DW$T$84      .dwtag  DW_TAG_const_type
    2952                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$363)
    2953              
    2954              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2955                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    2956                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    2957              $C$DW$364       .dwtag  DW_TAG_member
    2958                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    2959                      .dwattr $C$DW$364, DW_AT_name("alpha_sf")
    2960                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_alpha_sf")
    2961                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2962                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2963              $C$DW$365       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    2965                      .dwattr $C$DW$365, DW_AT_name("beta_sf")
    2966                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_beta_sf")
    2967                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2968                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2969              $C$DW$366       .dwtag  DW_TAG_member
    2970                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$22)
    2971                      .dwattr $C$DW$366, DW_AT_name("numSensors")
    2972                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_numSensors")
    2973                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2974                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2975                      .dwendtag $C$DW$T$23
    2976              
    2977              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    2978                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   60

    2979                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2980              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2981                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    2982                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    2983              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    2984                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2985                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2986              
    2987              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2988                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    2989                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    2990              $C$DW$367       .dwtag  DW_TAG_member
    2991                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$24)
    2992                      .dwattr $C$DW$367, DW_AT_name("version")
    2993                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_version")
    2994                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2995                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2996              $C$DW$368       .dwtag  DW_TAG_member
    2997                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$26)
    2998                      .dwattr $C$DW$368, DW_AT_name("state")
    2999                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_state")
    3000                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3001                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3002              $C$DW$369       .dwtag  DW_TAG_member
    3003                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$26)
    3004                      .dwattr $C$DW$369, DW_AT_name("prevState")
    3005                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_prevState")
    3006                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3007                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3008              $C$DW$370       .dwtag  DW_TAG_member
    3009                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$28)
    3010                      .dwattr $C$DW$370, DW_AT_name("errorCode")
    3011                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_errorCode")
    3012                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3013                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3014              $C$DW$371       .dwtag  DW_TAG_member
    3015                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$30)
    3016                      .dwattr $C$DW$371, DW_AT_name("clarkeHandle_I")
    3017                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3018                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3019                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3020              $C$DW$372       .dwtag  DW_TAG_member
    3021                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$31)
    3022                      .dwattr $C$DW$372, DW_AT_name("clarke_I")
    3023                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_clarke_I")
    3024                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3025                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3026              $C$DW$373       .dwtag  DW_TAG_member
    3027                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$30)
    3028                      .dwattr $C$DW$373, DW_AT_name("clarkeHandle_V")
    3029                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3030                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3031                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3032              $C$DW$374       .dwtag  DW_TAG_member
    3033                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   61

    3034                      .dwattr $C$DW$374, DW_AT_name("clarke_V")
    3035                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_clarke_V")
    3036                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3037                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3038              $C$DW$375       .dwtag  DW_TAG_member
    3039                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$33)
    3040                      .dwattr $C$DW$375, DW_AT_name("estHandle")
    3041                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_estHandle")
    3042                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3043                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3044              $C$DW$376       .dwtag  DW_TAG_member
    3045                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$35)
    3046                      .dwattr $C$DW$376, DW_AT_name("parkHandle")
    3047                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_parkHandle")
    3048                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3049                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3050              $C$DW$377       .dwtag  DW_TAG_member
    3051                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$36)
    3052                      .dwattr $C$DW$377, DW_AT_name("park")
    3053                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_park")
    3054                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3055                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3056              $C$DW$378       .dwtag  DW_TAG_member
    3057                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$38)
    3058                      .dwattr $C$DW$378, DW_AT_name("pidHandle_Id")
    3059                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_pidHandle_Id")
    3060                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3061                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3062              $C$DW$379       .dwtag  DW_TAG_member
    3063                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$39)
    3064                      .dwattr $C$DW$379, DW_AT_name("pid_Id")
    3065                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_pid_Id")
    3066                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3067                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3068              $C$DW$380       .dwtag  DW_TAG_member
    3069                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$38)
    3070                      .dwattr $C$DW$380, DW_AT_name("pidHandle_Iq")
    3071                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3072                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3073                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3074              $C$DW$381       .dwtag  DW_TAG_member
    3075                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$39)
    3076                      .dwattr $C$DW$381, DW_AT_name("pid_Iq")
    3077                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_pid_Iq")
    3078                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3079                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3080              $C$DW$382       .dwtag  DW_TAG_member
    3081                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$38)
    3082                      .dwattr $C$DW$382, DW_AT_name("pidHandle_spd")
    3083                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_pidHandle_spd")
    3084                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3085                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3086              $C$DW$383       .dwtag  DW_TAG_member
    3087                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$39)
    3088                      .dwattr $C$DW$383, DW_AT_name("pid_spd")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   62

    3089                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_pid_spd")
    3090                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3091                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3092              $C$DW$384       .dwtag  DW_TAG_member
    3093                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$41)
    3094                      .dwattr $C$DW$384, DW_AT_name("iparkHandle")
    3095                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_iparkHandle")
    3096                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3097                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3098              $C$DW$385       .dwtag  DW_TAG_member
    3099                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$42)
    3100                      .dwattr $C$DW$385, DW_AT_name("ipark")
    3101                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ipark")
    3102                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3103                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3104              $C$DW$386       .dwtag  DW_TAG_member
    3105                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$44)
    3106                      .dwattr $C$DW$386, DW_AT_name("svgenHandle")
    3107                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_svgenHandle")
    3108                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3109                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3110              $C$DW$387       .dwtag  DW_TAG_member
    3111                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$45)
    3112                      .dwattr $C$DW$387, DW_AT_name("svgen")
    3113                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_svgen")
    3114                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3115                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3116              $C$DW$388       .dwtag  DW_TAG_member
    3117                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$47)
    3118                      .dwattr $C$DW$388, DW_AT_name("trajHandle_Id")
    3119                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_trajHandle_Id")
    3120                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3121                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3122              $C$DW$389       .dwtag  DW_TAG_member
    3123                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$48)
    3124                      .dwattr $C$DW$389, DW_AT_name("traj_Id")
    3125                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_traj_Id")
    3126                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3127                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3128              $C$DW$390       .dwtag  DW_TAG_member
    3129                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$47)
    3130                      .dwattr $C$DW$390, DW_AT_name("trajHandle_spd")
    3131                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_trajHandle_spd")
    3132                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3133                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3134              $C$DW$391       .dwtag  DW_TAG_member
    3135                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$48)
    3136                      .dwattr $C$DW$391, DW_AT_name("traj_spd")
    3137                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_traj_spd")
    3138                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3139                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3140              $C$DW$392       .dwtag  DW_TAG_member
    3141                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$47)
    3142                      .dwattr $C$DW$392, DW_AT_name("trajHandle_spdMax")
    3143                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_trajHandle_spdMax")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   63

    3144                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3145                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3146              $C$DW$393       .dwtag  DW_TAG_member
    3147                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$48)
    3148                      .dwattr $C$DW$393, DW_AT_name("traj_spdMax")
    3149                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_traj_spdMax")
    3150                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3151                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3152              $C$DW$394       .dwtag  DW_TAG_member
    3153                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$49)
    3154                      .dwattr $C$DW$394, DW_AT_name("motorParams")
    3155                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_motorParams")
    3156                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3157                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3158              $C$DW$395       .dwtag  DW_TAG_member
    3159                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$52)
    3160                      .dwattr $C$DW$395, DW_AT_name("waitTimes")
    3161                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_waitTimes")
    3162                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3163                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3164              $C$DW$396       .dwtag  DW_TAG_member
    3165                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$51)
    3166                      .dwattr $C$DW$396, DW_AT_name("counter_state")
    3167                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_counter_state")
    3168                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3169                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3170              $C$DW$397       .dwtag  DW_TAG_member
    3171                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$53)
    3172                      .dwattr $C$DW$397, DW_AT_name("numIsrTicksPerCtrlTick")
    3173                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3174                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3175                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3176              $C$DW$398       .dwtag  DW_TAG_member
    3177                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$53)
    3178                      .dwattr $C$DW$398, DW_AT_name("numCtrlTicksPerCurrentTick")
    3179                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3180                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3181                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3182              $C$DW$399       .dwtag  DW_TAG_member
    3183                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$53)
    3184                      .dwattr $C$DW$399, DW_AT_name("numCtrlTicksPerSpeedTick")
    3185                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3186                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3187                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3188              $C$DW$400       .dwtag  DW_TAG_member
    3189                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$53)
    3190                      .dwattr $C$DW$400, DW_AT_name("numCtrlTicksPerTrajTick")
    3191                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3192                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3193                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3194              $C$DW$401       .dwtag  DW_TAG_member
    3195                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$51)
    3196                      .dwattr $C$DW$401, DW_AT_name("ctrlFreq_Hz")
    3197                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3198                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   64

    3199                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3200              $C$DW$402       .dwtag  DW_TAG_member
    3201                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$51)
    3202                      .dwattr $C$DW$402, DW_AT_name("trajFreq_Hz")
    3203                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3204                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3205                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3206              $C$DW$403       .dwtag  DW_TAG_member
    3207                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    3208                      .dwattr $C$DW$403, DW_AT_name("trajPeriod_sec")
    3209                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3210                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3211                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3212              $C$DW$404       .dwtag  DW_TAG_member
    3213                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$54)
    3214                      .dwattr $C$DW$404, DW_AT_name("ctrlPeriod_sec")
    3215                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3216                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3217                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3218              $C$DW$405       .dwtag  DW_TAG_member
    3219                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3220                      .dwattr $C$DW$405, DW_AT_name("maxVsMag_pu")
    3221                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3222                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3223                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3224              $C$DW$406       .dwtag  DW_TAG_member
    3225                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$55)
    3226                      .dwattr $C$DW$406, DW_AT_name("Iab_in")
    3227                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Iab_in")
    3228                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3229                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3230              $C$DW$407       .dwtag  DW_TAG_member
    3231                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$55)
    3232                      .dwattr $C$DW$407, DW_AT_name("Iab_filt")
    3233                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_Iab_filt")
    3234                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3235                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3236              $C$DW$408       .dwtag  DW_TAG_member
    3237                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$55)
    3238                      .dwattr $C$DW$408, DW_AT_name("Idq_in")
    3239                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Idq_in")
    3240                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3241                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3242              $C$DW$409       .dwtag  DW_TAG_member
    3243                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$55)
    3244                      .dwattr $C$DW$409, DW_AT_name("Vab_in")
    3245                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Vab_in")
    3246                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3247                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3248              $C$DW$410       .dwtag  DW_TAG_member
    3249                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3250                      .dwattr $C$DW$410, DW_AT_name("spd_out")
    3251                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_spd_out")
    3252                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3253                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   65

    3254              $C$DW$411       .dwtag  DW_TAG_member
    3255                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$55)
    3256                      .dwattr $C$DW$411, DW_AT_name("Vab_out")
    3257                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Vab_out")
    3258                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3259                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3260              $C$DW$412       .dwtag  DW_TAG_member
    3261                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$55)
    3262                      .dwattr $C$DW$412, DW_AT_name("Vdq_out")
    3263                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Vdq_out")
    3264                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3265                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3266              $C$DW$413       .dwtag  DW_TAG_member
    3267                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$54)
    3268                      .dwattr $C$DW$413, DW_AT_name("Rhf")
    3269                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Rhf")
    3270                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3271                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3272              $C$DW$414       .dwtag  DW_TAG_member
    3273                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$54)
    3274                      .dwattr $C$DW$414, DW_AT_name("Lhf")
    3275                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Lhf")
    3276                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3277                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3278              $C$DW$415       .dwtag  DW_TAG_member
    3279                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$54)
    3280                      .dwattr $C$DW$415, DW_AT_name("RoverL")
    3281                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_RoverL")
    3282                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3283                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3284              $C$DW$416       .dwtag  DW_TAG_member
    3285                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    3286                      .dwattr $C$DW$416, DW_AT_name("Kp_Id")
    3287                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Kp_Id")
    3288                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3289                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3290              $C$DW$417       .dwtag  DW_TAG_member
    3291                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    3292                      .dwattr $C$DW$417, DW_AT_name("Kp_Iq")
    3293                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_Kp_Iq")
    3294                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3295                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3296              $C$DW$418       .dwtag  DW_TAG_member
    3297                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    3298                      .dwattr $C$DW$418, DW_AT_name("Kp_spd")
    3299                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Kp_spd")
    3300                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3301                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3302              $C$DW$419       .dwtag  DW_TAG_member
    3303                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    3304                      .dwattr $C$DW$419, DW_AT_name("Ki_Id")
    3305                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Ki_Id")
    3306                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3307                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3308              $C$DW$420       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   66

    3309                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    3310                      .dwattr $C$DW$420, DW_AT_name("Ki_Iq")
    3311                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Ki_Iq")
    3312                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3313                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3314              $C$DW$421       .dwtag  DW_TAG_member
    3315                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    3316                      .dwattr $C$DW$421, DW_AT_name("Ki_spd")
    3317                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Ki_spd")
    3318                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3319                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3320              $C$DW$422       .dwtag  DW_TAG_member
    3321                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    3322                      .dwattr $C$DW$422, DW_AT_name("Kd_Id")
    3323                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Kd_Id")
    3324                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3325                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3326              $C$DW$423       .dwtag  DW_TAG_member
    3327                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3328                      .dwattr $C$DW$423, DW_AT_name("Kd_Iq")
    3329                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Kd_Iq")
    3330                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3331                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3332              $C$DW$424       .dwtag  DW_TAG_member
    3333                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3334                      .dwattr $C$DW$424, DW_AT_name("Kd_spd")
    3335                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_Kd_spd")
    3336                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3337                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3338              $C$DW$425       .dwtag  DW_TAG_member
    3339                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3340                      .dwattr $C$DW$425, DW_AT_name("Ui_Id")
    3341                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_Ui_Id")
    3342                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3343                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3344              $C$DW$426       .dwtag  DW_TAG_member
    3345                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    3346                      .dwattr $C$DW$426, DW_AT_name("Ui_Iq")
    3347                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Ui_Iq")
    3348                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3349                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3350              $C$DW$427       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    3352                      .dwattr $C$DW$427, DW_AT_name("Ui_spd")
    3353                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Ui_spd")
    3354                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3355                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3356              $C$DW$428       .dwtag  DW_TAG_member
    3357                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$55)
    3358                      .dwattr $C$DW$428, DW_AT_name("Idq_ref")
    3359                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Idq_ref")
    3360                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3361                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3362              $C$DW$429       .dwtag  DW_TAG_member
    3363                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   67

    3364                      .dwattr $C$DW$429, DW_AT_name("IdRated")
    3365                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_IdRated")
    3366                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3367                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3368              $C$DW$430       .dwtag  DW_TAG_member
    3369                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    3370                      .dwattr $C$DW$430, DW_AT_name("spd_ref")
    3371                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_spd_ref")
    3372                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3373                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3374              $C$DW$431       .dwtag  DW_TAG_member
    3375                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3376                      .dwattr $C$DW$431, DW_AT_name("spd_max")
    3377                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_spd_max")
    3378                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3379                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3380              $C$DW$432       .dwtag  DW_TAG_member
    3381                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$53)
    3382                      .dwattr $C$DW$432, DW_AT_name("counter_current")
    3383                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_counter_current")
    3384                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3385                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3386              $C$DW$433       .dwtag  DW_TAG_member
    3387                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$53)
    3388                      .dwattr $C$DW$433, DW_AT_name("counter_isr")
    3389                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_counter_isr")
    3390                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3391                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3392              $C$DW$434       .dwtag  DW_TAG_member
    3393                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$53)
    3394                      .dwattr $C$DW$434, DW_AT_name("counter_speed")
    3395                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_counter_speed")
    3396                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3397                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3398              $C$DW$435       .dwtag  DW_TAG_member
    3399                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$53)
    3400                      .dwattr $C$DW$435, DW_AT_name("counter_traj")
    3401                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_counter_traj")
    3402                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3403                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3404              $C$DW$436       .dwtag  DW_TAG_member
    3405                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$56)
    3406                      .dwattr $C$DW$436, DW_AT_name("flag_enableCtrl")
    3407                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3408                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3409                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3410              $C$DW$437       .dwtag  DW_TAG_member
    3411                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$56)
    3412                      .dwattr $C$DW$437, DW_AT_name("flag_enableDcBusComp")
    3413                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3414                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3415                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3416              $C$DW$438       .dwtag  DW_TAG_member
    3417                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$56)
    3418                      .dwattr $C$DW$438, DW_AT_name("flag_enablePowerWarp")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   68

    3419                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3420                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3421                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3422              $C$DW$439       .dwtag  DW_TAG_member
    3423                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$56)
    3424                      .dwattr $C$DW$439, DW_AT_name("flag_enableOffset")
    3425                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_flag_enableOffset")
    3426                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3427                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3428              $C$DW$440       .dwtag  DW_TAG_member
    3429                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$56)
    3430                      .dwattr $C$DW$440, DW_AT_name("flag_enableSpeedCtrl")
    3431                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3432                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3433                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3434              $C$DW$441       .dwtag  DW_TAG_member
    3435                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$56)
    3436                      .dwattr $C$DW$441, DW_AT_name("flag_enableUserMotorParams")
    3437                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3438                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3439                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3440              $C$DW$442       .dwtag  DW_TAG_member
    3441                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$55)
    3442                      .dwattr $C$DW$442, DW_AT_name("Idq_offset_pu")
    3443                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3444                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3445                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3446              $C$DW$443       .dwtag  DW_TAG_member
    3447                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$55)
    3448                      .dwattr $C$DW$443, DW_AT_name("Vdq_offset_pu")
    3449                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3450                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3451                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3452              $C$DW$444       .dwtag  DW_TAG_member
    3453                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$20)
    3454                      .dwattr $C$DW$444, DW_AT_name("angle_pu")
    3455                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_angle_pu")
    3456                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3457                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3458              $C$DW$445       .dwtag  DW_TAG_member
    3459                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
    3460                      .dwattr $C$DW$445, DW_AT_name("speed_ref_pu")
    3461                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_speed_ref_pu")
    3462                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3463                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3464              $C$DW$446       .dwtag  DW_TAG_member
    3465                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    3466                      .dwattr $C$DW$446, DW_AT_name("speed_fb_pu")
    3467                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_speed_fb_pu")
    3468                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3469                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3470              $C$DW$447       .dwtag  DW_TAG_member
    3471                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
    3472                      .dwattr $C$DW$447, DW_AT_name("speed_outMax_pu")
    3473                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_speed_outMax_pu")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   69

    3474                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3475                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3476              $C$DW$448       .dwtag  DW_TAG_member
    3477                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$56)
    3478                      .dwattr $C$DW$448, DW_AT_name("flag_enableCurrentCtrl")
    3479                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3480                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3481                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3482                      .dwendtag $C$DW$T$57
    3483              
    3484              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3485                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    3486                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3487              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3488                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    3489                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    3490              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3491                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3492                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3493              $C$DW$449       .dwtag  DW_TAG_TI_far_type
    3494                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$87)
    3495              $C$DW$T$88      .dwtag  DW_TAG_const_type
    3496                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$449)
    3497              
    3498              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3499                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3500                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3501              $C$DW$450       .dwtag  DW_TAG_member
    3502                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$21)
    3503                      .dwattr $C$DW$450, DW_AT_name("rsvd")
    3504                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_rsvd")
    3505                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3506                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3507              $C$DW$451       .dwtag  DW_TAG_member
    3508                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$59)
    3509                      .dwattr $C$DW$451, DW_AT_name("targetProc")
    3510                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_targetProc")
    3511                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3512                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3513              $C$DW$452       .dwtag  DW_TAG_member
    3514                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$21)
    3515                      .dwattr $C$DW$452, DW_AT_name("major")
    3516                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_major")
    3517                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3518                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3519              $C$DW$453       .dwtag  DW_TAG_member
    3520                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$21)
    3521                      .dwattr $C$DW$453, DW_AT_name("minor")
    3522                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_minor")
    3523                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3524                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3525                      .dwendtag $C$DW$T$60
    3526              
    3527              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3528                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   70

    3529                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3530              
    3531              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3532                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3533                      .dwattr $C$DW$T$19, DW_AT_declaration
    3534                      .dwendtag $C$DW$T$19
    3535              
    3536              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3537                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3538                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    3539              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3540                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3541                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3542              
    3543              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3544                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3545                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3546              $C$DW$454       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    3548                      .dwattr $C$DW$454, DW_AT_name("sinTh")
    3549                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_sinTh")
    3550                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3551                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3552              $C$DW$455       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    3554                      .dwattr $C$DW$455, DW_AT_name("cosTh")
    3555                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_cosTh")
    3556                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3557                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3558                      .dwendtag $C$DW$T$61
    3559              
    3560              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3561                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3562                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3563              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3564                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3565                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3566              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3567                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3568                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3569              
    3570              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3571                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3572                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3573              $C$DW$456       .dwtag  DW_TAG_member
    3574                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$62)
    3575                      .dwattr $C$DW$456, DW_AT_name("value")
    3576                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_value")
    3577                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3578                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3579                      .dwendtag $C$DW$T$63
    3580              
    3581              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3582                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3583                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   71

    3584              
    3585              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3586                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    3587                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3588              $C$DW$457       .dwtag  DW_TAG_member
    3589                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$65)
    3590                      .dwattr $C$DW$457, DW_AT_name("type")
    3591                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_type")
    3592                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3593                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3594              $C$DW$458       .dwtag  DW_TAG_member
    3595                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$53)
    3596                      .dwattr $C$DW$458, DW_AT_name("numPolePairs")
    3597                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_numPolePairs")
    3598                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3599                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3600              $C$DW$459       .dwtag  DW_TAG_member
    3601                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$54)
    3602                      .dwattr $C$DW$459, DW_AT_name("Lr_H")
    3603                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_Lr_H")
    3604                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3605                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3606              $C$DW$460       .dwtag  DW_TAG_member
    3607                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$54)
    3608                      .dwattr $C$DW$460, DW_AT_name("Ls_d_H")
    3609                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_Ls_d_H")
    3610                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3611                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3612              $C$DW$461       .dwtag  DW_TAG_member
    3613                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$54)
    3614                      .dwattr $C$DW$461, DW_AT_name("Ls_q_H")
    3615                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_Ls_q_H")
    3616                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3617                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3618              $C$DW$462       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$54)
    3620                      .dwattr $C$DW$462, DW_AT_name("Rr_Ohm")
    3621                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_Rr_Ohm")
    3622                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3623                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3624              $C$DW$463       .dwtag  DW_TAG_member
    3625                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$54)
    3626                      .dwattr $C$DW$463, DW_AT_name("Rs_Ohm")
    3627                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_Rs_Ohm")
    3628                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3629                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3630              $C$DW$464       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$54)
    3632                      .dwattr $C$DW$464, DW_AT_name("ratedFlux_VpHz")
    3633                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3634                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3635                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3636                      .dwendtag $C$DW$T$66
    3637              
    3638              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   72

    3639                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3640                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3641              
    3642              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3643                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3644                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3645              $C$DW$465       .dwtag  DW_TAG_member
    3646                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    3647                      .dwattr $C$DW$465, DW_AT_name("sinTh")
    3648                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_sinTh")
    3649                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3650                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3651              $C$DW$466       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    3653                      .dwattr $C$DW$466, DW_AT_name("cosTh")
    3654                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_cosTh")
    3655                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3656                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3657                      .dwendtag $C$DW$T$67
    3658              
    3659              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3660                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3661                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3662              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3663                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    3664                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    3665              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3666                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3667                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3668              
    3669              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3670                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3671                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3672              $C$DW$467       .dwtag  DW_TAG_member
    3673                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$20)
    3674                      .dwattr $C$DW$467, DW_AT_name("Kp")
    3675                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_Kp")
    3676                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3677                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3678              $C$DW$468       .dwtag  DW_TAG_member
    3679                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    3680                      .dwattr $C$DW$468, DW_AT_name("Ki")
    3681                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_Ki")
    3682                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3683                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3684              $C$DW$469       .dwtag  DW_TAG_member
    3685                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    3686                      .dwattr $C$DW$469, DW_AT_name("Kd")
    3687                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_Kd")
    3688                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3689                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3690              $C$DW$470       .dwtag  DW_TAG_member
    3691                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
    3692                      .dwattr $C$DW$470, DW_AT_name("Ui")
    3693                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_Ui")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   73

    3694                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3695                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3696              $C$DW$471       .dwtag  DW_TAG_member
    3697                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    3698                      .dwattr $C$DW$471, DW_AT_name("refValue")
    3699                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_refValue")
    3700                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3701                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3702              $C$DW$472       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    3704                      .dwattr $C$DW$472, DW_AT_name("fbackValue")
    3705                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_fbackValue")
    3706                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3707                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3708              $C$DW$473       .dwtag  DW_TAG_member
    3709                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    3710                      .dwattr $C$DW$473, DW_AT_name("outMin")
    3711                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_outMin")
    3712                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3713                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3714              $C$DW$474       .dwtag  DW_TAG_member
    3715                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    3716                      .dwattr $C$DW$474, DW_AT_name("outMax")
    3717                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_outMax")
    3718                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3719                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3720                      .dwendtag $C$DW$T$68
    3721              
    3722              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3723                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3724                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3725              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3726                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3727                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    3728              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    3729                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3730                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3731              
    3732              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3733                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3734                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3735              $C$DW$475       .dwtag  DW_TAG_member
    3736                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    3737                      .dwattr $C$DW$475, DW_AT_name("maxModulation")
    3738                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_maxModulation")
    3739                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3740                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3741                      .dwendtag $C$DW$T$69
    3742              
    3743              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3744                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3745                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3746              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3747                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    3748                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   74

    3749              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3750                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3751                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3752              
    3753              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3754                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3755                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3756              $C$DW$476       .dwtag  DW_TAG_member
    3757                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
    3758                      .dwattr $C$DW$476, DW_AT_name("targetValue")
    3759                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_targetValue")
    3760                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3761                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3762              $C$DW$477       .dwtag  DW_TAG_member
    3763                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    3764                      .dwattr $C$DW$477, DW_AT_name("intValue")
    3765                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_intValue")
    3766                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3767                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3768              $C$DW$478       .dwtag  DW_TAG_member
    3769                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    3770                      .dwattr $C$DW$478, DW_AT_name("minValue")
    3771                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_minValue")
    3772                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3773                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3774              $C$DW$479       .dwtag  DW_TAG_member
    3775                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    3776                      .dwattr $C$DW$479, DW_AT_name("maxValue")
    3777                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_maxValue")
    3778                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3779                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3780              $C$DW$480       .dwtag  DW_TAG_member
    3781                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    3782                      .dwattr $C$DW$480, DW_AT_name("maxDelta")
    3783                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_maxDelta")
    3784                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3785                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3786                      .dwendtag $C$DW$T$70
    3787              
    3788              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3789                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3790                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3791              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3792                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3793                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3794              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3795                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3796                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3797              
    3798              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3799                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    3800                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    3801              $C$DW$481       .dwtag  DW_TAG_member
    3802                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$54)
    3803                      .dwattr $C$DW$481, DW_AT_name("iqFullScaleCurrent_A")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   75

    3804                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3805                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3806                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3807              $C$DW$482       .dwtag  DW_TAG_member
    3808                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$54)
    3809                      .dwattr $C$DW$482, DW_AT_name("iqFullScaleVoltage_V")
    3810                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3811                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3812                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3813              $C$DW$483       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$54)
    3815                      .dwattr $C$DW$483, DW_AT_name("iqFullScaleFreq_Hz")
    3816                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3817                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3818                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3819              $C$DW$484       .dwtag  DW_TAG_member
    3820                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$53)
    3821                      .dwattr $C$DW$484, DW_AT_name("numIsrTicksPerCtrlTick")
    3822                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3823                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3824                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3825              $C$DW$485       .dwtag  DW_TAG_member
    3826                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$53)
    3827                      .dwattr $C$DW$485, DW_AT_name("numCtrlTicksPerCurrentTick")
    3828                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3829                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3830                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3831              $C$DW$486       .dwtag  DW_TAG_member
    3832                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$53)
    3833                      .dwattr $C$DW$486, DW_AT_name("numCtrlTicksPerEstTick")
    3834                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3835                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3836                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3837              $C$DW$487       .dwtag  DW_TAG_member
    3838                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$53)
    3839                      .dwattr $C$DW$487, DW_AT_name("numCtrlTicksPerSpeedTick")
    3840                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3841                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3842                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3843              $C$DW$488       .dwtag  DW_TAG_member
    3844                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$53)
    3845                      .dwattr $C$DW$488, DW_AT_name("numCtrlTicksPerTrajTick")
    3846                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3847                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3848                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3849              $C$DW$489       .dwtag  DW_TAG_member
    3850                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$22)
    3851                      .dwattr $C$DW$489, DW_AT_name("numCurrentSensors")
    3852                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_numCurrentSensors")
    3853                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3854                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3855              $C$DW$490       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$22)
    3857                      .dwattr $C$DW$490, DW_AT_name("numVoltageSensors")
    3858                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_numVoltageSensors")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   76

    3859                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3860                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3861              $C$DW$491       .dwtag  DW_TAG_member
    3862                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$54)
    3863                      .dwattr $C$DW$491, DW_AT_name("offsetPole_rps")
    3864                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_offsetPole_rps")
    3865                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3866                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3867              $C$DW$492       .dwtag  DW_TAG_member
    3868                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$54)
    3869                      .dwattr $C$DW$492, DW_AT_name("fluxPole_rps")
    3870                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_fluxPole_rps")
    3871                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3872                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3873              $C$DW$493       .dwtag  DW_TAG_member
    3874                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$54)
    3875                      .dwattr $C$DW$493, DW_AT_name("zeroSpeedLimit")
    3876                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3877                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3878                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3879              $C$DW$494       .dwtag  DW_TAG_member
    3880                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$54)
    3881                      .dwattr $C$DW$494, DW_AT_name("forceAngleFreq_Hz")
    3882                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3883                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3884                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3885              $C$DW$495       .dwtag  DW_TAG_member
    3886                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$54)
    3887                      .dwattr $C$DW$495, DW_AT_name("maxAccel_Hzps")
    3888                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3889                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3890                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3891              $C$DW$496       .dwtag  DW_TAG_member
    3892                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
    3893                      .dwattr $C$DW$496, DW_AT_name("maxAccel_est_Hzps")
    3894                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3895                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3896                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3897              $C$DW$497       .dwtag  DW_TAG_member
    3898                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$54)
    3899                      .dwattr $C$DW$497, DW_AT_name("directionPole_rps")
    3900                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_directionPole_rps")
    3901                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3902                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3903              $C$DW$498       .dwtag  DW_TAG_member
    3904                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    3905                      .dwattr $C$DW$498, DW_AT_name("speedPole_rps")
    3906                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_speedPole_rps")
    3907                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3908                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3909              $C$DW$499       .dwtag  DW_TAG_member
    3910                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    3911                      .dwattr $C$DW$499, DW_AT_name("dcBusPole_rps")
    3912                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_dcBusPole_rps")
    3913                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   77

    3914                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3915              $C$DW$500       .dwtag  DW_TAG_member
    3916                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    3917                      .dwattr $C$DW$500, DW_AT_name("fluxFraction")
    3918                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_fluxFraction")
    3919                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3920                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3921              $C$DW$501       .dwtag  DW_TAG_member
    3922                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    3923                      .dwattr $C$DW$501, DW_AT_name("indEst_speedMaxFraction")
    3924                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    3925                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3926                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3927              $C$DW$502       .dwtag  DW_TAG_member
    3928                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$54)
    3929                      .dwattr $C$DW$502, DW_AT_name("powerWarpGain")
    3930                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_powerWarpGain")
    3931                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3932                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3933              $C$DW$503       .dwtag  DW_TAG_member
    3934                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$53)
    3935                      .dwattr $C$DW$503, DW_AT_name("systemFreq_MHz")
    3936                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_systemFreq_MHz")
    3937                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3938                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3939              $C$DW$504       .dwtag  DW_TAG_member
    3940                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$54)
    3941                      .dwattr $C$DW$504, DW_AT_name("pwmPeriod_usec")
    3942                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    3943                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3944                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    3945              $C$DW$505       .dwtag  DW_TAG_member
    3946                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$54)
    3947                      .dwattr $C$DW$505, DW_AT_name("voltage_sf")
    3948                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_voltage_sf")
    3949                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3950                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    3951              $C$DW$506       .dwtag  DW_TAG_member
    3952                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$54)
    3953                      .dwattr $C$DW$506, DW_AT_name("current_sf")
    3954                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_current_sf")
    3955                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3956                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    3957              $C$DW$507       .dwtag  DW_TAG_member
    3958                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$54)
    3959                      .dwattr $C$DW$507, DW_AT_name("voltageFilterPole_rps")
    3960                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    3961                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3962                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    3963              $C$DW$508       .dwtag  DW_TAG_member
    3964                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$54)
    3965                      .dwattr $C$DW$508, DW_AT_name("maxVsMag_pu")
    3966                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3967                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3968                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   78

    3969              $C$DW$509       .dwtag  DW_TAG_member
    3970                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$54)
    3971                      .dwattr $C$DW$509, DW_AT_name("estKappa")
    3972                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_estKappa")
    3973                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3974                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    3975              $C$DW$510       .dwtag  DW_TAG_member
    3976                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$65)
    3977                      .dwattr $C$DW$510, DW_AT_name("motor_type")
    3978                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_motor_type")
    3979                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3980                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    3981              $C$DW$511       .dwtag  DW_TAG_member
    3982                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$53)
    3983                      .dwattr $C$DW$511, DW_AT_name("motor_numPolePairs")
    3984                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_motor_numPolePairs")
    3985                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    3986                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    3987              $C$DW$512       .dwtag  DW_TAG_member
    3988                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$54)
    3989                      .dwattr $C$DW$512, DW_AT_name("motor_ratedFlux")
    3990                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_motor_ratedFlux")
    3991                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3992                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    3993              $C$DW$513       .dwtag  DW_TAG_member
    3994                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$54)
    3995                      .dwattr $C$DW$513, DW_AT_name("motor_Rr")
    3996                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_motor_Rr")
    3997                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3998                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    3999              $C$DW$514       .dwtag  DW_TAG_member
    4000                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$54)
    4001                      .dwattr $C$DW$514, DW_AT_name("motor_Rs")
    4002                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_motor_Rs")
    4003                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4004                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    4005              $C$DW$515       .dwtag  DW_TAG_member
    4006                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$54)
    4007                      .dwattr $C$DW$515, DW_AT_name("motor_Ls_d")
    4008                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_motor_Ls_d")
    4009                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4010                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    4011              $C$DW$516       .dwtag  DW_TAG_member
    4012                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$54)
    4013                      .dwattr $C$DW$516, DW_AT_name("motor_Ls_q")
    4014                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_motor_Ls_q")
    4015                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4016                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    4017              $C$DW$517       .dwtag  DW_TAG_member
    4018                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$54)
    4019                      .dwattr $C$DW$517, DW_AT_name("maxCurrent")
    4020                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_maxCurrent")
    4021                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4022                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    4023              $C$DW$518       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:37:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0209210                            PAGE   79

    4024                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$54)
    4025                      .dwattr $C$DW$518, DW_AT_name("maxCurrent_resEst")
    4026                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    4027                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4028                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    4029              $C$DW$519       .dwtag  DW_TAG_member
    4030                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$54)
    4031                      .dwattr $C$DW$519, DW_AT_name("maxCurrent_indEst")
    4032                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    4033                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4034                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    4035              $C$DW$520       .dwtag  DW_TAG_member
    4036                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$54)
    4037                      .dwattr $C$DW$520, DW_AT_name("maxCurrentSlope")
    4038                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_maxCurrentSlope")
    4039                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4040                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4041              $C$DW$521       .dwtag  DW_TAG_member
    4042                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$54)
    4043                      .dwattr $C$DW$521, DW_AT_name("maxCurrentSlope_powerWarp")
    4044                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    4045                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4046                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4047              $C$DW$522       .dwtag  DW_TAG_member
    4048                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$54)
    4049                      .dwattr $C$DW$522, DW_AT_name("IdRated")
    4050                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_IdRated")
    4051                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4052                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4053              $C$DW$523       .dwtag  DW_TAG_member
    4054                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$54)
    4055                      .dwattr $C$DW$523, DW_AT_name("IdRatedFraction_indEst")
    4056                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    4057                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4058                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4059              $C$DW$524       .dwtag  DW_TAG_member
    4060                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$54)
    4061                      .dwattr $C$DW$524, DW_AT_name("IdRatedFraction_ratedFlux")
    4062                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    4063                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4064                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4065              $C$DW$525       .dwtag  DW_TAG_member
    4066                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$54)
    4067                      .dwattr $C$DW$525, DW_AT_name("IdRated_delta")
    4068                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_IdRated_delta")
    4069                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4070                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4071              $C$DW$526       .dwtag  DW_TAG_member
    4072                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$54)
    4073                      .dwattr $C$DW$526, DW_AT_name("fluxEstFreq_Hz")
    4074                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    4075                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
