TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 12:49:30 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../proj_lab20.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab20\Release")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    4779              $C$DW$661       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    4780                      .dwendtag $C$DW$T$215
    4781              
    4782              $C$DW$T$216     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    4783                      .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$215)
    4784                      .dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
    4785              
    4786              $C$DW$T$218     .dwtag  DW_TAG_enumeration_type
    4787                      .dwattr $C$DW$T$218, DW_AT_byte_size(0x01)
    4788              $C$DW$662       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    4789              $C$DW$663       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    4790              $C$DW$664       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    4791              $C$DW$665       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    4792              $C$DW$666       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    4793              $C$DW$667       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    4794              $C$DW$668       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    4795              $C$DW$669       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    4796              $C$DW$670       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    4797              $C$DW$671       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    4798              $C$DW$672       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    4799              $C$DW$673       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    4800                      .dwendtag $C$DW$T$218
    4801              
    4802              $C$DW$T$219     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    4803                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$218)
    4804                      .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    4805              
    4806              $C$DW$T$221     .dwtag  DW_TAG_enumeration_type
    4807                      .dwattr $C$DW$T$221, DW_AT_byte_size(0x01)
    4808              $C$DW$674       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    4809              $C$DW$675       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    4810              $C$DW$676       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    4811                      .dwendtag $C$DW$T$221
    4812              
    4813              $C$DW$T$222     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    4814                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE   96

    4815                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    4816              
    4817              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    4818                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    4819              $C$DW$677       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    4820              $C$DW$678       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    4821                      .dwendtag $C$DW$T$224
    4822              
    4823              $C$DW$T$225     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    4824                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    4825                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    4826              
    4827              $C$DW$T$22      .dwtag  DW_TAG_union_type
    4828                      .dwattr $C$DW$T$22, DW_AT_name("U3_0")
    4829                      .dwattr $C$DW$T$22, DW_AT_declaration
    4830                      .dwendtag $C$DW$T$22
    4831              
    4832              
    4833              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4834                      .dwattr $C$DW$T$23, DW_AT_name("S3_1")
    4835                      .dwattr $C$DW$T$23, DW_AT_declaration
    4836                      .dwendtag $C$DW$T$23
    4837              
    4838              
    4839              $C$DW$T$24      .dwtag  DW_TAG_union_type
    4840                      .dwattr $C$DW$T$24, DW_AT_name("U4_2")
    4841                      .dwattr $C$DW$T$24, DW_AT_declaration
    4842                      .dwendtag $C$DW$T$24
    4843              
    4844              
    4845              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4846                      .dwattr $C$DW$T$25, DW_AT_name("S4_3")
    4847                      .dwattr $C$DW$T$25, DW_AT_declaration
    4848                      .dwendtag $C$DW$T$25
    4849              
    4850              
    4851              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4852                      .dwattr $C$DW$T$34, DW_AT_name("_ADC_Obj_")
    4853                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x6650)
    4854              $C$DW$679       .dwtag  DW_TAG_member
    4855                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$28)
    4856                      .dwattr $C$DW$679, DW_AT_name("ADCRESULT")
    4857                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCRESULT")
    4858                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4859                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4860              $C$DW$680       .dwtag  DW_TAG_member
    4861                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$29)
    4862                      .dwattr $C$DW$680, DW_AT_name("resvd_1")
    4863                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_resvd_1")
    4864                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4865                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4866              $C$DW$681       .dwtag  DW_TAG_member
    4867                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$27)
    4868                      .dwattr $C$DW$681, DW_AT_name("ADCCTL1")
    4869                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_ADCCTL1")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE   97

    4870                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4871                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4872              $C$DW$682       .dwtag  DW_TAG_member
    4873                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$27)
    4874                      .dwattr $C$DW$682, DW_AT_name("ADCCTL2")
    4875                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCCTL2")
    4876                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4877                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4878              $C$DW$683       .dwtag  DW_TAG_member
    4879                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$30)
    4880                      .dwattr $C$DW$683, DW_AT_name("rsvd_2")
    4881                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_rsvd_2")
    4882                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4883                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4884              $C$DW$684       .dwtag  DW_TAG_member
    4885                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$27)
    4886                      .dwattr $C$DW$684, DW_AT_name("ADCINTFLG")
    4887                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCINTFLG")
    4888                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4889                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4890              $C$DW$685       .dwtag  DW_TAG_member
    4891                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$27)
    4892                      .dwattr $C$DW$685, DW_AT_name("ADCINTFLGCLR")
    4893                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4894                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4895                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4896              $C$DW$686       .dwtag  DW_TAG_member
    4897                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$27)
    4898                      .dwattr $C$DW$686, DW_AT_name("ADCINTOVF")
    4899                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCINTOVF")
    4900                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4901                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4902              $C$DW$687       .dwtag  DW_TAG_member
    4903                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$27)
    4904                      .dwattr $C$DW$687, DW_AT_name("ADCINTOVFCLR")
    4905                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4906                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4907                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4908              $C$DW$688       .dwtag  DW_TAG_member
    4909                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$31)
    4910                      .dwattr $C$DW$688, DW_AT_name("INTSELxNy")
    4911                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_INTSELxNy")
    4912                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4913                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4914              $C$DW$689       .dwtag  DW_TAG_member
    4915                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$32)
    4916                      .dwattr $C$DW$689, DW_AT_name("rsvd_3")
    4917                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_3")
    4918                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4919                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4920              $C$DW$690       .dwtag  DW_TAG_member
    4921                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$27)
    4922                      .dwattr $C$DW$690, DW_AT_name("SOCPRICTRL")
    4923                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4924                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE   98

    4925                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4926              $C$DW$691       .dwtag  DW_TAG_member
    4927                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$27)
    4928                      .dwattr $C$DW$691, DW_AT_name("rsvd_4")
    4929                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_4")
    4930                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4931                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4932              $C$DW$692       .dwtag  DW_TAG_member
    4933                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$27)
    4934                      .dwattr $C$DW$692, DW_AT_name("ADCSAMPLEMODE")
    4935                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4936                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4937                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4938              $C$DW$693       .dwtag  DW_TAG_member
    4939                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$27)
    4940                      .dwattr $C$DW$693, DW_AT_name("rsvd_5")
    4941                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_rsvd_5")
    4942                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4943                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4944              $C$DW$694       .dwtag  DW_TAG_member
    4945                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$27)
    4946                      .dwattr $C$DW$694, DW_AT_name("ADCINTSOCSEL1")
    4947                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4948                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4949                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4950              $C$DW$695       .dwtag  DW_TAG_member
    4951                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$27)
    4952                      .dwattr $C$DW$695, DW_AT_name("ADCINTSOCSEL2")
    4953                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4954                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4955                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4956              $C$DW$696       .dwtag  DW_TAG_member
    4957                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$30)
    4958                      .dwattr $C$DW$696, DW_AT_name("rsvd_6")
    4959                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_6")
    4960                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4961                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4962              $C$DW$697       .dwtag  DW_TAG_member
    4963                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$27)
    4964                      .dwattr $C$DW$697, DW_AT_name("ADCSOCFLG1")
    4965                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4966                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4967                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4968              $C$DW$698       .dwtag  DW_TAG_member
    4969                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$27)
    4970                      .dwattr $C$DW$698, DW_AT_name("rsvd_7")
    4971                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_7")
    4972                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4973                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4974              $C$DW$699       .dwtag  DW_TAG_member
    4975                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$27)
    4976                      .dwattr $C$DW$699, DW_AT_name("ADCSOCFRC1")
    4977                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4978                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4979                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE   99

    4980              $C$DW$700       .dwtag  DW_TAG_member
    4981                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$27)
    4982                      .dwattr $C$DW$700, DW_AT_name("rsvd_8")
    4983                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd_8")
    4984                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4985                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4986              $C$DW$701       .dwtag  DW_TAG_member
    4987                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$27)
    4988                      .dwattr $C$DW$701, DW_AT_name("ADCSOCOVF1")
    4989                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4990                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4991                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4992              $C$DW$702       .dwtag  DW_TAG_member
    4993                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$27)
    4994                      .dwattr $C$DW$702, DW_AT_name("rsvd_9")
    4995                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_rsvd_9")
    4996                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4997                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4998              $C$DW$703       .dwtag  DW_TAG_member
    4999                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$27)
    5000                      .dwattr $C$DW$703, DW_AT_name("ADCSOCOVFCLR1")
    5001                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5002                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    5003                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    5004              $C$DW$704       .dwtag  DW_TAG_member
    5005                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$27)
    5006                      .dwattr $C$DW$704, DW_AT_name("rsvd_10")
    5007                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd_10")
    5008                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5009                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    5010              $C$DW$705       .dwtag  DW_TAG_member
    5011                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$28)
    5012                      .dwattr $C$DW$705, DW_AT_name("ADCSOCxCTL")
    5013                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5014                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5015                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    5016              $C$DW$706       .dwtag  DW_TAG_member
    5017                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$28)
    5018                      .dwattr $C$DW$706, DW_AT_name("rsvd_11")
    5019                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_11")
    5020                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5021                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    5022              $C$DW$707       .dwtag  DW_TAG_member
    5023                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$27)
    5024                      .dwattr $C$DW$707, DW_AT_name("ADCREFTRIM")
    5025                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5026                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5027                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    5028              $C$DW$708       .dwtag  DW_TAG_member
    5029                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$27)
    5030                      .dwattr $C$DW$708, DW_AT_name("ADCOFFTRIM")
    5031                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5032                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5033                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    5034              $C$DW$709       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  100

    5035                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$33)
    5036                      .dwattr $C$DW$709, DW_AT_name("resvd_12")
    5037                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_resvd_12")
    5038                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5039                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    5040              $C$DW$710       .dwtag  DW_TAG_member
    5041                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$27)
    5042                      .dwattr $C$DW$710, DW_AT_name("ADCREV")
    5043                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ADCREV")
    5044                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5045                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    5046                      .dwendtag $C$DW$T$34
    5047              
    5048              $C$DW$T$228     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    5049                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$34)
    5050                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    5051              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    5052                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$34)
    5053                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    5054              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    5055                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    5056                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    5057              
    5058              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5059                      .dwattr $C$DW$T$37, DW_AT_name("_CLARKE_Obj_")
    5060                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    5061              $C$DW$711       .dwtag  DW_TAG_member
    5062                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$35)
    5063                      .dwattr $C$DW$711, DW_AT_name("alpha_sf")
    5064                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_alpha_sf")
    5065                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5066                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    5067              $C$DW$712       .dwtag  DW_TAG_member
    5068                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$35)
    5069                      .dwattr $C$DW$712, DW_AT_name("beta_sf")
    5070                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_beta_sf")
    5071                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5072                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    5073              $C$DW$713       .dwtag  DW_TAG_member
    5074                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$36)
    5075                      .dwattr $C$DW$713, DW_AT_name("numSensors")
    5076                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_numSensors")
    5077                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5078                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    5079                      .dwendtag $C$DW$T$37
    5080              
    5081              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    5082                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$37)
    5083                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    5084              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    5085                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
    5086                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    5087              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    5088                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    5089                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  101

    5090              $C$DW$714       .dwtag  DW_TAG_TI_far_type
    5091                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$47)
    5092              $C$DW$T$229     .dwtag  DW_TAG_const_type
    5093                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$714)
    5094              
    5095              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5096                      .dwattr $C$DW$T$39, DW_AT_name("_CLK_Obj_")
    5097                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x11)
    5098              $C$DW$715       .dwtag  DW_TAG_member
    5099                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$27)
    5100                      .dwattr $C$DW$715, DW_AT_name("XCLK")
    5101                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_XCLK")
    5102                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5103                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    5104              $C$DW$716       .dwtag  DW_TAG_member
    5105                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$27)
    5106                      .dwattr $C$DW$716, DW_AT_name("rsvd_1")
    5107                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_rsvd_1")
    5108                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5109                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    5110              $C$DW$717       .dwtag  DW_TAG_member
    5111                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$27)
    5112                      .dwattr $C$DW$717, DW_AT_name("CLKCTL")
    5113                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_CLKCTL")
    5114                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5115                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    5116              $C$DW$718       .dwtag  DW_TAG_member
    5117                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$38)
    5118                      .dwattr $C$DW$718, DW_AT_name("rsvd_2")
    5119                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_rsvd_2")
    5120                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5121                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    5122              $C$DW$719       .dwtag  DW_TAG_member
    5123                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$27)
    5124                      .dwattr $C$DW$719, DW_AT_name("LOSPCP")
    5125                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_LOSPCP")
    5126                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5127                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    5128              $C$DW$720       .dwtag  DW_TAG_member
    5129                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$27)
    5130                      .dwattr $C$DW$720, DW_AT_name("PCLKCR0")
    5131                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_PCLKCR0")
    5132                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5133                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    5134              $C$DW$721       .dwtag  DW_TAG_member
    5135                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$27)
    5136                      .dwattr $C$DW$721, DW_AT_name("PCLKCR1")
    5137                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_PCLKCR1")
    5138                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5139                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    5140              $C$DW$722       .dwtag  DW_TAG_member
    5141                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$30)
    5142                      .dwattr $C$DW$722, DW_AT_name("rsvd_3")
    5143                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_rsvd_3")
    5144                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  102

    5145                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    5146              $C$DW$723       .dwtag  DW_TAG_member
    5147                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$27)
    5148                      .dwattr $C$DW$723, DW_AT_name("PCLKCR3")
    5149                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_PCLKCR3")
    5150                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5151                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    5152                      .dwendtag $C$DW$T$39
    5153              
    5154              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    5155                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$39)
    5156                      .dwattr $C$DW$T$122, DW_AT_address_class(0x20)
    5157              $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    5158                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    5159                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    5160              
    5161              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5162                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_Obj_")
    5163                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    5164              $C$DW$724       .dwtag  DW_TAG_member
    5165                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$36)
    5166                      .dwattr $C$DW$724, DW_AT_name("tmp")
    5167                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_tmp")
    5168                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5169                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    5170                      .dwendtag $C$DW$T$40
    5171              
    5172              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    5173                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$40)
    5174                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    5175              $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    5176                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    5177                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    5178              
    5179              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    5180                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Obj_")
    5181                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x108)
    5182              $C$DW$725       .dwtag  DW_TAG_member
    5183                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$41)
    5184                      .dwattr $C$DW$725, DW_AT_name("version")
    5185                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_version")
    5186                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5187                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    5188              $C$DW$726       .dwtag  DW_TAG_member
    5189                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$43)
    5190                      .dwattr $C$DW$726, DW_AT_name("state")
    5191                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_state")
    5192                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5193                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    5194              $C$DW$727       .dwtag  DW_TAG_member
    5195                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$43)
    5196                      .dwattr $C$DW$727, DW_AT_name("prevState")
    5197                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_prevState")
    5198                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5199                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  103

    5200              $C$DW$728       .dwtag  DW_TAG_member
    5201                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$45)
    5202                      .dwattr $C$DW$728, DW_AT_name("errorCode")
    5203                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_errorCode")
    5204                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5205                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    5206              $C$DW$729       .dwtag  DW_TAG_member
    5207                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$47)
    5208                      .dwattr $C$DW$729, DW_AT_name("clarkeHandle_I")
    5209                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_clarkeHandle_I")
    5210                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5211                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5212              $C$DW$730       .dwtag  DW_TAG_member
    5213                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$48)
    5214                      .dwattr $C$DW$730, DW_AT_name("clarke_I")
    5215                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_clarke_I")
    5216                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5217                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5218              $C$DW$731       .dwtag  DW_TAG_member
    5219                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$47)
    5220                      .dwattr $C$DW$731, DW_AT_name("clarkeHandle_V")
    5221                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_clarkeHandle_V")
    5222                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5223                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    5224              $C$DW$732       .dwtag  DW_TAG_member
    5225                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$48)
    5226                      .dwattr $C$DW$732, DW_AT_name("clarke_V")
    5227                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_clarke_V")
    5228                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5229                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    5230              $C$DW$733       .dwtag  DW_TAG_member
    5231                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$50)
    5232                      .dwattr $C$DW$733, DW_AT_name("estHandle")
    5233                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_estHandle")
    5234                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5235                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    5236              $C$DW$734       .dwtag  DW_TAG_member
    5237                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$52)
    5238                      .dwattr $C$DW$734, DW_AT_name("parkHandle")
    5239                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_parkHandle")
    5240                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5241                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    5242              $C$DW$735       .dwtag  DW_TAG_member
    5243                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$53)
    5244                      .dwattr $C$DW$735, DW_AT_name("park")
    5245                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_park")
    5246                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5247                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    5248              $C$DW$736       .dwtag  DW_TAG_member
    5249                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$55)
    5250                      .dwattr $C$DW$736, DW_AT_name("pidHandle_Id")
    5251                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_pidHandle_Id")
    5252                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5253                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    5254              $C$DW$737       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  104

    5255                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$56)
    5256                      .dwattr $C$DW$737, DW_AT_name("pid_Id")
    5257                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_pid_Id")
    5258                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5259                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    5260              $C$DW$738       .dwtag  DW_TAG_member
    5261                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$55)
    5262                      .dwattr $C$DW$738, DW_AT_name("pidHandle_Iq")
    5263                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_pidHandle_Iq")
    5264                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5265                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    5266              $C$DW$739       .dwtag  DW_TAG_member
    5267                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$56)
    5268                      .dwattr $C$DW$739, DW_AT_name("pid_Iq")
    5269                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_pid_Iq")
    5270                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5271                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    5272              $C$DW$740       .dwtag  DW_TAG_member
    5273                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$55)
    5274                      .dwattr $C$DW$740, DW_AT_name("pidHandle_spd")
    5275                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_pidHandle_spd")
    5276                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5277                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    5278              $C$DW$741       .dwtag  DW_TAG_member
    5279                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$56)
    5280                      .dwattr $C$DW$741, DW_AT_name("pid_spd")
    5281                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_pid_spd")
    5282                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5283                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    5284              $C$DW$742       .dwtag  DW_TAG_member
    5285                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$58)
    5286                      .dwattr $C$DW$742, DW_AT_name("iparkHandle")
    5287                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_iparkHandle")
    5288                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    5289                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    5290              $C$DW$743       .dwtag  DW_TAG_member
    5291                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$59)
    5292                      .dwattr $C$DW$743, DW_AT_name("ipark")
    5293                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_ipark")
    5294                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5295                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    5296              $C$DW$744       .dwtag  DW_TAG_member
    5297                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$61)
    5298                      .dwattr $C$DW$744, DW_AT_name("svgenHandle")
    5299                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_svgenHandle")
    5300                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5301                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    5302              $C$DW$745       .dwtag  DW_TAG_member
    5303                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$62)
    5304                      .dwattr $C$DW$745, DW_AT_name("svgen")
    5305                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_svgen")
    5306                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5307                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    5308              $C$DW$746       .dwtag  DW_TAG_member
    5309                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$64)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  105

    5310                      .dwattr $C$DW$746, DW_AT_name("trajHandle_Id")
    5311                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_trajHandle_Id")
    5312                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5313                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    5314              $C$DW$747       .dwtag  DW_TAG_member
    5315                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$65)
    5316                      .dwattr $C$DW$747, DW_AT_name("traj_Id")
    5317                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_traj_Id")
    5318                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    5319                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    5320              $C$DW$748       .dwtag  DW_TAG_member
    5321                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$64)
    5322                      .dwattr $C$DW$748, DW_AT_name("trajHandle_spd")
    5323                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_trajHandle_spd")
    5324                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    5325                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    5326              $C$DW$749       .dwtag  DW_TAG_member
    5327                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$65)
    5328                      .dwattr $C$DW$749, DW_AT_name("traj_spd")
    5329                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_traj_spd")
    5330                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    5331                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    5332              $C$DW$750       .dwtag  DW_TAG_member
    5333                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$64)
    5334                      .dwattr $C$DW$750, DW_AT_name("trajHandle_spdMax")
    5335                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    5336                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5337                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    5338              $C$DW$751       .dwtag  DW_TAG_member
    5339                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$65)
    5340                      .dwattr $C$DW$751, DW_AT_name("traj_spdMax")
    5341                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_traj_spdMax")
    5342                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5343                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    5344              $C$DW$752       .dwtag  DW_TAG_member
    5345                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$66)
    5346                      .dwattr $C$DW$752, DW_AT_name("motorParams")
    5347                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_motorParams")
    5348                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    5349                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    5350              $C$DW$753       .dwtag  DW_TAG_member
    5351                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$69)
    5352                      .dwattr $C$DW$753, DW_AT_name("waitTimes")
    5353                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_waitTimes")
    5354                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5355                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    5356              $C$DW$754       .dwtag  DW_TAG_member
    5357                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$68)
    5358                      .dwattr $C$DW$754, DW_AT_name("counter_state")
    5359                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_counter_state")
    5360                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    5361                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    5362              $C$DW$755       .dwtag  DW_TAG_member
    5363                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$70)
    5364                      .dwattr $C$DW$755, DW_AT_name("numIsrTicksPerCtrlTick")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  106

    5365                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    5366                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    5367                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    5368              $C$DW$756       .dwtag  DW_TAG_member
    5369                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$70)
    5370                      .dwattr $C$DW$756, DW_AT_name("numCtrlTicksPerCurrentTick")
    5371                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    5372                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    5373                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    5374              $C$DW$757       .dwtag  DW_TAG_member
    5375                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$70)
    5376                      .dwattr $C$DW$757, DW_AT_name("numCtrlTicksPerSpeedTick")
    5377                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    5378                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    5379                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    5380              $C$DW$758       .dwtag  DW_TAG_member
    5381                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$70)
    5382                      .dwattr $C$DW$758, DW_AT_name("numCtrlTicksPerTrajTick")
    5383                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    5384                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    5385                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    5386              $C$DW$759       .dwtag  DW_TAG_member
    5387                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$68)
    5388                      .dwattr $C$DW$759, DW_AT_name("ctrlFreq_Hz")
    5389                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    5390                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5391                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    5392              $C$DW$760       .dwtag  DW_TAG_member
    5393                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$68)
    5394                      .dwattr $C$DW$760, DW_AT_name("trajFreq_Hz")
    5395                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_trajFreq_Hz")
    5396                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    5397                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    5398              $C$DW$761       .dwtag  DW_TAG_member
    5399                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$35)
    5400                      .dwattr $C$DW$761, DW_AT_name("trajPeriod_sec")
    5401                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_trajPeriod_sec")
    5402                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    5403                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    5404              $C$DW$762       .dwtag  DW_TAG_member
    5405                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$71)
    5406                      .dwattr $C$DW$762, DW_AT_name("ctrlPeriod_sec")
    5407                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    5408                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    5409                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    5410              $C$DW$763       .dwtag  DW_TAG_member
    5411                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$35)
    5412                      .dwattr $C$DW$763, DW_AT_name("maxVsMag_pu")
    5413                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_maxVsMag_pu")
    5414                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    5415                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    5416              $C$DW$764       .dwtag  DW_TAG_member
    5417                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$72)
    5418                      .dwattr $C$DW$764, DW_AT_name("Iab_in")
    5419                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_Iab_in")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  107

    5420                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    5421                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    5422              $C$DW$765       .dwtag  DW_TAG_member
    5423                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$72)
    5424                      .dwattr $C$DW$765, DW_AT_name("Iab_filt")
    5425                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_Iab_filt")
    5426                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    5427                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    5428              $C$DW$766       .dwtag  DW_TAG_member
    5429                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$72)
    5430                      .dwattr $C$DW$766, DW_AT_name("Idq_in")
    5431                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Idq_in")
    5432                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    5433                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    5434              $C$DW$767       .dwtag  DW_TAG_member
    5435                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$72)
    5436                      .dwattr $C$DW$767, DW_AT_name("Vab_in")
    5437                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_Vab_in")
    5438                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    5439                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    5440              $C$DW$768       .dwtag  DW_TAG_member
    5441                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$35)
    5442                      .dwattr $C$DW$768, DW_AT_name("spd_out")
    5443                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_spd_out")
    5444                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    5445                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    5446              $C$DW$769       .dwtag  DW_TAG_member
    5447                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$72)
    5448                      .dwattr $C$DW$769, DW_AT_name("Vab_out")
    5449                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Vab_out")
    5450                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    5451                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    5452              $C$DW$770       .dwtag  DW_TAG_member
    5453                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$72)
    5454                      .dwattr $C$DW$770, DW_AT_name("Vdq_out")
    5455                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Vdq_out")
    5456                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    5457                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    5458              $C$DW$771       .dwtag  DW_TAG_member
    5459                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$71)
    5460                      .dwattr $C$DW$771, DW_AT_name("Rhf")
    5461                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Rhf")
    5462                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    5463                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    5464              $C$DW$772       .dwtag  DW_TAG_member
    5465                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$71)
    5466                      .dwattr $C$DW$772, DW_AT_name("Lhf")
    5467                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Lhf")
    5468                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    5469                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    5470              $C$DW$773       .dwtag  DW_TAG_member
    5471                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$71)
    5472                      .dwattr $C$DW$773, DW_AT_name("RoverL")
    5473                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_RoverL")
    5474                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  108

    5475                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    5476              $C$DW$774       .dwtag  DW_TAG_member
    5477                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$35)
    5478                      .dwattr $C$DW$774, DW_AT_name("Kp_Id")
    5479                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Kp_Id")
    5480                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    5481                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    5482              $C$DW$775       .dwtag  DW_TAG_member
    5483                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$35)
    5484                      .dwattr $C$DW$775, DW_AT_name("Kp_Iq")
    5485                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_Kp_Iq")
    5486                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    5487                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    5488              $C$DW$776       .dwtag  DW_TAG_member
    5489                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$35)
    5490                      .dwattr $C$DW$776, DW_AT_name("Kp_spd")
    5491                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Kp_spd")
    5492                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    5493                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    5494              $C$DW$777       .dwtag  DW_TAG_member
    5495                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$35)
    5496                      .dwattr $C$DW$777, DW_AT_name("Ki_Id")
    5497                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Ki_Id")
    5498                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    5499                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    5500              $C$DW$778       .dwtag  DW_TAG_member
    5501                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$35)
    5502                      .dwattr $C$DW$778, DW_AT_name("Ki_Iq")
    5503                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Ki_Iq")
    5504                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    5505                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    5506              $C$DW$779       .dwtag  DW_TAG_member
    5507                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$35)
    5508                      .dwattr $C$DW$779, DW_AT_name("Ki_spd")
    5509                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Ki_spd")
    5510                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    5511                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    5512              $C$DW$780       .dwtag  DW_TAG_member
    5513                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$35)
    5514                      .dwattr $C$DW$780, DW_AT_name("Kd_Id")
    5515                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Kd_Id")
    5516                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    5517                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    5518              $C$DW$781       .dwtag  DW_TAG_member
    5519                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$35)
    5520                      .dwattr $C$DW$781, DW_AT_name("Kd_Iq")
    5521                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Kd_Iq")
    5522                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    5523                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    5524              $C$DW$782       .dwtag  DW_TAG_member
    5525                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$35)
    5526                      .dwattr $C$DW$782, DW_AT_name("Kd_spd")
    5527                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Kd_spd")
    5528                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    5529                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  109

    5530              $C$DW$783       .dwtag  DW_TAG_member
    5531                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$35)
    5532                      .dwattr $C$DW$783, DW_AT_name("Ui_Id")
    5533                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Ui_Id")
    5534                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    5535                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    5536              $C$DW$784       .dwtag  DW_TAG_member
    5537                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$35)
    5538                      .dwattr $C$DW$784, DW_AT_name("Ui_Iq")
    5539                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Ui_Iq")
    5540                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    5541                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    5542              $C$DW$785       .dwtag  DW_TAG_member
    5543                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$35)
    5544                      .dwattr $C$DW$785, DW_AT_name("Ui_spd")
    5545                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Ui_spd")
    5546                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    5547                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    5548              $C$DW$786       .dwtag  DW_TAG_member
    5549                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$72)
    5550                      .dwattr $C$DW$786, DW_AT_name("Idq_ref")
    5551                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Idq_ref")
    5552                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    5553                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    5554              $C$DW$787       .dwtag  DW_TAG_member
    5555                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$35)
    5556                      .dwattr $C$DW$787, DW_AT_name("IdRated")
    5557                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_IdRated")
    5558                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    5559                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    5560              $C$DW$788       .dwtag  DW_TAG_member
    5561                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$35)
    5562                      .dwattr $C$DW$788, DW_AT_name("spd_ref")
    5563                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_spd_ref")
    5564                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    5565                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    5566              $C$DW$789       .dwtag  DW_TAG_member
    5567                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$35)
    5568                      .dwattr $C$DW$789, DW_AT_name("spd_max")
    5569                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_spd_max")
    5570                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    5571                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    5572              $C$DW$790       .dwtag  DW_TAG_member
    5573                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$70)
    5574                      .dwattr $C$DW$790, DW_AT_name("counter_current")
    5575                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_counter_current")
    5576                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    5577                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    5578              $C$DW$791       .dwtag  DW_TAG_member
    5579                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$70)
    5580                      .dwattr $C$DW$791, DW_AT_name("counter_isr")
    5581                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_counter_isr")
    5582                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    5583                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    5584              $C$DW$792       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  110

    5585                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$70)
    5586                      .dwattr $C$DW$792, DW_AT_name("counter_speed")
    5587                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_counter_speed")
    5588                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    5589                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    5590              $C$DW$793       .dwtag  DW_TAG_member
    5591                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$70)
    5592                      .dwattr $C$DW$793, DW_AT_name("counter_traj")
    5593                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_counter_traj")
    5594                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    5595                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    5596              $C$DW$794       .dwtag  DW_TAG_member
    5597                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$73)
    5598                      .dwattr $C$DW$794, DW_AT_name("flag_enableCtrl")
    5599                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_flag_enableCtrl")
    5600                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    5601                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    5602              $C$DW$795       .dwtag  DW_TAG_member
    5603                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$73)
    5604                      .dwattr $C$DW$795, DW_AT_name("flag_enableDcBusComp")
    5605                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    5606                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    5607                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    5608              $C$DW$796       .dwtag  DW_TAG_member
    5609                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$73)
    5610                      .dwattr $C$DW$796, DW_AT_name("flag_enablePowerWarp")
    5611                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    5612                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    5613                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    5614              $C$DW$797       .dwtag  DW_TAG_member
    5615                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$73)
    5616                      .dwattr $C$DW$797, DW_AT_name("flag_enableOffset")
    5617                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_flag_enableOffset")
    5618                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    5619                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    5620              $C$DW$798       .dwtag  DW_TAG_member
    5621                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$73)
    5622                      .dwattr $C$DW$798, DW_AT_name("flag_enableSpeedCtrl")
    5623                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    5624                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    5625                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    5626              $C$DW$799       .dwtag  DW_TAG_member
    5627                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$73)
    5628                      .dwattr $C$DW$799, DW_AT_name("flag_enableUserMotorParams")
    5629                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    5630                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    5631                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    5632              $C$DW$800       .dwtag  DW_TAG_member
    5633                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$72)
    5634                      .dwattr $C$DW$800, DW_AT_name("Idq_offset_pu")
    5635                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_Idq_offset_pu")
    5636                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    5637                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    5638              $C$DW$801       .dwtag  DW_TAG_member
    5639                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$72)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  111

    5640                      .dwattr $C$DW$801, DW_AT_name("Vdq_offset_pu")
    5641                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    5642                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    5643                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    5644              $C$DW$802       .dwtag  DW_TAG_member
    5645                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$35)
    5646                      .dwattr $C$DW$802, DW_AT_name("angle_pu")
    5647                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_angle_pu")
    5648                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    5649                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    5650              $C$DW$803       .dwtag  DW_TAG_member
    5651                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$35)
    5652                      .dwattr $C$DW$803, DW_AT_name("speed_ref_pu")
    5653                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_speed_ref_pu")
    5654                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    5655                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    5656              $C$DW$804       .dwtag  DW_TAG_member
    5657                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$35)
    5658                      .dwattr $C$DW$804, DW_AT_name("speed_fb_pu")
    5659                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_speed_fb_pu")
    5660                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    5661                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    5662              $C$DW$805       .dwtag  DW_TAG_member
    5663                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$35)
    5664                      .dwattr $C$DW$805, DW_AT_name("speed_outMax_pu")
    5665                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_speed_outMax_pu")
    5666                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    5667                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    5668              $C$DW$806       .dwtag  DW_TAG_member
    5669                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$73)
    5670                      .dwattr $C$DW$806, DW_AT_name("flag_enableCurrentCtrl")
    5671                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    5672                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    5673                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    5674                      .dwendtag $C$DW$T$74
    5675              
    5676              $C$DW$T$236     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    5677                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$74)
    5678                      .dwattr $C$DW$T$236, DW_AT_language(DW_LANG_C)
    5679              $C$DW$T$237     .dwtag  DW_TAG_pointer_type
    5680                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    5681                      .dwattr $C$DW$T$237, DW_AT_address_class(0x20)
    5682              $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    5683                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$74)
    5684                      .dwattr $C$DW$T$200, DW_AT_address_class(0x20)
    5685              $C$DW$T$201     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    5686                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$200)
    5687                      .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    5688              $C$DW$807       .dwtag  DW_TAG_TI_far_type
    5689                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$201)
    5690              $C$DW$T$238     .dwtag  DW_TAG_const_type
    5691                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$807)
    5692              
    5693              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    5694                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Version_")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  112

    5695                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    5696              $C$DW$808       .dwtag  DW_TAG_member
    5697                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$26)
    5698                      .dwattr $C$DW$808, DW_AT_name("rsvd")
    5699                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_rsvd")
    5700                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5701                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    5702              $C$DW$809       .dwtag  DW_TAG_member
    5703                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$76)
    5704                      .dwattr $C$DW$809, DW_AT_name("targetProc")
    5705                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_targetProc")
    5706                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5707                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    5708              $C$DW$810       .dwtag  DW_TAG_member
    5709                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$26)
    5710                      .dwattr $C$DW$810, DW_AT_name("major")
    5711                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_major")
    5712                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5713                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    5714              $C$DW$811       .dwtag  DW_TAG_member
    5715                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$26)
    5716                      .dwattr $C$DW$811, DW_AT_name("minor")
    5717                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_minor")
    5718                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5719                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    5720                      .dwendtag $C$DW$T$77
    5721              
    5722              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    5723                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$77)
    5724                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    5725              $C$DW$T$244     .dwtag  DW_TAG_pointer_type
    5726                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$41)
    5727                      .dwattr $C$DW$T$244, DW_AT_address_class(0x20)
    5728              
    5729              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    5730                      .dwattr $C$DW$T$84, DW_AT_name("_DRV8301_Obj_")
    5731                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x08)
    5732              $C$DW$812       .dwtag  DW_TAG_member
    5733                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$79)
    5734                      .dwattr $C$DW$812, DW_AT_name("spiHandle")
    5735                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_spiHandle")
    5736                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5737                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    5738              $C$DW$813       .dwtag  DW_TAG_member
    5739                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$81)
    5740                      .dwattr $C$DW$813, DW_AT_name("gpioHandle")
    5741                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_gpioHandle")
    5742                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5743                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    5744              $C$DW$814       .dwtag  DW_TAG_member
    5745                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$83)
    5746                      .dwattr $C$DW$814, DW_AT_name("gpioNumber")
    5747                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_gpioNumber")
    5748                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5749                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  113

    5750              $C$DW$815       .dwtag  DW_TAG_member
    5751                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$73)
    5752                      .dwattr $C$DW$815, DW_AT_name("RxTimeOut")
    5753                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_RxTimeOut")
    5754                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5755                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    5756              $C$DW$816       .dwtag  DW_TAG_member
    5757                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$73)
    5758                      .dwattr $C$DW$816, DW_AT_name("enableTimeOut")
    5759                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_enableTimeOut")
    5760                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5761                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    5762                      .dwendtag $C$DW$T$84
    5763              
    5764              $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    5765                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$84)
    5766                      .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    5767              $C$DW$T$151     .dwtag  DW_TAG_pointer_type
    5768                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$84)
    5769                      .dwattr $C$DW$T$151, DW_AT_address_class(0x20)
    5770              $C$DW$T$152     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    5771                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$151)
    5772                      .dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
    5773              
    5774              $C$DW$T$95      .dwtag  DW_TAG_structure_type
    5775                      .dwattr $C$DW$T$95, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    5776                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x05)
    5777              $C$DW$817       .dwtag  DW_TAG_member
    5778                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$86)
    5779                      .dwattr $C$DW$817, DW_AT_name("DRV8301_CURRENT")
    5780                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    5781                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5782                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    5783              $C$DW$818       .dwtag  DW_TAG_member
    5784                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$88)
    5785                      .dwattr $C$DW$818, DW_AT_name("DRV8301_RESET")
    5786                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_DRV8301_RESET")
    5787                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5788                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    5789              $C$DW$819       .dwtag  DW_TAG_member
    5790                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$90)
    5791                      .dwattr $C$DW$819, DW_AT_name("PWM_MODE")
    5792                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_PWM_MODE")
    5793                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5794                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    5795              $C$DW$820       .dwtag  DW_TAG_member
    5796                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$92)
    5797                      .dwattr $C$DW$820, DW_AT_name("OC_MODE")
    5798                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_OC_MODE")
    5799                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5800                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    5801              $C$DW$821       .dwtag  DW_TAG_member
    5802                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$94)
    5803                      .dwattr $C$DW$821, DW_AT_name("OC_ADJ_SET")
    5804                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_OC_ADJ_SET")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  114

    5805                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5806                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    5807                      .dwendtag $C$DW$T$95
    5808              
    5809              $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    5810                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$95)
    5811                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    5812              
    5813              $C$DW$T$104     .dwtag  DW_TAG_structure_type
    5814                      .dwattr $C$DW$T$104, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    5815                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x04)
    5816              $C$DW$822       .dwtag  DW_TAG_member
    5817                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$97)
    5818                      .dwattr $C$DW$822, DW_AT_name("OCTW_SET")
    5819                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_OCTW_SET")
    5820                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5821                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    5822              $C$DW$823       .dwtag  DW_TAG_member
    5823                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$99)
    5824                      .dwattr $C$DW$823, DW_AT_name("GAIN")
    5825                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_GAIN")
    5826                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5827                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    5828              $C$DW$824       .dwtag  DW_TAG_member
    5829                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$101)
    5830                      .dwattr $C$DW$824, DW_AT_name("DC_CAL_CH1p2")
    5831                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    5832                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5833                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    5834              $C$DW$825       .dwtag  DW_TAG_member
    5835                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$103)
    5836                      .dwattr $C$DW$825, DW_AT_name("OC_TOFF")
    5837                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_OC_TOFF")
    5838                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5839                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    5840                      .dwendtag $C$DW$T$104
    5841              
    5842              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    5843                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$104)
    5844                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    5845              
    5846              $C$DW$T$105     .dwtag  DW_TAG_structure_type
    5847                      .dwattr $C$DW$T$105, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    5848                      .dwattr $C$DW$T$105, DW_AT_byte_size(0x0b)
    5849              $C$DW$826       .dwtag  DW_TAG_member
    5850                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$73)
    5851                      .dwattr $C$DW$826, DW_AT_name("FAULT")
    5852                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_FAULT")
    5853                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5854                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    5855              $C$DW$827       .dwtag  DW_TAG_member
    5856                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$73)
    5857                      .dwattr $C$DW$827, DW_AT_name("GVDD_UV")
    5858                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_GVDD_UV")
    5859                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  115

    5860                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    5861              $C$DW$828       .dwtag  DW_TAG_member
    5862                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$73)
    5863                      .dwattr $C$DW$828, DW_AT_name("PVDD_UV")
    5864                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_PVDD_UV")
    5865                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5866                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    5867              $C$DW$829       .dwtag  DW_TAG_member
    5868                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$73)
    5869                      .dwattr $C$DW$829, DW_AT_name("OTSD")
    5870                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_OTSD")
    5871                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5872                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    5873              $C$DW$830       .dwtag  DW_TAG_member
    5874                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$73)
    5875                      .dwattr $C$DW$830, DW_AT_name("OTW")
    5876                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_OTW")
    5877                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5878                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    5879              $C$DW$831       .dwtag  DW_TAG_member
    5880                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$73)
    5881                      .dwattr $C$DW$831, DW_AT_name("FETHA_OC")
    5882                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_FETHA_OC")
    5883                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5884                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    5885              $C$DW$832       .dwtag  DW_TAG_member
    5886                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$73)
    5887                      .dwattr $C$DW$832, DW_AT_name("FETLA_OC")
    5888                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_FETLA_OC")
    5889                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5890                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    5891              $C$DW$833       .dwtag  DW_TAG_member
    5892                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$73)
    5893                      .dwattr $C$DW$833, DW_AT_name("FETHB_OC")
    5894                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_FETHB_OC")
    5895                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5896                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    5897              $C$DW$834       .dwtag  DW_TAG_member
    5898                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$73)
    5899                      .dwattr $C$DW$834, DW_AT_name("FETLB_OC")
    5900                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_FETLB_OC")
    5901                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5902                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    5903              $C$DW$835       .dwtag  DW_TAG_member
    5904                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$73)
    5905                      .dwattr $C$DW$835, DW_AT_name("FETHC_OC")
    5906                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_FETHC_OC")
    5907                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5908                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    5909              $C$DW$836       .dwtag  DW_TAG_member
    5910                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$73)
    5911                      .dwattr $C$DW$836, DW_AT_name("FETLC_OC")
    5912                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_FETLC_OC")
    5913                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5914                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  116

    5915                      .dwendtag $C$DW$T$105
    5916              
    5917              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    5918                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$105)
    5919                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    5920              
    5921              $C$DW$T$106     .dwtag  DW_TAG_structure_type
    5922                      .dwattr $C$DW$T$106, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    5923                      .dwattr $C$DW$T$106, DW_AT_byte_size(0x02)
    5924              $C$DW$837       .dwtag  DW_TAG_member
    5925                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$73)
    5926                      .dwattr $C$DW$837, DW_AT_name("GVDD_OV")
    5927                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_GVDD_OV")
    5928                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5929                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    5930              $C$DW$838       .dwtag  DW_TAG_member
    5931                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$26)
    5932                      .dwattr $C$DW$838, DW_AT_name("DeviceID")
    5933                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_DeviceID")
    5934                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5935                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    5936                      .dwendtag $C$DW$T$106
    5937              
    5938              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    5939                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$106)
    5940                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    5941              
    5942              $C$DW$T$111     .dwtag  DW_TAG_structure_type
    5943                      .dwattr $C$DW$T$111, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    5944                      .dwattr $C$DW$T$111, DW_AT_byte_size(0x18)
    5945              $C$DW$839       .dwtag  DW_TAG_member
    5946                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$107)
    5947                      .dwattr $C$DW$839, DW_AT_name("Stat_Reg_1")
    5948                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_Stat_Reg_1")
    5949                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5950                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    5951              $C$DW$840       .dwtag  DW_TAG_member
    5952                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$108)
    5953                      .dwattr $C$DW$840, DW_AT_name("Stat_Reg_2")
    5954                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_Stat_Reg_2")
    5955                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5956                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    5957              $C$DW$841       .dwtag  DW_TAG_member
    5958                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$109)
    5959                      .dwattr $C$DW$841, DW_AT_name("Ctrl_Reg_1")
    5960                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    5961                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5962                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    5963              $C$DW$842       .dwtag  DW_TAG_member
    5964                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$110)
    5965                      .dwattr $C$DW$842, DW_AT_name("Ctrl_Reg_2")
    5966                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    5967                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5968                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    5969              $C$DW$843       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0448010                            PAGE  117

    5970                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$73)
    5971                      .dwattr $C$DW$843, DW_AT_name("SndCmd")
    5972                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_SndCmd")
    5973                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5974                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    5975              $C$DW$844       .dwtag  DW_TAG_member
