TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 10:29:36 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab20\Release")
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    6525              $C$DW$664       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    6526              $C$DW$665       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6527              $C$DW$666       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6528              $C$DW$667       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6529              $C$DW$668       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6530              $C$DW$669       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6531              $C$DW$670       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6532              $C$DW$671       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6533              $C$DW$672       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6534              $C$DW$673       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6535              $C$DW$674       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6536                      .dwendtag $C$DW$T$162
    6537              
    6538              $C$DW$T$163     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6539                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$162)
    6540                      .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    6541              
    6542              $C$DW$T$172     .dwtag  DW_TAG_enumeration_type
    6543                      .dwattr $C$DW$T$172, DW_AT_byte_size(0x01)
    6544              $C$DW$675       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Error"), DW_AT_const_value(0x00)
    6545              $C$DW$676       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Idle"), DW_AT_const_value(0x01)
    6546              $C$DW$677       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RoverL"), DW_AT_const_value(0x02)
    6547              $C$DW$678       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rs"), DW_AT_const_value(0x03)
    6548              $C$DW$679       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampUp"), DW_AT_const_value(0x04)
    6549              $C$DW$680       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_IdRated"), DW_AT_const_value(0x05)
    6550              $C$DW$681       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux_OL"), DW_AT_const_value(0x06)
    6551              $C$DW$682       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux"), DW_AT_const_value(0x07)
    6552              $C$DW$683       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampDown"), DW_AT_const_value(0x08)
    6553              $C$DW$684       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_LockRotor"), DW_AT_const_value(0x09)
    6554              $C$DW$685       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Ls"), DW_AT_const_value(0x0a)
    6555              $C$DW$686       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rr"), DW_AT_const_value(0x0b)
    6556              $C$DW$687       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_MotorIdentified"), DW_AT_const_value(0x0c)
    6557              $C$DW$688       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_OnLine"), DW_AT_const_value(0x0d)
    6558              $C$DW$689       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_numStates"), DW_AT_const_value(0x0e)
    6559                      .dwendtag $C$DW$T$172
    6560              
    6561              $C$DW$T$173     .dwtag  DW_TAG_typedef, DW_AT_name("EST_State_e")
    6562                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$172)
    6563                      .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    6564              
    6565              $C$DW$T$177     .dwtag  DW_TAG_enumeration_type
    6566                      .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    6567              $C$DW$690       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  127

    6568              $C$DW$691       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6569              $C$DW$692       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6570                      .dwendtag $C$DW$T$177
    6571              
    6572              $C$DW$T$178     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6573                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$177)
    6574                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    6575              $C$DW$693       .dwtag  DW_TAG_TI_far_type
    6576                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$178)
    6577              $C$DW$T$179     .dwtag  DW_TAG_const_type
    6578                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$693)
    6579              
    6580              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6581                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    6582                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    6583              $C$DW$694       .dwtag  DW_TAG_member
    6584                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$24)
    6585                      .dwattr $C$DW$694, DW_AT_name("ADCRESULT")
    6586                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCRESULT")
    6587                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6588                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6589              $C$DW$695       .dwtag  DW_TAG_member
    6590                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$25)
    6591                      .dwattr $C$DW$695, DW_AT_name("resvd_1")
    6592                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_resvd_1")
    6593                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6594                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6595              $C$DW$696       .dwtag  DW_TAG_member
    6596                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$23)
    6597                      .dwattr $C$DW$696, DW_AT_name("ADCCTL1")
    6598                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_ADCCTL1")
    6599                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6600                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6601              $C$DW$697       .dwtag  DW_TAG_member
    6602                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$23)
    6603                      .dwattr $C$DW$697, DW_AT_name("ADCCTL2")
    6604                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_ADCCTL2")
    6605                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6606                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6607              $C$DW$698       .dwtag  DW_TAG_member
    6608                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$26)
    6609                      .dwattr $C$DW$698, DW_AT_name("rsvd_2")
    6610                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_2")
    6611                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6612                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6613              $C$DW$699       .dwtag  DW_TAG_member
    6614                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$23)
    6615                      .dwattr $C$DW$699, DW_AT_name("ADCINTFLG")
    6616                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_ADCINTFLG")
    6617                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6618                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6619              $C$DW$700       .dwtag  DW_TAG_member
    6620                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$23)
    6621                      .dwattr $C$DW$700, DW_AT_name("ADCINTFLGCLR")
    6622                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  128

    6623                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6624                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6625              $C$DW$701       .dwtag  DW_TAG_member
    6626                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$23)
    6627                      .dwattr $C$DW$701, DW_AT_name("ADCINTOVF")
    6628                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ADCINTOVF")
    6629                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6630                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6631              $C$DW$702       .dwtag  DW_TAG_member
    6632                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$23)
    6633                      .dwattr $C$DW$702, DW_AT_name("ADCINTOVFCLR")
    6634                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6635                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6636                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6637              $C$DW$703       .dwtag  DW_TAG_member
    6638                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$27)
    6639                      .dwattr $C$DW$703, DW_AT_name("INTSELxNy")
    6640                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_INTSELxNy")
    6641                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6642                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6643              $C$DW$704       .dwtag  DW_TAG_member
    6644                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$28)
    6645                      .dwattr $C$DW$704, DW_AT_name("rsvd_3")
    6646                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd_3")
    6647                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6648                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6649              $C$DW$705       .dwtag  DW_TAG_member
    6650                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$23)
    6651                      .dwattr $C$DW$705, DW_AT_name("SOCPRICTRL")
    6652                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6653                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6654                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6655              $C$DW$706       .dwtag  DW_TAG_member
    6656                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$23)
    6657                      .dwattr $C$DW$706, DW_AT_name("rsvd_4")
    6658                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_4")
    6659                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6660                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6661              $C$DW$707       .dwtag  DW_TAG_member
    6662                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$23)
    6663                      .dwattr $C$DW$707, DW_AT_name("ADCSAMPLEMODE")
    6664                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6665                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6666                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6667              $C$DW$708       .dwtag  DW_TAG_member
    6668                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$23)
    6669                      .dwattr $C$DW$708, DW_AT_name("rsvd_5")
    6670                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_rsvd_5")
    6671                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6672                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6673              $C$DW$709       .dwtag  DW_TAG_member
    6674                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$23)
    6675                      .dwattr $C$DW$709, DW_AT_name("ADCINTSOCSEL1")
    6676                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6677                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  129

    6678                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6679              $C$DW$710       .dwtag  DW_TAG_member
    6680                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$23)
    6681                      .dwattr $C$DW$710, DW_AT_name("ADCINTSOCSEL2")
    6682                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6683                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6684                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6685              $C$DW$711       .dwtag  DW_TAG_member
    6686                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$26)
    6687                      .dwattr $C$DW$711, DW_AT_name("rsvd_6")
    6688                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_rsvd_6")
    6689                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6690                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6691              $C$DW$712       .dwtag  DW_TAG_member
    6692                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$23)
    6693                      .dwattr $C$DW$712, DW_AT_name("ADCSOCFLG1")
    6694                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6695                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6696                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6697              $C$DW$713       .dwtag  DW_TAG_member
    6698                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$23)
    6699                      .dwattr $C$DW$713, DW_AT_name("rsvd_7")
    6700                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_rsvd_7")
    6701                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6702                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6703              $C$DW$714       .dwtag  DW_TAG_member
    6704                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$23)
    6705                      .dwattr $C$DW$714, DW_AT_name("ADCSOCFRC1")
    6706                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6707                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6708                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6709              $C$DW$715       .dwtag  DW_TAG_member
    6710                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$23)
    6711                      .dwattr $C$DW$715, DW_AT_name("rsvd_8")
    6712                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_rsvd_8")
    6713                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6714                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6715              $C$DW$716       .dwtag  DW_TAG_member
    6716                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$23)
    6717                      .dwattr $C$DW$716, DW_AT_name("ADCSOCOVF1")
    6718                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6719                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6720                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6721              $C$DW$717       .dwtag  DW_TAG_member
    6722                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$23)
    6723                      .dwattr $C$DW$717, DW_AT_name("rsvd_9")
    6724                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_rsvd_9")
    6725                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6726                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6727              $C$DW$718       .dwtag  DW_TAG_member
    6728                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$23)
    6729                      .dwattr $C$DW$718, DW_AT_name("ADCSOCOVFCLR1")
    6730                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6731                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6732                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  130

    6733              $C$DW$719       .dwtag  DW_TAG_member
    6734                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$23)
    6735                      .dwattr $C$DW$719, DW_AT_name("rsvd_10")
    6736                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_rsvd_10")
    6737                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6738                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6739              $C$DW$720       .dwtag  DW_TAG_member
    6740                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$24)
    6741                      .dwattr $C$DW$720, DW_AT_name("ADCSOCxCTL")
    6742                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6743                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6744                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6745              $C$DW$721       .dwtag  DW_TAG_member
    6746                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$24)
    6747                      .dwattr $C$DW$721, DW_AT_name("rsvd_11")
    6748                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_rsvd_11")
    6749                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6750                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6751              $C$DW$722       .dwtag  DW_TAG_member
    6752                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$23)
    6753                      .dwattr $C$DW$722, DW_AT_name("ADCREFTRIM")
    6754                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6755                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6756                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6757              $C$DW$723       .dwtag  DW_TAG_member
    6758                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$23)
    6759                      .dwattr $C$DW$723, DW_AT_name("ADCOFFTRIM")
    6760                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6761                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6762                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6763              $C$DW$724       .dwtag  DW_TAG_member
    6764                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$29)
    6765                      .dwattr $C$DW$724, DW_AT_name("resvd_12")
    6766                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_resvd_12")
    6767                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6768                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6769              $C$DW$725       .dwtag  DW_TAG_member
    6770                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$23)
    6771                      .dwattr $C$DW$725, DW_AT_name("ADCREV")
    6772                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_ADCREV")
    6773                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6774                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6775                      .dwendtag $C$DW$T$30
    6776              
    6777              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    6778                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$30)
    6779                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    6780              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6781                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    6782                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    6783              
    6784              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6785                      .dwattr $C$DW$T$33, DW_AT_name("_CLARKE_Obj_")
    6786                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    6787              $C$DW$726       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  131

    6788                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$31)
    6789                      .dwattr $C$DW$726, DW_AT_name("alpha_sf")
    6790                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_alpha_sf")
    6791                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6792                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6793              $C$DW$727       .dwtag  DW_TAG_member
    6794                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$31)
    6795                      .dwattr $C$DW$727, DW_AT_name("beta_sf")
    6796                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_beta_sf")
    6797                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6798                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6799              $C$DW$728       .dwtag  DW_TAG_member
    6800                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$32)
    6801                      .dwattr $C$DW$728, DW_AT_name("numSensors")
    6802                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_numSensors")
    6803                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6804                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6805                      .dwendtag $C$DW$T$33
    6806              
    6807              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6808                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$33)
    6809                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    6810              $C$DW$T$180     .dwtag  DW_TAG_pointer_type
    6811                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$44)
    6812                      .dwattr $C$DW$T$180, DW_AT_address_class(0x20)
    6813              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    6814                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
    6815                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    6816              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6817                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    6818                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    6819              
    6820              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6821                      .dwattr $C$DW$T$35, DW_AT_name("_CLK_Obj_")
    6822                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x11)
    6823              $C$DW$729       .dwtag  DW_TAG_member
    6824                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$23)
    6825                      .dwattr $C$DW$729, DW_AT_name("XCLK")
    6826                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_XCLK")
    6827                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6828                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6829              $C$DW$730       .dwtag  DW_TAG_member
    6830                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$23)
    6831                      .dwattr $C$DW$730, DW_AT_name("rsvd_1")
    6832                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_rsvd_1")
    6833                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6834                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6835              $C$DW$731       .dwtag  DW_TAG_member
    6836                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$23)
    6837                      .dwattr $C$DW$731, DW_AT_name("CLKCTL")
    6838                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_CLKCTL")
    6839                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6840                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6841              $C$DW$732       .dwtag  DW_TAG_member
    6842                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$34)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  132

    6843                      .dwattr $C$DW$732, DW_AT_name("rsvd_2")
    6844                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_rsvd_2")
    6845                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6846                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6847              $C$DW$733       .dwtag  DW_TAG_member
    6848                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$23)
    6849                      .dwattr $C$DW$733, DW_AT_name("LOSPCP")
    6850                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_LOSPCP")
    6851                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6852                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6853              $C$DW$734       .dwtag  DW_TAG_member
    6854                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$23)
    6855                      .dwattr $C$DW$734, DW_AT_name("PCLKCR0")
    6856                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_PCLKCR0")
    6857                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6858                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6859              $C$DW$735       .dwtag  DW_TAG_member
    6860                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$23)
    6861                      .dwattr $C$DW$735, DW_AT_name("PCLKCR1")
    6862                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_PCLKCR1")
    6863                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6864                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6865              $C$DW$736       .dwtag  DW_TAG_member
    6866                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$26)
    6867                      .dwattr $C$DW$736, DW_AT_name("rsvd_3")
    6868                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_rsvd_3")
    6869                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6870                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6871              $C$DW$737       .dwtag  DW_TAG_member
    6872                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$23)
    6873                      .dwattr $C$DW$737, DW_AT_name("PCLKCR3")
    6874                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_PCLKCR3")
    6875                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6876                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6877                      .dwendtag $C$DW$T$35
    6878              
    6879              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    6880                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$35)
    6881                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    6882              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6883                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    6884                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    6885              
    6886              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6887                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
    6888                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    6889              $C$DW$738       .dwtag  DW_TAG_member
    6890                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$32)
    6891                      .dwattr $C$DW$738, DW_AT_name("tmp")
    6892                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_tmp")
    6893                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6894                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6895                      .dwendtag $C$DW$T$36
    6896              
    6897              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  133

    6898                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$36)
    6899                      .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    6900              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    6901                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    6902                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    6903              
    6904              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    6905                      .dwattr $C$DW$T$70, DW_AT_name("_CTRL_Obj_")
    6906                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x108)
    6907              $C$DW$739       .dwtag  DW_TAG_member
    6908                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$37)
    6909                      .dwattr $C$DW$739, DW_AT_name("version")
    6910                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_version")
    6911                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6912                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    6913              $C$DW$740       .dwtag  DW_TAG_member
    6914                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$39)
    6915                      .dwattr $C$DW$740, DW_AT_name("state")
    6916                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_state")
    6917                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6918                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    6919              $C$DW$741       .dwtag  DW_TAG_member
    6920                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$39)
    6921                      .dwattr $C$DW$741, DW_AT_name("prevState")
    6922                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_prevState")
    6923                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6924                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    6925              $C$DW$742       .dwtag  DW_TAG_member
    6926                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$41)
    6927                      .dwattr $C$DW$742, DW_AT_name("errorCode")
    6928                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_errorCode")
    6929                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6930                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    6931              $C$DW$743       .dwtag  DW_TAG_member
    6932                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$43)
    6933                      .dwattr $C$DW$743, DW_AT_name("clarkeHandle_I")
    6934                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6935                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6936                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    6937              $C$DW$744       .dwtag  DW_TAG_member
    6938                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$44)
    6939                      .dwattr $C$DW$744, DW_AT_name("clarke_I")
    6940                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_clarke_I")
    6941                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6942                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    6943              $C$DW$745       .dwtag  DW_TAG_member
    6944                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$43)
    6945                      .dwattr $C$DW$745, DW_AT_name("clarkeHandle_V")
    6946                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6947                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6948                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    6949              $C$DW$746       .dwtag  DW_TAG_member
    6950                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$44)
    6951                      .dwattr $C$DW$746, DW_AT_name("clarke_V")
    6952                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_clarke_V")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  134

    6953                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6954                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    6955              $C$DW$747       .dwtag  DW_TAG_member
    6956                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$46)
    6957                      .dwattr $C$DW$747, DW_AT_name("estHandle")
    6958                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_estHandle")
    6959                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6960                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    6961              $C$DW$748       .dwtag  DW_TAG_member
    6962                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$48)
    6963                      .dwattr $C$DW$748, DW_AT_name("parkHandle")
    6964                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_parkHandle")
    6965                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6966                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    6967              $C$DW$749       .dwtag  DW_TAG_member
    6968                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$49)
    6969                      .dwattr $C$DW$749, DW_AT_name("park")
    6970                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_park")
    6971                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6972                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    6973              $C$DW$750       .dwtag  DW_TAG_member
    6974                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$51)
    6975                      .dwattr $C$DW$750, DW_AT_name("pidHandle_Id")
    6976                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_pidHandle_Id")
    6977                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6978                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    6979              $C$DW$751       .dwtag  DW_TAG_member
    6980                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$52)
    6981                      .dwattr $C$DW$751, DW_AT_name("pid_Id")
    6982                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_pid_Id")
    6983                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6984                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    6985              $C$DW$752       .dwtag  DW_TAG_member
    6986                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$51)
    6987                      .dwattr $C$DW$752, DW_AT_name("pidHandle_Iq")
    6988                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6989                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6990                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    6991              $C$DW$753       .dwtag  DW_TAG_member
    6992                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$52)
    6993                      .dwattr $C$DW$753, DW_AT_name("pid_Iq")
    6994                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_pid_Iq")
    6995                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6996                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    6997              $C$DW$754       .dwtag  DW_TAG_member
    6998                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$51)
    6999                      .dwattr $C$DW$754, DW_AT_name("pidHandle_spd")
    7000                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_pidHandle_spd")
    7001                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7002                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7003              $C$DW$755       .dwtag  DW_TAG_member
    7004                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$52)
    7005                      .dwattr $C$DW$755, DW_AT_name("pid_spd")
    7006                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_pid_spd")
    7007                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  135

    7008                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7009              $C$DW$756       .dwtag  DW_TAG_member
    7010                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$54)
    7011                      .dwattr $C$DW$756, DW_AT_name("iparkHandle")
    7012                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_iparkHandle")
    7013                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7014                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7015              $C$DW$757       .dwtag  DW_TAG_member
    7016                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$55)
    7017                      .dwattr $C$DW$757, DW_AT_name("ipark")
    7018                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_ipark")
    7019                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7020                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7021              $C$DW$758       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$57)
    7023                      .dwattr $C$DW$758, DW_AT_name("svgenHandle")
    7024                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_svgenHandle")
    7025                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7026                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7027              $C$DW$759       .dwtag  DW_TAG_member
    7028                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$58)
    7029                      .dwattr $C$DW$759, DW_AT_name("svgen")
    7030                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_svgen")
    7031                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7032                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7033              $C$DW$760       .dwtag  DW_TAG_member
    7034                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$60)
    7035                      .dwattr $C$DW$760, DW_AT_name("trajHandle_Id")
    7036                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_trajHandle_Id")
    7037                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7038                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7039              $C$DW$761       .dwtag  DW_TAG_member
    7040                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$61)
    7041                      .dwattr $C$DW$761, DW_AT_name("traj_Id")
    7042                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_traj_Id")
    7043                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7044                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7045              $C$DW$762       .dwtag  DW_TAG_member
    7046                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$60)
    7047                      .dwattr $C$DW$762, DW_AT_name("trajHandle_spd")
    7048                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_trajHandle_spd")
    7049                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7050                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7051              $C$DW$763       .dwtag  DW_TAG_member
    7052                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$61)
    7053                      .dwattr $C$DW$763, DW_AT_name("traj_spd")
    7054                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_traj_spd")
    7055                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7056                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7057              $C$DW$764       .dwtag  DW_TAG_member
    7058                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$60)
    7059                      .dwattr $C$DW$764, DW_AT_name("trajHandle_spdMax")
    7060                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7061                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7062                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  136

    7063              $C$DW$765       .dwtag  DW_TAG_member
    7064                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$61)
    7065                      .dwattr $C$DW$765, DW_AT_name("traj_spdMax")
    7066                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_traj_spdMax")
    7067                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7068                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7069              $C$DW$766       .dwtag  DW_TAG_member
    7070                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$62)
    7071                      .dwattr $C$DW$766, DW_AT_name("motorParams")
    7072                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_motorParams")
    7073                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7074                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7075              $C$DW$767       .dwtag  DW_TAG_member
    7076                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$65)
    7077                      .dwattr $C$DW$767, DW_AT_name("waitTimes")
    7078                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_waitTimes")
    7079                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7080                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7081              $C$DW$768       .dwtag  DW_TAG_member
    7082                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$64)
    7083                      .dwattr $C$DW$768, DW_AT_name("counter_state")
    7084                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_counter_state")
    7085                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7086                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7087              $C$DW$769       .dwtag  DW_TAG_member
    7088                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$66)
    7089                      .dwattr $C$DW$769, DW_AT_name("numIsrTicksPerCtrlTick")
    7090                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7091                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7092                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7093              $C$DW$770       .dwtag  DW_TAG_member
    7094                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$66)
    7095                      .dwattr $C$DW$770, DW_AT_name("numCtrlTicksPerCurrentTick")
    7096                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7097                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7098                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7099              $C$DW$771       .dwtag  DW_TAG_member
    7100                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$66)
    7101                      .dwattr $C$DW$771, DW_AT_name("numCtrlTicksPerSpeedTick")
    7102                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7103                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7104                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7105              $C$DW$772       .dwtag  DW_TAG_member
    7106                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$66)
    7107                      .dwattr $C$DW$772, DW_AT_name("numCtrlTicksPerTrajTick")
    7108                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7109                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7110                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7111              $C$DW$773       .dwtag  DW_TAG_member
    7112                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$64)
    7113                      .dwattr $C$DW$773, DW_AT_name("ctrlFreq_Hz")
    7114                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7115                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7116                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7117              $C$DW$774       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  137

    7118                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$64)
    7119                      .dwattr $C$DW$774, DW_AT_name("trajFreq_Hz")
    7120                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7121                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7122                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7123              $C$DW$775       .dwtag  DW_TAG_member
    7124                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$31)
    7125                      .dwattr $C$DW$775, DW_AT_name("trajPeriod_sec")
    7126                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7127                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7128                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7129              $C$DW$776       .dwtag  DW_TAG_member
    7130                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$67)
    7131                      .dwattr $C$DW$776, DW_AT_name("ctrlPeriod_sec")
    7132                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7133                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7134                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7135              $C$DW$777       .dwtag  DW_TAG_member
    7136                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$31)
    7137                      .dwattr $C$DW$777, DW_AT_name("maxVsMag_pu")
    7138                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7139                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7140                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7141              $C$DW$778       .dwtag  DW_TAG_member
    7142                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$68)
    7143                      .dwattr $C$DW$778, DW_AT_name("Iab_in")
    7144                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Iab_in")
    7145                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7146                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7147              $C$DW$779       .dwtag  DW_TAG_member
    7148                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$68)
    7149                      .dwattr $C$DW$779, DW_AT_name("Iab_filt")
    7150                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Iab_filt")
    7151                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7152                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7153              $C$DW$780       .dwtag  DW_TAG_member
    7154                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$68)
    7155                      .dwattr $C$DW$780, DW_AT_name("Idq_in")
    7156                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Idq_in")
    7157                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7158                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7159              $C$DW$781       .dwtag  DW_TAG_member
    7160                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$68)
    7161                      .dwattr $C$DW$781, DW_AT_name("Vab_in")
    7162                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Vab_in")
    7163                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7164                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7165              $C$DW$782       .dwtag  DW_TAG_member
    7166                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$31)
    7167                      .dwattr $C$DW$782, DW_AT_name("spd_out")
    7168                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_spd_out")
    7169                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7170                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7171              $C$DW$783       .dwtag  DW_TAG_member
    7172                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$68)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  138

    7173                      .dwattr $C$DW$783, DW_AT_name("Vab_out")
    7174                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Vab_out")
    7175                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7176                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7177              $C$DW$784       .dwtag  DW_TAG_member
    7178                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$68)
    7179                      .dwattr $C$DW$784, DW_AT_name("Vdq_out")
    7180                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Vdq_out")
    7181                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7182                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7183              $C$DW$785       .dwtag  DW_TAG_member
    7184                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$67)
    7185                      .dwattr $C$DW$785, DW_AT_name("Rhf")
    7186                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Rhf")
    7187                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7188                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7189              $C$DW$786       .dwtag  DW_TAG_member
    7190                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$67)
    7191                      .dwattr $C$DW$786, DW_AT_name("Lhf")
    7192                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Lhf")
    7193                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7194                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7195              $C$DW$787       .dwtag  DW_TAG_member
    7196                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$67)
    7197                      .dwattr $C$DW$787, DW_AT_name("RoverL")
    7198                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_RoverL")
    7199                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7200                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7201              $C$DW$788       .dwtag  DW_TAG_member
    7202                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$31)
    7203                      .dwattr $C$DW$788, DW_AT_name("Kp_Id")
    7204                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Kp_Id")
    7205                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7206                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7207              $C$DW$789       .dwtag  DW_TAG_member
    7208                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$31)
    7209                      .dwattr $C$DW$789, DW_AT_name("Kp_Iq")
    7210                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_Kp_Iq")
    7211                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7212                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7213              $C$DW$790       .dwtag  DW_TAG_member
    7214                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$31)
    7215                      .dwattr $C$DW$790, DW_AT_name("Kp_spd")
    7216                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_Kp_spd")
    7217                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7218                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7219              $C$DW$791       .dwtag  DW_TAG_member
    7220                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$31)
    7221                      .dwattr $C$DW$791, DW_AT_name("Ki_Id")
    7222                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_Ki_Id")
    7223                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7224                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7225              $C$DW$792       .dwtag  DW_TAG_member
    7226                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$31)
    7227                      .dwattr $C$DW$792, DW_AT_name("Ki_Iq")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  139

    7228                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_Ki_Iq")
    7229                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7230                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7231              $C$DW$793       .dwtag  DW_TAG_member
    7232                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$31)
    7233                      .dwattr $C$DW$793, DW_AT_name("Ki_spd")
    7234                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_Ki_spd")
    7235                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7236                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7237              $C$DW$794       .dwtag  DW_TAG_member
    7238                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$31)
    7239                      .dwattr $C$DW$794, DW_AT_name("Kd_Id")
    7240                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_Kd_Id")
    7241                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7242                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7243              $C$DW$795       .dwtag  DW_TAG_member
    7244                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$31)
    7245                      .dwattr $C$DW$795, DW_AT_name("Kd_Iq")
    7246                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_Kd_Iq")
    7247                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7248                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7249              $C$DW$796       .dwtag  DW_TAG_member
    7250                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$31)
    7251                      .dwattr $C$DW$796, DW_AT_name("Kd_spd")
    7252                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_Kd_spd")
    7253                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7254                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7255              $C$DW$797       .dwtag  DW_TAG_member
    7256                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$31)
    7257                      .dwattr $C$DW$797, DW_AT_name("Ui_Id")
    7258                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_Ui_Id")
    7259                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7260                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7261              $C$DW$798       .dwtag  DW_TAG_member
    7262                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$31)
    7263                      .dwattr $C$DW$798, DW_AT_name("Ui_Iq")
    7264                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_Ui_Iq")
    7265                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7266                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7267              $C$DW$799       .dwtag  DW_TAG_member
    7268                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$31)
    7269                      .dwattr $C$DW$799, DW_AT_name("Ui_spd")
    7270                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_Ui_spd")
    7271                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7272                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7273              $C$DW$800       .dwtag  DW_TAG_member
    7274                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$68)
    7275                      .dwattr $C$DW$800, DW_AT_name("Idq_ref")
    7276                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_Idq_ref")
    7277                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7278                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7279              $C$DW$801       .dwtag  DW_TAG_member
    7280                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$31)
    7281                      .dwattr $C$DW$801, DW_AT_name("IdRated")
    7282                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_IdRated")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  140

    7283                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7284                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7285              $C$DW$802       .dwtag  DW_TAG_member
    7286                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$31)
    7287                      .dwattr $C$DW$802, DW_AT_name("spd_ref")
    7288                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_spd_ref")
    7289                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7290                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7291              $C$DW$803       .dwtag  DW_TAG_member
    7292                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$31)
    7293                      .dwattr $C$DW$803, DW_AT_name("spd_max")
    7294                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_spd_max")
    7295                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7296                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7297              $C$DW$804       .dwtag  DW_TAG_member
    7298                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$66)
    7299                      .dwattr $C$DW$804, DW_AT_name("counter_current")
    7300                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_counter_current")
    7301                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7302                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7303              $C$DW$805       .dwtag  DW_TAG_member
    7304                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$66)
    7305                      .dwattr $C$DW$805, DW_AT_name("counter_isr")
    7306                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_counter_isr")
    7307                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7308                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7309              $C$DW$806       .dwtag  DW_TAG_member
    7310                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$66)
    7311                      .dwattr $C$DW$806, DW_AT_name("counter_speed")
    7312                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_counter_speed")
    7313                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7314                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7315              $C$DW$807       .dwtag  DW_TAG_member
    7316                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$66)
    7317                      .dwattr $C$DW$807, DW_AT_name("counter_traj")
    7318                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_counter_traj")
    7319                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7320                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7321              $C$DW$808       .dwtag  DW_TAG_member
    7322                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$69)
    7323                      .dwattr $C$DW$808, DW_AT_name("flag_enableCtrl")
    7324                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7325                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7326                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7327              $C$DW$809       .dwtag  DW_TAG_member
    7328                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$69)
    7329                      .dwattr $C$DW$809, DW_AT_name("flag_enableDcBusComp")
    7330                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7331                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7332                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7333              $C$DW$810       .dwtag  DW_TAG_member
    7334                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$69)
    7335                      .dwattr $C$DW$810, DW_AT_name("flag_enablePowerWarp")
    7336                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7337                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  141

    7338                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7339              $C$DW$811       .dwtag  DW_TAG_member
    7340                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$69)
    7341                      .dwattr $C$DW$811, DW_AT_name("flag_enableOffset")
    7342                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_flag_enableOffset")
    7343                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7344                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7345              $C$DW$812       .dwtag  DW_TAG_member
    7346                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$69)
    7347                      .dwattr $C$DW$812, DW_AT_name("flag_enableSpeedCtrl")
    7348                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7349                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7350                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7351              $C$DW$813       .dwtag  DW_TAG_member
    7352                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$69)
    7353                      .dwattr $C$DW$813, DW_AT_name("flag_enableUserMotorParams")
    7354                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7355                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7356                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7357              $C$DW$814       .dwtag  DW_TAG_member
    7358                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$68)
    7359                      .dwattr $C$DW$814, DW_AT_name("Idq_offset_pu")
    7360                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7361                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7362                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7363              $C$DW$815       .dwtag  DW_TAG_member
    7364                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$68)
    7365                      .dwattr $C$DW$815, DW_AT_name("Vdq_offset_pu")
    7366                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7367                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7368                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7369              $C$DW$816       .dwtag  DW_TAG_member
    7370                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$31)
    7371                      .dwattr $C$DW$816, DW_AT_name("angle_pu")
    7372                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_angle_pu")
    7373                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7374                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    7375              $C$DW$817       .dwtag  DW_TAG_member
    7376                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$31)
    7377                      .dwattr $C$DW$817, DW_AT_name("speed_ref_pu")
    7378                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_speed_ref_pu")
    7379                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7380                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7381              $C$DW$818       .dwtag  DW_TAG_member
    7382                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$31)
    7383                      .dwattr $C$DW$818, DW_AT_name("speed_fb_pu")
    7384                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_speed_fb_pu")
    7385                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7386                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7387              $C$DW$819       .dwtag  DW_TAG_member
    7388                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$31)
    7389                      .dwattr $C$DW$819, DW_AT_name("speed_outMax_pu")
    7390                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7391                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7392                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  142

    7393              $C$DW$820       .dwtag  DW_TAG_member
    7394                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$69)
    7395                      .dwattr $C$DW$820, DW_AT_name("flag_enableCurrentCtrl")
    7396                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7397                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7398                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    7399                      .dwendtag $C$DW$T$70
    7400              
    7401              $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7402                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$70)
    7403                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    7404              $C$DW$T$167     .dwtag  DW_TAG_pointer_type
    7405                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$70)
    7406                      .dwattr $C$DW$T$167, DW_AT_address_class(0x20)
    7407              $C$DW$T$168     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7408                      .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$167)
    7409                      .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    7410              $C$DW$821       .dwtag  DW_TAG_TI_far_type
    7411                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$168)
    7412              $C$DW$T$182     .dwtag  DW_TAG_const_type
    7413                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$821)
    7414              
    7415              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    7416                      .dwattr $C$DW$T$73, DW_AT_name("_CTRL_Version_")
    7417                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x04)
    7418              $C$DW$822       .dwtag  DW_TAG_member
    7419                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$22)
    7420                      .dwattr $C$DW$822, DW_AT_name("rsvd")
    7421                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_rsvd")
    7422                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7423                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    7424              $C$DW$823       .dwtag  DW_TAG_member
    7425                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$72)
    7426                      .dwattr $C$DW$823, DW_AT_name("targetProc")
    7427                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_targetProc")
    7428                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7429                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    7430              $C$DW$824       .dwtag  DW_TAG_member
    7431                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$22)
    7432                      .dwattr $C$DW$824, DW_AT_name("major")
    7433                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_major")
    7434                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7435                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    7436              $C$DW$825       .dwtag  DW_TAG_member
    7437                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$22)
    7438                      .dwattr $C$DW$825, DW_AT_name("minor")
    7439                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_minor")
    7440                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7441                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    7442                      .dwendtag $C$DW$T$73
    7443              
    7444              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7445                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$73)
    7446                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    7447              
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  143

    7448              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    7449                      .dwattr $C$DW$T$80, DW_AT_name("_DRV8301_Obj_")
    7450                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x08)
    7451              $C$DW$826       .dwtag  DW_TAG_member
    7452                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$75)
    7453                      .dwattr $C$DW$826, DW_AT_name("spiHandle")
    7454                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_spiHandle")
    7455                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7456                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    7457              $C$DW$827       .dwtag  DW_TAG_member
    7458                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$77)
    7459                      .dwattr $C$DW$827, DW_AT_name("gpioHandle")
    7460                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_gpioHandle")
    7461                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7462                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    7463              $C$DW$828       .dwtag  DW_TAG_member
    7464                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$79)
    7465                      .dwattr $C$DW$828, DW_AT_name("gpioNumber")
    7466                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_gpioNumber")
    7467                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7468                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    7469              $C$DW$829       .dwtag  DW_TAG_member
    7470                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$69)
    7471                      .dwattr $C$DW$829, DW_AT_name("RxTimeOut")
    7472                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_RxTimeOut")
    7473                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7474                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    7475              $C$DW$830       .dwtag  DW_TAG_member
    7476                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$69)
    7477                      .dwattr $C$DW$830, DW_AT_name("enableTimeOut")
    7478                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_enableTimeOut")
    7479                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7480                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    7481                      .dwendtag $C$DW$T$80
    7482              
    7483              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    7484                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$80)
    7485                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    7486              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    7487                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$80)
    7488                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    7489              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    7490                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    7491                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    7492              
    7493              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7494                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7495                      .dwattr $C$DW$T$19, DW_AT_declaration
    7496                      .dwendtag $C$DW$T$19
    7497              
    7498              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    7499                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$19)
    7500                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    7501              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7502                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  144

    7503                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    7504              
    7505              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    7506                      .dwattr $C$DW$T$81, DW_AT_name("_FILTER_FO_")
    7507                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0a)
    7508              $C$DW$831       .dwtag  DW_TAG_member
    7509                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$31)
    7510                      .dwattr $C$DW$831, DW_AT_name("a1")
    7511                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_a1")
    7512                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7513                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    7514              $C$DW$832       .dwtag  DW_TAG_member
    7515                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$31)
    7516                      .dwattr $C$DW$832, DW_AT_name("b0")
    7517                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_b0")
    7518                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7519                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    7520              $C$DW$833       .dwtag  DW_TAG_member
    7521                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$31)
    7522                      .dwattr $C$DW$833, DW_AT_name("b1")
    7523                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_b1")
    7524                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7525                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    7526              $C$DW$834       .dwtag  DW_TAG_member
    7527                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$31)
    7528                      .dwattr $C$DW$834, DW_AT_name("x1")
    7529                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_x1")
    7530                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7531                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    7532              $C$DW$835       .dwtag  DW_TAG_member
    7533                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$31)
    7534                      .dwattr $C$DW$835, DW_AT_name("y1")
    7535                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_y1")
    7536                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7537                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    7538                      .dwendtag $C$DW$T$81
    7539              
    7540              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7541                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$81)
    7542                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    7543              $C$DW$T$184     .dwtag  DW_TAG_pointer_type
    7544                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$133)
    7545                      .dwattr $C$DW$T$184, DW_AT_address_class(0x20)
    7546              
    7547              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7548                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    7549                      .dwattr $C$DW$T$20, DW_AT_declaration
    7550                      .dwendtag $C$DW$T$20
    7551              
    7552              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
    7553                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$20)
    7554                      .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
    7555              $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7556                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    7557                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  145

    7558              
    7559              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    7560                      .dwattr $C$DW$T$82, DW_AT_name("_FLASH_Obj_")
    7561                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
    7562              $C$DW$836       .dwtag  DW_TAG_member
    7563                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$23)
    7564                      .dwattr $C$DW$836, DW_AT_name("FOPT")
    7565                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_FOPT")
    7566                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7567                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    7568              $C$DW$837       .dwtag  DW_TAG_member
    7569                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$23)
    7570                      .dwattr $C$DW$837, DW_AT_name("rsvd_1")
    7571                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_rsvd_1")
    7572                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7573                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    7574              $C$DW$838       .dwtag  DW_TAG_member
    7575                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$23)
    7576                      .dwattr $C$DW$838, DW_AT_name("FPWR")
    7577                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_FPWR")
    7578                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7579                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    7580              $C$DW$839       .dwtag  DW_TAG_member
    7581                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$23)
    7582                      .dwattr $C$DW$839, DW_AT_name("FSTATUS")
    7583                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_FSTATUS")
    7584                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7585                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    7586              $C$DW$840       .dwtag  DW_TAG_member
    7587                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$23)
    7588                      .dwattr $C$DW$840, DW_AT_name("FSTDBYWAIT")
    7589                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7590                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7591                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    7592              $C$DW$841       .dwtag  DW_TAG_member
    7593                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$23)
    7594                      .dwattr $C$DW$841, DW_AT_name("FACTIVEWAIT")
    7595                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    7596                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7597                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    7598              $C$DW$842       .dwtag  DW_TAG_member
    7599                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$23)
    7600                      .dwattr $C$DW$842, DW_AT_name("FBANKWAIT")
    7601                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_FBANKWAIT")
    7602                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7603                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    7604              $C$DW$843       .dwtag  DW_TAG_member
    7605                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$23)
    7606                      .dwattr $C$DW$843, DW_AT_name("FOTPWAIT")
    7607                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_FOTPWAIT")
    7608                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7609                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    7610                      .dwendtag $C$DW$T$82
    7611              
    7612              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  146

    7613                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$82)
    7614                      .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
    7615              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    7616                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    7617                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    7618              
    7619              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    7620                      .dwattr $C$DW$T$86, DW_AT_name("_GPIO_Obj_")
    7621                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x6a)
    7622              $C$DW$844       .dwtag  DW_TAG_member
    7623                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$83)
    7624                      .dwattr $C$DW$844, DW_AT_name("GPACTRL")
    7625                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_GPACTRL")
    7626                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7627                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    7628              $C$DW$845       .dwtag  DW_TAG_member
    7629                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$83)
    7630                      .dwattr $C$DW$845, DW_AT_name("GPAQSEL1")
    7631                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_GPAQSEL1")
    7632                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7633                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    7634              $C$DW$846       .dwtag  DW_TAG_member
    7635                      .dwattr $C$DW$846, DW_AT_type(*$C$DW$T$83)
    7636                      .dwattr $C$DW$846, DW_AT_name("GPAQSEL2")
    7637                      .dwattr $C$DW$846, DW_AT_TI_symbol_name("_GPAQSEL2")
    7638                      .dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7639                      .dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
    7640              $C$DW$847       .dwtag  DW_TAG_member
    7641                      .dwattr $C$DW$847, DW_AT_type(*$C$DW$T$83)
    7642                      .dwattr $C$DW$847, DW_AT_name("GPAMUX1")
    7643                      .dwattr $C$DW$847, DW_AT_TI_symbol_name("_GPAMUX1")
    7644                      .dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7645                      .dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
    7646              $C$DW$848       .dwtag  DW_TAG_member
    7647                      .dwattr $C$DW$848, DW_AT_type(*$C$DW$T$83)
    7648                      .dwattr $C$DW$848, DW_AT_name("GPAMUX2")
    7649                      .dwattr $C$DW$848, DW_AT_TI_symbol_name("_GPAMUX2")
    7650                      .dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7651                      .dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
    7652              $C$DW$849       .dwtag  DW_TAG_member
    7653                      .dwattr $C$DW$849, DW_AT_type(*$C$DW$T$83)
    7654                      .dwattr $C$DW$849, DW_AT_name("GPADIR")
    7655                      .dwattr $C$DW$849, DW_AT_TI_symbol_name("_GPADIR")
    7656                      .dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7657                      .dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
    7658              $C$DW$850       .dwtag  DW_TAG_member
    7659                      .dwattr $C$DW$850, DW_AT_type(*$C$DW$T$83)
    7660                      .dwattr $C$DW$850, DW_AT_name("GPAPUD")
    7661                      .dwattr $C$DW$850, DW_AT_TI_symbol_name("_GPAPUD")
    7662                      .dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7663                      .dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
    7664              $C$DW$851       .dwtag  DW_TAG_member
    7665                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$26)
    7666                      .dwattr $C$DW$851, DW_AT_name("rsvd_1")
    7667                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_rsvd_1")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0712811                            PAGE  147

    7668                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7669                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
    7670              $C$DW$852       .dwtag  DW_TAG_member
    7671                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$83)
    7672                      .dwattr $C$DW$852, DW_AT_name("GPBCTRL")
    7673                      .dwattr $C$DW$852, DW_AT_TI_symbol_name("_GPBCTRL")
    7674                      .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7675                      .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
    7676              $C$DW$853       .dwtag  DW_TAG_member
    7677                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$83)
    7678                      .dwattr $C$DW$853, DW_AT_name("GPBQSEL1")
    7679                      .dwattr $C$DW$853, DW_AT_TI_symbol_name("_GPBQSEL1")
    7680                      .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7681                      .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
    7682              $C$DW$854       .dwtag  DW_TAG_member
    7683                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$83)
    7684                      .dwattr $C$DW$854, DW_AT_name("GPBQSEL2")
    7685                      .dwattr $C$DW$854, DW_AT_TI_symbol_name("_GPBQSEL2")
    7686                      .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7687                      .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
    7688              $C$DW$855       .dwtag  DW_TAG_member
    7689                      .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$83)
    7690                      .dwattr $C$DW$855, DW_AT_name("GPBMUX1")
    7691                      .dwattr $C$DW$855, DW_AT_TI_symbol_name("_GPBMUX1")
    7692                      .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7693                      .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
    7694              $C$DW$856       .dwtag  DW_TAG_member
    7695                      .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$83)
    7696                      .dwattr $C$DW$856, DW_AT_name("GPBMUX2")
    7697                      .dwattr $C$DW$856, DW_AT_TI_symbol_name("_GPBMUX2")
    7698                      .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7699                      .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
    7700              $C$DW$857       .dwtag  DW_TAG_member
    7701                      .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$83)
    7702                      .dwattr $C$DW$857, DW_AT_name("GPBDIR")
    7703                      .dwattr $C$DW$857, DW_AT_TI_symbol_name("_GPBDIR")
    7704                      .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7705                      .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
    7706              $C$DW$858       .dwtag  DW_TAG_member
    7707                      .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$83)
    7708                      .dwattr $C$DW$858, DW_AT_name("GPBPUD")
    7709                      .dwattr $C$DW$858, DW_AT_TI_symbol_name("_GPBPUD")
    7710                      .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
