TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 10:29:37 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/drivers/drvic/drv8301/src/32b/f
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab20\Release")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3356              $C$DW$373       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_1_Word"), DW_AT_const_value(0x100)
    3357              $C$DW$374       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_2_Words"), DW_AT_const_value(0x200)
    3358              $C$DW$375       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_3_Words"), DW_AT_const_value(0x300)
    3359              $C$DW$376       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoStatus_4_Words"), DW_AT_const_value(0x400)
    3360                      .dwendtag $C$DW$T$97
    3361              
    3362              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FifoStatus_e")
    3363                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    3364                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    3365              $C$DW$377       .dwtag  DW_TAG_TI_far_type
    3366                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$98)
    3367              $C$DW$T$99      .dwtag  DW_TAG_volatile_type
    3368                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$377)
    3369              
    3370              $C$DW$T$103     .dwtag  DW_TAG_enumeration_type
    3371                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x01)
    3372              $C$DW$378       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_CtrlMode_Read"), DW_AT_const_value(-32768)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   65

    3373              $C$DW$379       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_CtrlMode_Write"), DW_AT_const_value(0x00)
    3374                      .dwendtag $C$DW$T$103
    3375              
    3376              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_CtrlMode_e")
    3377                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    3378                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3379              
    3380              $C$DW$T$106     .dwtag  DW_TAG_enumeration_type
    3381                      .dwattr $C$DW$T$106, DW_AT_byte_size(0x01)
    3382              $C$DW$380       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_RegName_Status_1"), DW_AT_const_value(0x00)
    3383              $C$DW$381       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_RegName_Status_2"), DW_AT_const_value(0x800)
    3384              $C$DW$382       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_RegName_Control_1"), DW_AT_const_value(0x1000)
    3385              $C$DW$383       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_RegName_Control_2"), DW_AT_const_value(0x1800)
    3386                      .dwendtag $C$DW$T$106
    3387              
    3388              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_RegName_e")
    3389                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    3390                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3391              $C$DW$384       .dwtag  DW_TAG_TI_far_type
    3392                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$107)
    3393              $C$DW$T$108     .dwtag  DW_TAG_const_type
    3394                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$384)
    3395              
    3396              $C$DW$T$109     .dwtag  DW_TAG_enumeration_type
    3397                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    3398              $C$DW$385       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_NoFault"), DW_AT_const_value(0x00)
    3399              $C$DW$386       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETLC_OC"), DW_AT_const_value(0x01)
    3400              $C$DW$387       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETHC_OC"), DW_AT_const_value(0x02)
    3401              $C$DW$388       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETLB_OC"), DW_AT_const_value(0x04)
    3402              $C$DW$389       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETHB_OC"), DW_AT_const_value(0x08)
    3403              $C$DW$390       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETLA_OC"), DW_AT_const_value(0x10)
    3404              $C$DW$391       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_FETHA_OC"), DW_AT_const_value(0x20)
    3405              $C$DW$392       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_OTW"), DW_AT_const_value(0x40)
    3406              $C$DW$393       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_OTSD"), DW_AT_const_value(0x80)
    3407              $C$DW$394       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_PVDD_UV"), DW_AT_const_value(0x100)
    3408              $C$DW$395       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_GVDD_UV"), DW_AT_const_value(0x200)
    3409              $C$DW$396       .dwtag  DW_TAG_enumerator, DW_AT_name("DRV8301_FaultType_GVDD_OV"), DW_AT_const_value(0x400)
    3410                      .dwendtag $C$DW$T$109
    3411              
    3412              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_FaultType_e")
    3413                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    3414                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3415              
    3416              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3417                      .dwattr $C$DW$T$26, DW_AT_name("_DRV8301_Obj_")
    3418                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    3419              $C$DW$397       .dwtag  DW_TAG_member
    3420                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    3421                      .dwattr $C$DW$397, DW_AT_name("spiHandle")
    3422                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_spiHandle")
    3423                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3424                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3425              $C$DW$398       .dwtag  DW_TAG_member
    3426                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$22)
    3427                      .dwattr $C$DW$398, DW_AT_name("gpioHandle")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   66

    3428                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_gpioHandle")
    3429                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3430                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3431              $C$DW$399       .dwtag  DW_TAG_member
    3432                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$24)
    3433                      .dwattr $C$DW$399, DW_AT_name("gpioNumber")
    3434                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_gpioNumber")
    3435                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3436                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3437              $C$DW$400       .dwtag  DW_TAG_member
    3438                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$25)
    3439                      .dwattr $C$DW$400, DW_AT_name("RxTimeOut")
    3440                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_RxTimeOut")
    3441                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3442                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3443              $C$DW$401       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$25)
    3445                      .dwattr $C$DW$401, DW_AT_name("enableTimeOut")
    3446                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_enableTimeOut")
    3447                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3448                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3449                      .dwendtag $C$DW$T$26
    3450              
    3451              $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    3452                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$26)
    3453                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3454              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    3455                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$26)
    3456                      .dwattr $C$DW$T$69, DW_AT_address_class(0x20)
    3457              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    3458                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    3459                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3460              $C$DW$402       .dwtag  DW_TAG_TI_far_type
    3461                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$70)
    3462              $C$DW$T$114     .dwtag  DW_TAG_const_type
    3463                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$402)
    3464              
    3465              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3466                      .dwattr $C$DW$T$37, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    3467                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x05)
    3468              $C$DW$403       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$28)
    3470                      .dwattr $C$DW$403, DW_AT_name("DRV8301_CURRENT")
    3471                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    3472                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3473                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3474              $C$DW$404       .dwtag  DW_TAG_member
    3475                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$30)
    3476                      .dwattr $C$DW$404, DW_AT_name("DRV8301_RESET")
    3477                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_DRV8301_RESET")
    3478                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3479                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3480              $C$DW$405       .dwtag  DW_TAG_member
    3481                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$32)
    3482                      .dwattr $C$DW$405, DW_AT_name("PWM_MODE")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   67

    3483                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_PWM_MODE")
    3484                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3485                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3486              $C$DW$406       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$34)
    3488                      .dwattr $C$DW$406, DW_AT_name("OC_MODE")
    3489                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_OC_MODE")
    3490                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3491                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3492              $C$DW$407       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$36)
    3494                      .dwattr $C$DW$407, DW_AT_name("OC_ADJ_SET")
    3495                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    3496                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3497                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3498                      .dwendtag $C$DW$T$37
    3499              
    3500              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    3501                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$37)
    3502                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3503              
    3504              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3505                      .dwattr $C$DW$T$46, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    3506                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    3507              $C$DW$408       .dwtag  DW_TAG_member
    3508                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$39)
    3509                      .dwattr $C$DW$408, DW_AT_name("OCTW_SET")
    3510                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_OCTW_SET")
    3511                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3512                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3513              $C$DW$409       .dwtag  DW_TAG_member
    3514                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$41)
    3515                      .dwattr $C$DW$409, DW_AT_name("GAIN")
    3516                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_GAIN")
    3517                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3518                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3519              $C$DW$410       .dwtag  DW_TAG_member
    3520                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$43)
    3521                      .dwattr $C$DW$410, DW_AT_name("DC_CAL_CH1p2")
    3522                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    3523                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3524                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3525              $C$DW$411       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$45)
    3527                      .dwattr $C$DW$411, DW_AT_name("OC_TOFF")
    3528                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_OC_TOFF")
    3529                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3530                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3531                      .dwendtag $C$DW$T$46
    3532              
    3533              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    3534                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$46)
    3535                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3536              
    3537              $C$DW$T$47      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   68

    3538                      .dwattr $C$DW$T$47, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    3539                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0b)
    3540              $C$DW$412       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$25)
    3542                      .dwattr $C$DW$412, DW_AT_name("FAULT")
    3543                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_FAULT")
    3544                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3545                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3546              $C$DW$413       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$25)
    3548                      .dwattr $C$DW$413, DW_AT_name("GVDD_UV")
    3549                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_GVDD_UV")
    3550                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3551                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3552              $C$DW$414       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$25)
    3554                      .dwattr $C$DW$414, DW_AT_name("PVDD_UV")
    3555                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_PVDD_UV")
    3556                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3557                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3558              $C$DW$415       .dwtag  DW_TAG_member
    3559                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$25)
    3560                      .dwattr $C$DW$415, DW_AT_name("OTSD")
    3561                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_OTSD")
    3562                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3563                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3564              $C$DW$416       .dwtag  DW_TAG_member
    3565                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$25)
    3566                      .dwattr $C$DW$416, DW_AT_name("OTW")
    3567                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_OTW")
    3568                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3569                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3570              $C$DW$417       .dwtag  DW_TAG_member
    3571                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$25)
    3572                      .dwattr $C$DW$417, DW_AT_name("FETHA_OC")
    3573                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_FETHA_OC")
    3574                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3575                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3576              $C$DW$418       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$25)
    3578                      .dwattr $C$DW$418, DW_AT_name("FETLA_OC")
    3579                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_FETLA_OC")
    3580                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3581                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3582              $C$DW$419       .dwtag  DW_TAG_member
    3583                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$25)
    3584                      .dwattr $C$DW$419, DW_AT_name("FETHB_OC")
    3585                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_FETHB_OC")
    3586                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3587                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3588              $C$DW$420       .dwtag  DW_TAG_member
    3589                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$25)
    3590                      .dwattr $C$DW$420, DW_AT_name("FETLB_OC")
    3591                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_FETLB_OC")
    3592                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   69

    3593                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3594              $C$DW$421       .dwtag  DW_TAG_member
    3595                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$25)
    3596                      .dwattr $C$DW$421, DW_AT_name("FETHC_OC")
    3597                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_FETHC_OC")
    3598                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3599                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3600              $C$DW$422       .dwtag  DW_TAG_member
    3601                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$25)
    3602                      .dwattr $C$DW$422, DW_AT_name("FETLC_OC")
    3603                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_FETLC_OC")
    3604                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3605                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3606                      .dwendtag $C$DW$T$47
    3607              
    3608              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    3609                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$47)
    3610                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3611              
    3612              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3613                      .dwattr $C$DW$T$49, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    3614                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3615              $C$DW$423       .dwtag  DW_TAG_member
    3616                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$25)
    3617                      .dwattr $C$DW$423, DW_AT_name("GVDD_OV")
    3618                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_GVDD_OV")
    3619                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3620                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3621              $C$DW$424       .dwtag  DW_TAG_member
    3622                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$48)
    3623                      .dwattr $C$DW$424, DW_AT_name("DeviceID")
    3624                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_DeviceID")
    3625                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3626                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3627                      .dwendtag $C$DW$T$49
    3628              
    3629              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    3630                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$49)
    3631                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3632              
    3633              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3634                      .dwattr $C$DW$T$54, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    3635                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x18)
    3636              $C$DW$425       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$50)
    3638                      .dwattr $C$DW$425, DW_AT_name("Stat_Reg_1")
    3639                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_Stat_Reg_1")
    3640                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3641                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3642              $C$DW$426       .dwtag  DW_TAG_member
    3643                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$51)
    3644                      .dwattr $C$DW$426, DW_AT_name("Stat_Reg_2")
    3645                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Stat_Reg_2")
    3646                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3647                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   70

    3648              $C$DW$427       .dwtag  DW_TAG_member
    3649                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$52)
    3650                      .dwattr $C$DW$427, DW_AT_name("Ctrl_Reg_1")
    3651                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    3652                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3653                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3654              $C$DW$428       .dwtag  DW_TAG_member
    3655                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$53)
    3656                      .dwattr $C$DW$428, DW_AT_name("Ctrl_Reg_2")
    3657                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    3658                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3659                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3660              $C$DW$429       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$25)
    3662                      .dwattr $C$DW$429, DW_AT_name("SndCmd")
    3663                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_SndCmd")
    3664                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3665                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3666              $C$DW$430       .dwtag  DW_TAG_member
    3667                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$25)
    3668                      .dwattr $C$DW$430, DW_AT_name("RcvCmd")
    3669                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_RcvCmd")
    3670                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3671                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3672                      .dwendtag $C$DW$T$54
    3673              
    3674              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
    3675                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$54)
    3676                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3677              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    3678                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    3679                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    3680              $C$DW$431       .dwtag  DW_TAG_TI_far_type
    3681                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$121)
    3682              $C$DW$T$122     .dwtag  DW_TAG_const_type
    3683                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$431)
    3684              
    3685              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    3686                      .dwattr $C$DW$T$64, DW_AT_name("_GPIO_Obj_")
    3687                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x6a)
    3688              $C$DW$432       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$56)
    3690                      .dwattr $C$DW$432, DW_AT_name("GPACTRL")
    3691                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_GPACTRL")
    3692                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3693                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3694              $C$DW$433       .dwtag  DW_TAG_member
    3695                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$56)
    3696                      .dwattr $C$DW$433, DW_AT_name("GPAQSEL1")
    3697                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_GPAQSEL1")
    3698                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3699                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3700              $C$DW$434       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$56)
    3702                      .dwattr $C$DW$434, DW_AT_name("GPAQSEL2")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   71

    3703                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_GPAQSEL2")
    3704                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3705                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3706              $C$DW$435       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$56)
    3708                      .dwattr $C$DW$435, DW_AT_name("GPAMUX1")
    3709                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_GPAMUX1")
    3710                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3711                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3712              $C$DW$436       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$56)
    3714                      .dwattr $C$DW$436, DW_AT_name("GPAMUX2")
    3715                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_GPAMUX2")
    3716                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3717                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3718              $C$DW$437       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$56)
    3720                      .dwattr $C$DW$437, DW_AT_name("GPADIR")
    3721                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_GPADIR")
    3722                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3723                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3724              $C$DW$438       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$56)
    3726                      .dwattr $C$DW$438, DW_AT_name("GPAPUD")
    3727                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_GPAPUD")
    3728                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3729                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3730              $C$DW$439       .dwtag  DW_TAG_member
    3731                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$58)
    3732                      .dwattr $C$DW$439, DW_AT_name("rsvd_1")
    3733                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_rsvd_1")
    3734                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3735                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3736              $C$DW$440       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$56)
    3738                      .dwattr $C$DW$440, DW_AT_name("GPBCTRL")
    3739                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_GPBCTRL")
    3740                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3741                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3742              $C$DW$441       .dwtag  DW_TAG_member
    3743                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$56)
    3744                      .dwattr $C$DW$441, DW_AT_name("GPBQSEL1")
    3745                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_GPBQSEL1")
    3746                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3747                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3748              $C$DW$442       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$56)
    3750                      .dwattr $C$DW$442, DW_AT_name("GPBQSEL2")
    3751                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_GPBQSEL2")
    3752                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3753                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3754              $C$DW$443       .dwtag  DW_TAG_member
    3755                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    3756                      .dwattr $C$DW$443, DW_AT_name("GPBMUX1")
    3757                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_GPBMUX1")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   72

    3758                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3759                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3760              $C$DW$444       .dwtag  DW_TAG_member
    3761                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$56)
    3762                      .dwattr $C$DW$444, DW_AT_name("GPBMUX2")
    3763                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_GPBMUX2")
    3764                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3765                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3766              $C$DW$445       .dwtag  DW_TAG_member
    3767                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$56)
    3768                      .dwattr $C$DW$445, DW_AT_name("GPBDIR")
    3769                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_GPBDIR")
    3770                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3771                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3772              $C$DW$446       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$56)
    3774                      .dwattr $C$DW$446, DW_AT_name("GPBPUD")
    3775                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_GPBPUD")
    3776                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3777                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3778              $C$DW$447       .dwtag  DW_TAG_member
    3779                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$59)
    3780                      .dwattr $C$DW$447, DW_AT_name("rsvd_4")
    3781                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_rsvd_4")
    3782                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3783                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3784              $C$DW$448       .dwtag  DW_TAG_member
    3785                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$56)
    3786                      .dwattr $C$DW$448, DW_AT_name("AIOMUX1")
    3787                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_AIOMUX1")
    3788                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3789                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3790              $C$DW$449       .dwtag  DW_TAG_member
    3791                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$58)
    3792                      .dwattr $C$DW$449, DW_AT_name("rsvd_5")
    3793                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_rsvd_5")
    3794                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3795                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3796              $C$DW$450       .dwtag  DW_TAG_member
    3797                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$56)
    3798                      .dwattr $C$DW$450, DW_AT_name("AIODIR")
    3799                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_AIODIR")
    3800                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3801                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3802              $C$DW$451       .dwtag  DW_TAG_member
    3803                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$60)
    3804                      .dwattr $C$DW$451, DW_AT_name("rsvd_6")
    3805                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_rsvd_6")
    3806                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3807                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3808              $C$DW$452       .dwtag  DW_TAG_member
    3809                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$56)
    3810                      .dwattr $C$DW$452, DW_AT_name("GPADAT")
    3811                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_GPADAT")
    3812                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   73

    3813                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3814              $C$DW$453       .dwtag  DW_TAG_member
    3815                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$56)
    3816                      .dwattr $C$DW$453, DW_AT_name("GPASET")
    3817                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_GPASET")
    3818                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3819                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3820              $C$DW$454       .dwtag  DW_TAG_member
    3821                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$56)
    3822                      .dwattr $C$DW$454, DW_AT_name("GPACLEAR")
    3823                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_GPACLEAR")
    3824                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3825                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3826              $C$DW$455       .dwtag  DW_TAG_member
    3827                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$56)
    3828                      .dwattr $C$DW$455, DW_AT_name("GPATOGGLE")
    3829                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_GPATOGGLE")
    3830                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3831                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3832              $C$DW$456       .dwtag  DW_TAG_member
    3833                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$56)
    3834                      .dwattr $C$DW$456, DW_AT_name("GPBDAT")
    3835                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_GPBDAT")
    3836                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3837                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3838              $C$DW$457       .dwtag  DW_TAG_member
    3839                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$56)
    3840                      .dwattr $C$DW$457, DW_AT_name("GPBSET")
    3841                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_GPBSET")
    3842                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    3843                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3844              $C$DW$458       .dwtag  DW_TAG_member
    3845                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$56)
    3846                      .dwattr $C$DW$458, DW_AT_name("GPBCLEAR")
    3847                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_GPBCLEAR")
    3848                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3849                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3850              $C$DW$459       .dwtag  DW_TAG_member
    3851                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$56)
    3852                      .dwattr $C$DW$459, DW_AT_name("GPBTOGGLE")
    3853                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_GPBTOGGLE")
    3854                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    3855                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3856              $C$DW$460       .dwtag  DW_TAG_member
    3857                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$61)
    3858                      .dwattr $C$DW$460, DW_AT_name("rsvd_7")
    3859                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_rsvd_7")
    3860                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3861                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3862              $C$DW$461       .dwtag  DW_TAG_member
    3863                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$56)
    3864                      .dwattr $C$DW$461, DW_AT_name("AIODAT")
    3865                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_AIODAT")
    3866                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3867                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   74

    3868              $C$DW$462       .dwtag  DW_TAG_member
    3869                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$56)
    3870                      .dwattr $C$DW$462, DW_AT_name("AIOSET")
    3871                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_AIOSET")
    3872                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    3873                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3874              $C$DW$463       .dwtag  DW_TAG_member
    3875                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$56)
    3876                      .dwattr $C$DW$463, DW_AT_name("AIOCLEAR")
    3877                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_AIOCLEAR")
    3878                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3879                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3880              $C$DW$464       .dwtag  DW_TAG_member
    3881                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$56)
    3882                      .dwattr $C$DW$464, DW_AT_name("AIOTOGGLE")
    3883                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_AIOTOGGLE")
    3884                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3885                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3886              $C$DW$465       .dwtag  DW_TAG_member
    3887                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$62)
    3888                      .dwattr $C$DW$465, DW_AT_name("GPIOXINTnSEL")
    3889                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    3890                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3891                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3892              $C$DW$466       .dwtag  DW_TAG_member
    3893                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$63)
    3894                      .dwattr $C$DW$466, DW_AT_name("rsvd_8")
    3895                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_rsvd_8")
    3896                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    3897                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3898              $C$DW$467       .dwtag  DW_TAG_member
    3899                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$56)
    3900                      .dwattr $C$DW$467, DW_AT_name("GPIOLPMSEL")
    3901                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    3902                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3903                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3904                      .dwendtag $C$DW$T$64
    3905              
    3906              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    3907                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$64)
    3908                      .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    3909              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    3910                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    3911                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3912              $C$DW$468       .dwtag  DW_TAG_TI_far_type
    3913                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$22)
    3914              $C$DW$T$125     .dwtag  DW_TAG_const_type
    3915                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$468)
    3916              
    3917              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3918                      .dwattr $C$DW$T$65, DW_AT_name("_SPI_Obj_")
    3919                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
    3920              $C$DW$469       .dwtag  DW_TAG_member
    3921                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$57)
    3922                      .dwattr $C$DW$469, DW_AT_name("SPICCR")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   75

    3923                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_SPICCR")
    3924                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3925                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3926              $C$DW$470       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$57)
    3928                      .dwattr $C$DW$470, DW_AT_name("SPICTL")
    3929                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_SPICTL")
    3930                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3931                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3932              $C$DW$471       .dwtag  DW_TAG_member
    3933                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$57)
    3934                      .dwattr $C$DW$471, DW_AT_name("SPIST")
    3935                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_SPIST")
    3936                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3937                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3938              $C$DW$472       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$57)
    3940                      .dwattr $C$DW$472, DW_AT_name("rsvd_1")
    3941                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_rsvd_1")
    3942                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3943                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3944              $C$DW$473       .dwtag  DW_TAG_member
    3945                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$57)
    3946                      .dwattr $C$DW$473, DW_AT_name("SPIBRR")
    3947                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_SPIBRR")
    3948                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3949                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3950              $C$DW$474       .dwtag  DW_TAG_member
    3951                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$57)
    3952                      .dwattr $C$DW$474, DW_AT_name("rsvd_2")
    3953                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_rsvd_2")
    3954                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3955                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3956              $C$DW$475       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$57)
    3958                      .dwattr $C$DW$475, DW_AT_name("SPIEMU")
    3959                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_SPIEMU")
    3960                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3961                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3962              $C$DW$476       .dwtag  DW_TAG_member
    3963                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$57)
    3964                      .dwattr $C$DW$476, DW_AT_name("SPIRXBUF")
    3965                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_SPIRXBUF")
    3966                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3967                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3968              $C$DW$477       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$57)
    3970                      .dwattr $C$DW$477, DW_AT_name("SPITXBUF")
    3971                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_SPITXBUF")
    3972                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3973                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3974              $C$DW$478       .dwtag  DW_TAG_member
    3975                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$57)
    3976                      .dwattr $C$DW$478, DW_AT_name("SPIDAT")
    3977                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_SPIDAT")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   76

    3978                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3979                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3980              $C$DW$479       .dwtag  DW_TAG_member
    3981                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$57)
    3982                      .dwattr $C$DW$479, DW_AT_name("SPIFFTX")
    3983                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_SPIFFTX")
    3984                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3985                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3986              $C$DW$480       .dwtag  DW_TAG_member
    3987                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$57)
    3988                      .dwattr $C$DW$480, DW_AT_name("SPIFFRX")
    3989                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_SPIFFRX")
    3990                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3991                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3992              $C$DW$481       .dwtag  DW_TAG_member
    3993                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$57)
    3994                      .dwattr $C$DW$481, DW_AT_name("SPIFFCT")
    3995                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_SPIFFCT")
    3996                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3997                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3998              $C$DW$482       .dwtag  DW_TAG_member
    3999                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$58)
    4000                      .dwattr $C$DW$482, DW_AT_name("rsvd_3")
    4001                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_rsvd_3")
    4002                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4003                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4004              $C$DW$483       .dwtag  DW_TAG_member
    4005                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$57)
    4006                      .dwattr $C$DW$483, DW_AT_name("SPIPRI")
    4007                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_SPIPRI")
    4008                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4009                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4010                      .dwendtag $C$DW$T$65
    4011              
    4012              $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Obj")
    4013                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$65)
    4014                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    4015              $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    4016                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$65)
    4017                      .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    4018              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Handle")
    4019                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4020                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4021              $C$DW$484       .dwtag  DW_TAG_TI_far_type
    4022                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
    4023              $C$DW$T$128     .dwtag  DW_TAG_const_type
    4024                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$484)
    4025              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4026                      .dwattr $C$DW$T$2, DW_AT_name("void")
    4027              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4028                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4029                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4030              $C$DW$485       .dwtag  DW_TAG_TI_far_type
    4031                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$3)
    4032              $C$DW$T$130     .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:37 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740010                            PAGE   77

    4033                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$485)
    4034              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4035                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4036                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4037                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4038              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4039                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4040                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4041                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4042              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4043                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4044                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4045                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4046              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4047                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4048                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4049                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4050              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4051                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4052                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4053                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4054              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4055                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4056                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4057                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    4058              $C$DW$T$10      .dwtag  DW_TAG_base_type
    4059                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
