TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:38 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0693210                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 10:29:38 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/drivers/gpio/src/32b/f28x/f2806
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab20\Release")
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.4\bin\opt2000.exe C:\\Users\\grant\\AppData\\Local\\Temp\

    1824              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_52_Mode_EQEP1S"), DW_AT_const_value(0x01)
    1825              $C$DW$363       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_52_Mode_MCLKXA"), DW_AT_const_value(0x02)
    1826              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_52_Mode_TZ3_NOT"), DW_AT_const_value(0x03)
    1827              $C$DW$365       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_53_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1828              $C$DW$366       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_53_Mode_EQEP1I"), DW_AT_const_value(0x01)
    1829              $C$DW$367       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_53_Mode_MFSXA"), DW_AT_const_value(0x02)
    1830              $C$DW$368       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_53_Mode_Rsvd_1"), DW_AT_const_value(0x03)
    1831              $C$DW$369       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_54_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1832              $C$DW$370       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_54_Mode_SPISIMOA"), DW_AT_const_value(0x01)
    1833              $C$DW$371       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_54_Mode_EQEP2A"), DW_AT_const_value(0x02)
    1834              $C$DW$372       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_54_Mode_HRCAP1"), DW_AT_const_value(0x03)
    1835              $C$DW$373       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_55_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1836              $C$DW$374       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_55_Mode_SPISOMIA"), DW_AT_const_value(0x01)
    1837              $C$DW$375       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_55_Mode_EQEP2B"), DW_AT_const_value(0x02)
    1838              $C$DW$376       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_55_Mode_HRCAP2"), DW_AT_const_value(0x03)
    1839              $C$DW$377       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_56_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1840              $C$DW$378       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_56_Mode_SPICLKA"), DW_AT_const_value(0x01)
    1841              $C$DW$379       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_56_Mode_EQEP2I"), DW_AT_const_value(0x02)
    1842              $C$DW$380       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_56_Mode_HRCAP3"), DW_AT_const_value(0x03)
    1843              $C$DW$381       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_57_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1844              $C$DW$382       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_57_Mode_SPISTEA_NOT"), DW_AT_const_value(0x01)
    1845              $C$DW$383       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_57_Mode_EQEP2S"), DW_AT_const_value(0x02)
    1846              $C$DW$384       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_57_Mode_HRCAP4"), DW_AT_const_value(0x03)
    1847              $C$DW$385       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_58_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1848              $C$DW$386       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_58_Mode_MCLKRA"), DW_AT_const_value(0x01)
    1849              $C$DW$387       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_58_Mode_SCITXDB"), DW_AT_const_value(0x02)
    1850              $C$DW$388       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_58_Mode_EPWM7A"), DW_AT_const_value(0x03)
    1851                      .dwendtag $C$DW$T$45
    1852              
    1853              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Mode_e")
    1854                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1855                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1856              $C$DW$389       .dwtag  DW_TAG_TI_far_type
    1857                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$46)
    1858              $C$DW$T$47      .dwtag  DW_TAG_const_type
    1859                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$389)
    1860              
    1861              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    1862                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1863              $C$DW$390       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sync"), DW_AT_const_value(0x00)
    1864              $C$DW$391       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_3"), DW_AT_const_value(0x01)
    1865              $C$DW$392       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_6"), DW_AT_const_value(0x02)
    1866              $C$DW$393       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_ASync"), DW_AT_const_value(0x03)
    1867                      .dwendtag $C$DW$T$48
    1868              
    1869              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Qual_e")
    1870                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1871                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1872              $C$DW$394       .dwtag  DW_TAG_TI_far_type
    1873                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$49)
    1874              $C$DW$T$50      .dwtag  DW_TAG_const_type
    1875                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$394)
    1876              
    1877              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1878                      .dwattr $C$DW$T$29, DW_AT_name("_GPIO_Obj_")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:38 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0693210                            PAGE   36

    1879                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6a)
    1880              $C$DW$395       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
    1882                      .dwattr $C$DW$395, DW_AT_name("GPACTRL")
    1883                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_GPACTRL")
    1884                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1885                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    1886              $C$DW$396       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    1888                      .dwattr $C$DW$396, DW_AT_name("GPAQSEL1")
    1889                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_GPAQSEL1")
    1890                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1891                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    1892              $C$DW$397       .dwtag  DW_TAG_member
    1893                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    1894                      .dwattr $C$DW$397, DW_AT_name("GPAQSEL2")
    1895                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_GPAQSEL2")
    1896                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1897                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    1898              $C$DW$398       .dwtag  DW_TAG_member
    1899                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    1900                      .dwattr $C$DW$398, DW_AT_name("GPAMUX1")
    1901                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_GPAMUX1")
    1902                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1903                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    1904              $C$DW$399       .dwtag  DW_TAG_member
    1905                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    1906                      .dwattr $C$DW$399, DW_AT_name("GPAMUX2")
    1907                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_GPAMUX2")
    1908                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1909                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    1910              $C$DW$400       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    1912                      .dwattr $C$DW$400, DW_AT_name("GPADIR")
    1913                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_GPADIR")
    1914                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1915                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    1916              $C$DW$401       .dwtag  DW_TAG_member
    1917                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    1918                      .dwattr $C$DW$401, DW_AT_name("GPAPUD")
    1919                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_GPAPUD")
    1920                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1921                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    1922              $C$DW$402       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$23)
    1924                      .dwattr $C$DW$402, DW_AT_name("rsvd_1")
    1925                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_rsvd_1")
    1926                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1927                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    1928              $C$DW$403       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$20)
    1930                      .dwattr $C$DW$403, DW_AT_name("GPBCTRL")
    1931                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_GPBCTRL")
    1932                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1933                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:38 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0693210                            PAGE   37

    1934              $C$DW$404       .dwtag  DW_TAG_member
    1935                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    1936                      .dwattr $C$DW$404, DW_AT_name("GPBQSEL1")
    1937                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_GPBQSEL1")
    1938                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1939                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    1940              $C$DW$405       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    1942                      .dwattr $C$DW$405, DW_AT_name("GPBQSEL2")
    1943                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_GPBQSEL2")
    1944                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1945                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    1946              $C$DW$406       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    1948                      .dwattr $C$DW$406, DW_AT_name("GPBMUX1")
    1949                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_GPBMUX1")
    1950                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1951                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    1952              $C$DW$407       .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    1954                      .dwattr $C$DW$407, DW_AT_name("GPBMUX2")
    1955                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_GPBMUX2")
    1956                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1957                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    1958              $C$DW$408       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    1960                      .dwattr $C$DW$408, DW_AT_name("GPBDIR")
    1961                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_GPBDIR")
    1962                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1963                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    1964              $C$DW$409       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    1966                      .dwattr $C$DW$409, DW_AT_name("GPBPUD")
    1967                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_GPBPUD")
    1968                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1969                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    1970              $C$DW$410       .dwtag  DW_TAG_member
    1971                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$24)
    1972                      .dwattr $C$DW$410, DW_AT_name("rsvd_4")
    1973                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_rsvd_4")
    1974                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1975                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    1976              $C$DW$411       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    1978                      .dwattr $C$DW$411, DW_AT_name("AIOMUX1")
    1979                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_AIOMUX1")
    1980                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1981                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    1982              $C$DW$412       .dwtag  DW_TAG_member
    1983                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$23)
    1984                      .dwattr $C$DW$412, DW_AT_name("rsvd_5")
    1985                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_rsvd_5")
    1986                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1987                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    1988              $C$DW$413       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:38 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0693210                            PAGE   38

    1989                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$20)
    1990                      .dwattr $C$DW$413, DW_AT_name("AIODIR")
    1991                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_AIODIR")
    1992                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1993                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    1994              $C$DW$414       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$25)
    1996                      .dwattr $C$DW$414, DW_AT_name("rsvd_6")
    1997                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_rsvd_6")
    1998                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1999                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    2000              $C$DW$415       .dwtag  DW_TAG_member
    2001                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    2002                      .dwattr $C$DW$415, DW_AT_name("GPADAT")
    2003                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_GPADAT")
    2004                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2005                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    2006              $C$DW$416       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    2008                      .dwattr $C$DW$416, DW_AT_name("GPASET")
    2009                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_GPASET")
    2010                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2011                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    2012              $C$DW$417       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    2014                      .dwattr $C$DW$417, DW_AT_name("GPACLEAR")
    2015                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_GPACLEAR")
    2016                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2017                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    2018              $C$DW$418       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    2020                      .dwattr $C$DW$418, DW_AT_name("GPATOGGLE")
    2021                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_GPATOGGLE")
    2022                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2023                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    2024              $C$DW$419       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    2026                      .dwattr $C$DW$419, DW_AT_name("GPBDAT")
    2027                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_GPBDAT")
    2028                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2029                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    2030              $C$DW$420       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    2032                      .dwattr $C$DW$420, DW_AT_name("GPBSET")
    2033                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_GPBSET")
    2034                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2035                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    2036              $C$DW$421       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    2038                      .dwattr $C$DW$421, DW_AT_name("GPBCLEAR")
    2039                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_GPBCLEAR")
    2040                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2041                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    2042              $C$DW$422       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:38 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0693210                            PAGE   39

    2044                      .dwattr $C$DW$422, DW_AT_name("GPBTOGGLE")
    2045                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_GPBTOGGLE")
    2046                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2047                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    2048              $C$DW$423       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$26)
    2050                      .dwattr $C$DW$423, DW_AT_name("rsvd_7")
    2051                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_rsvd_7")
    2052                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2053                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    2054              $C$DW$424       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    2056                      .dwattr $C$DW$424, DW_AT_name("AIODAT")
    2057                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_AIODAT")
    2058                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2059                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    2060              $C$DW$425       .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    2062                      .dwattr $C$DW$425, DW_AT_name("AIOSET")
    2063                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_AIOSET")
    2064                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2065                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    2066              $C$DW$426       .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    2068                      .dwattr $C$DW$426, DW_AT_name("AIOCLEAR")
    2069                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_AIOCLEAR")
    2070                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2071                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    2072              $C$DW$427       .dwtag  DW_TAG_member
    2073                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    2074                      .dwattr $C$DW$427, DW_AT_name("AIOTOGGLE")
    2075                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_AIOTOGGLE")
    2076                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2077                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    2078              $C$DW$428       .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$27)
    2080                      .dwattr $C$DW$428, DW_AT_name("GPIOXINTnSEL")
    2081                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    2082                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2083                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    2084              $C$DW$429       .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$28)
    2086                      .dwattr $C$DW$429, DW_AT_name("rsvd_8")
    2087                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_rsvd_8")
    2088                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2089                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    2090              $C$DW$430       .dwtag  DW_TAG_member
    2091                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    2092                      .dwattr $C$DW$430, DW_AT_name("GPIOLPMSEL")
    2093                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    2094                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2095                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    2096                      .dwendtag $C$DW$T$29
    2097              
    2098              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Obj")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:38 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0693210                            PAGE   40

    2099                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$29)
    2100                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2101              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2102                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
    2103                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    2104              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    2105                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2106                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2107              $C$DW$431       .dwtag  DW_TAG_TI_far_type
    2108                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$53)
    2109              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2110                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$431)
    2111              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2112                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2113              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2114                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2115                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2116              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2117                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2118                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2119                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2120              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2121                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2122                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2123                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2124              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2125                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2126                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2127                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2128              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2129                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2130                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2131                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2132              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2133                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2134                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2135                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2136              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2137                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2138                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2139                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2140              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2141                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2142                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2143                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2144              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2145                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
