TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 12:49:29 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab20\Release")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("PLL_enableClkDetect")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PLL_enableClkDetect")

   10541                      .dwattr $C$DW$T$308, DW_AT_type(*$C$DW$1948)
   10542              
   10543              $C$DW$T$309     .dwtag  DW_TAG_enumeration_type
   10544                      .dwattr $C$DW$T$309, DW_AT_byte_size(0x01)
   10545              $C$DW$1949      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputRisingEdge_InputFallingEdge"), D
   10546              $C$DW$1950      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputFallingEdge_InputRisingEdge"), D
   10547                      .dwendtag $C$DW$T$309
   10548              
   10549              $C$DW$T$310     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity_e")
   10550                      .dwattr $C$DW$T$310, DW_AT_type(*$C$DW$T$309)
   10551                      .dwattr $C$DW$T$310, DW_AT_language(DW_LANG_C)
   10552              $C$DW$1951      .dwtag  DW_TAG_TI_far_type
   10553                      .dwattr $C$DW$1951, DW_AT_type(*$C$DW$T$310)
   10554              $C$DW$T$311     .dwtag  DW_TAG_const_type
   10555                      .dwattr $C$DW$T$311, DW_AT_type(*$C$DW$1951)
   10556              
   10557              $C$DW$T$312     .dwtag  DW_TAG_enumeration_type
   10558                      .dwattr $C$DW$T$312, DW_AT_byte_size(0x01)
   10559              $C$DW$1952      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Slave"), DW_AT_const_value(0x00)
   10560              $C$DW$1953      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Master"), DW_AT_const_value(0x04)
   10561                      .dwendtag $C$DW$T$312
   10562              
   10563              $C$DW$T$313     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
   10564                      .dwattr $C$DW$T$313, DW_AT_type(*$C$DW$T$312)
   10565                      .dwattr $C$DW$T$313, DW_AT_language(DW_LANG_C)
   10566              $C$DW$1954      .dwtag  DW_TAG_TI_far_type
   10567                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$313)
   10568              $C$DW$T$314     .dwtag  DW_TAG_const_type
   10569                      .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$1954)
   10570              
   10571              $C$DW$T$315     .dwtag  DW_TAG_enumeration_type
   10572                      .dwattr $C$DW$T$315, DW_AT_byte_size(0x01)
   10573              $C$DW$1955      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
   10574              $C$DW$1956      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
   10575              $C$DW$1957      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
   10576                      .dwendtag $C$DW$T$315
   10577              
   10578              $C$DW$T$316     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
   10579                      .dwattr $C$DW$T$316, DW_AT_type(*$C$DW$T$315)
   10580                      .dwattr $C$DW$T$316, DW_AT_language(DW_LANG_C)
   10581              $C$DW$1958      .dwtag  DW_TAG_TI_far_type
   10582                      .dwattr $C$DW$1958, DW_AT_type(*$C$DW$T$316)
   10583              $C$DW$T$317     .dwtag  DW_TAG_const_type
   10584                      .dwattr $C$DW$T$317, DW_AT_type(*$C$DW$1958)
   10585              
   10586              $C$DW$T$318     .dwtag  DW_TAG_enumeration_type
   10587                      .dwattr $C$DW$T$318, DW_AT_byte_size(0x01)
   10588              $C$DW$1959      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement"), DW_AT_co
   10589              $C$DW$1960      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAtZero"), DW_AT_const_value(0x
   10590              $C$DW$1961      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_RunFree"), DW_AT_const_value(0x800
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  204

   10591                      .dwendtag $C$DW$T$318
   10592              
   10593              $C$DW$T$319     .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_EmulationMode_e")
   10594                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$T$318)
   10595                      .dwattr $C$DW$T$319, DW_AT_language(DW_LANG_C)
   10596              $C$DW$1962      .dwtag  DW_TAG_TI_far_type
   10597                      .dwattr $C$DW$1962, DW_AT_type(*$C$DW$T$319)
   10598              $C$DW$T$320     .dwtag  DW_TAG_const_type
   10599                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$1962)
   10600              
   10601              $C$DW$T$321     .dwtag  DW_TAG_enumeration_type
   10602                      .dwattr $C$DW$T$321, DW_AT_byte_size(0x01)
   10603              $C$DW$1963      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
   10604              $C$DW$1964      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
   10605                      .dwendtag $C$DW$T$321
   10606              
   10607              $C$DW$T$322     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
   10608                      .dwattr $C$DW$T$322, DW_AT_type(*$C$DW$T$321)
   10609                      .dwattr $C$DW$T$322, DW_AT_language(DW_LANG_C)
   10610              
   10611              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   10612                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
   10613                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
   10614              $C$DW$1965      .dwtag  DW_TAG_member
   10615                      .dwattr $C$DW$1965, DW_AT_type(*$C$DW$T$23)
   10616                      .dwattr $C$DW$1965, DW_AT_name("ADCRESULT")
   10617                      .dwattr $C$DW$1965, DW_AT_TI_symbol_name("_ADCRESULT")
   10618                      .dwattr $C$DW$1965, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10619                      .dwattr $C$DW$1965, DW_AT_accessibility(DW_ACCESS_public)
   10620              $C$DW$1966      .dwtag  DW_TAG_member
   10621                      .dwattr $C$DW$1966, DW_AT_type(*$C$DW$T$24)
   10622                      .dwattr $C$DW$1966, DW_AT_name("resvd_1")
   10623                      .dwattr $C$DW$1966, DW_AT_TI_symbol_name("_resvd_1")
   10624                      .dwattr $C$DW$1966, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10625                      .dwattr $C$DW$1966, DW_AT_accessibility(DW_ACCESS_public)
   10626              $C$DW$1967      .dwtag  DW_TAG_member
   10627                      .dwattr $C$DW$1967, DW_AT_type(*$C$DW$T$22)
   10628                      .dwattr $C$DW$1967, DW_AT_name("ADCCTL1")
   10629                      .dwattr $C$DW$1967, DW_AT_TI_symbol_name("_ADCCTL1")
   10630                      .dwattr $C$DW$1967, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   10631                      .dwattr $C$DW$1967, DW_AT_accessibility(DW_ACCESS_public)
   10632              $C$DW$1968      .dwtag  DW_TAG_member
   10633                      .dwattr $C$DW$1968, DW_AT_type(*$C$DW$T$22)
   10634                      .dwattr $C$DW$1968, DW_AT_name("ADCCTL2")
   10635                      .dwattr $C$DW$1968, DW_AT_TI_symbol_name("_ADCCTL2")
   10636                      .dwattr $C$DW$1968, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   10637                      .dwattr $C$DW$1968, DW_AT_accessibility(DW_ACCESS_public)
   10638              $C$DW$1969      .dwtag  DW_TAG_member
   10639                      .dwattr $C$DW$1969, DW_AT_type(*$C$DW$T$25)
   10640                      .dwattr $C$DW$1969, DW_AT_name("rsvd_2")
   10641                      .dwattr $C$DW$1969, DW_AT_TI_symbol_name("_rsvd_2")
   10642                      .dwattr $C$DW$1969, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   10643                      .dwattr $C$DW$1969, DW_AT_accessibility(DW_ACCESS_public)
   10644              $C$DW$1970      .dwtag  DW_TAG_member
   10645                      .dwattr $C$DW$1970, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  205

   10646                      .dwattr $C$DW$1970, DW_AT_name("ADCINTFLG")
   10647                      .dwattr $C$DW$1970, DW_AT_TI_symbol_name("_ADCINTFLG")
   10648                      .dwattr $C$DW$1970, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   10649                      .dwattr $C$DW$1970, DW_AT_accessibility(DW_ACCESS_public)
   10650              $C$DW$1971      .dwtag  DW_TAG_member
   10651                      .dwattr $C$DW$1971, DW_AT_type(*$C$DW$T$22)
   10652                      .dwattr $C$DW$1971, DW_AT_name("ADCINTFLGCLR")
   10653                      .dwattr $C$DW$1971, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   10654                      .dwattr $C$DW$1971, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   10655                      .dwattr $C$DW$1971, DW_AT_accessibility(DW_ACCESS_public)
   10656              $C$DW$1972      .dwtag  DW_TAG_member
   10657                      .dwattr $C$DW$1972, DW_AT_type(*$C$DW$T$22)
   10658                      .dwattr $C$DW$1972, DW_AT_name("ADCINTOVF")
   10659                      .dwattr $C$DW$1972, DW_AT_TI_symbol_name("_ADCINTOVF")
   10660                      .dwattr $C$DW$1972, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   10661                      .dwattr $C$DW$1972, DW_AT_accessibility(DW_ACCESS_public)
   10662              $C$DW$1973      .dwtag  DW_TAG_member
   10663                      .dwattr $C$DW$1973, DW_AT_type(*$C$DW$T$22)
   10664                      .dwattr $C$DW$1973, DW_AT_name("ADCINTOVFCLR")
   10665                      .dwattr $C$DW$1973, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   10666                      .dwattr $C$DW$1973, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   10667                      .dwattr $C$DW$1973, DW_AT_accessibility(DW_ACCESS_public)
   10668              $C$DW$1974      .dwtag  DW_TAG_member
   10669                      .dwattr $C$DW$1974, DW_AT_type(*$C$DW$T$26)
   10670                      .dwattr $C$DW$1974, DW_AT_name("INTSELxNy")
   10671                      .dwattr $C$DW$1974, DW_AT_TI_symbol_name("_INTSELxNy")
   10672                      .dwattr $C$DW$1974, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   10673                      .dwattr $C$DW$1974, DW_AT_accessibility(DW_ACCESS_public)
   10674              $C$DW$1975      .dwtag  DW_TAG_member
   10675                      .dwattr $C$DW$1975, DW_AT_type(*$C$DW$T$27)
   10676                      .dwattr $C$DW$1975, DW_AT_name("rsvd_3")
   10677                      .dwattr $C$DW$1975, DW_AT_TI_symbol_name("_rsvd_3")
   10678                      .dwattr $C$DW$1975, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   10679                      .dwattr $C$DW$1975, DW_AT_accessibility(DW_ACCESS_public)
   10680              $C$DW$1976      .dwtag  DW_TAG_member
   10681                      .dwattr $C$DW$1976, DW_AT_type(*$C$DW$T$22)
   10682                      .dwattr $C$DW$1976, DW_AT_name("SOCPRICTRL")
   10683                      .dwattr $C$DW$1976, DW_AT_TI_symbol_name("_SOCPRICTRL")
   10684                      .dwattr $C$DW$1976, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   10685                      .dwattr $C$DW$1976, DW_AT_accessibility(DW_ACCESS_public)
   10686              $C$DW$1977      .dwtag  DW_TAG_member
   10687                      .dwattr $C$DW$1977, DW_AT_type(*$C$DW$T$22)
   10688                      .dwattr $C$DW$1977, DW_AT_name("rsvd_4")
   10689                      .dwattr $C$DW$1977, DW_AT_TI_symbol_name("_rsvd_4")
   10690                      .dwattr $C$DW$1977, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   10691                      .dwattr $C$DW$1977, DW_AT_accessibility(DW_ACCESS_public)
   10692              $C$DW$1978      .dwtag  DW_TAG_member
   10693                      .dwattr $C$DW$1978, DW_AT_type(*$C$DW$T$22)
   10694                      .dwattr $C$DW$1978, DW_AT_name("ADCSAMPLEMODE")
   10695                      .dwattr $C$DW$1978, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   10696                      .dwattr $C$DW$1978, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   10697                      .dwattr $C$DW$1978, DW_AT_accessibility(DW_ACCESS_public)
   10698              $C$DW$1979      .dwtag  DW_TAG_member
   10699                      .dwattr $C$DW$1979, DW_AT_type(*$C$DW$T$22)
   10700                      .dwattr $C$DW$1979, DW_AT_name("rsvd_5")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  206

   10701                      .dwattr $C$DW$1979, DW_AT_TI_symbol_name("_rsvd_5")
   10702                      .dwattr $C$DW$1979, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   10703                      .dwattr $C$DW$1979, DW_AT_accessibility(DW_ACCESS_public)
   10704              $C$DW$1980      .dwtag  DW_TAG_member
   10705                      .dwattr $C$DW$1980, DW_AT_type(*$C$DW$T$22)
   10706                      .dwattr $C$DW$1980, DW_AT_name("ADCINTSOCSEL1")
   10707                      .dwattr $C$DW$1980, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   10708                      .dwattr $C$DW$1980, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   10709                      .dwattr $C$DW$1980, DW_AT_accessibility(DW_ACCESS_public)
   10710              $C$DW$1981      .dwtag  DW_TAG_member
   10711                      .dwattr $C$DW$1981, DW_AT_type(*$C$DW$T$22)
   10712                      .dwattr $C$DW$1981, DW_AT_name("ADCINTSOCSEL2")
   10713                      .dwattr $C$DW$1981, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   10714                      .dwattr $C$DW$1981, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   10715                      .dwattr $C$DW$1981, DW_AT_accessibility(DW_ACCESS_public)
   10716              $C$DW$1982      .dwtag  DW_TAG_member
   10717                      .dwattr $C$DW$1982, DW_AT_type(*$C$DW$T$25)
   10718                      .dwattr $C$DW$1982, DW_AT_name("rsvd_6")
   10719                      .dwattr $C$DW$1982, DW_AT_TI_symbol_name("_rsvd_6")
   10720                      .dwattr $C$DW$1982, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   10721                      .dwattr $C$DW$1982, DW_AT_accessibility(DW_ACCESS_public)
   10722              $C$DW$1983      .dwtag  DW_TAG_member
   10723                      .dwattr $C$DW$1983, DW_AT_type(*$C$DW$T$22)
   10724                      .dwattr $C$DW$1983, DW_AT_name("ADCSOCFLG1")
   10725                      .dwattr $C$DW$1983, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   10726                      .dwattr $C$DW$1983, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   10727                      .dwattr $C$DW$1983, DW_AT_accessibility(DW_ACCESS_public)
   10728              $C$DW$1984      .dwtag  DW_TAG_member
   10729                      .dwattr $C$DW$1984, DW_AT_type(*$C$DW$T$22)
   10730                      .dwattr $C$DW$1984, DW_AT_name("rsvd_7")
   10731                      .dwattr $C$DW$1984, DW_AT_TI_symbol_name("_rsvd_7")
   10732                      .dwattr $C$DW$1984, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10733                      .dwattr $C$DW$1984, DW_AT_accessibility(DW_ACCESS_public)
   10734              $C$DW$1985      .dwtag  DW_TAG_member
   10735                      .dwattr $C$DW$1985, DW_AT_type(*$C$DW$T$22)
   10736                      .dwattr $C$DW$1985, DW_AT_name("ADCSOCFRC1")
   10737                      .dwattr $C$DW$1985, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   10738                      .dwattr $C$DW$1985, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   10739                      .dwattr $C$DW$1985, DW_AT_accessibility(DW_ACCESS_public)
   10740              $C$DW$1986      .dwtag  DW_TAG_member
   10741                      .dwattr $C$DW$1986, DW_AT_type(*$C$DW$T$22)
   10742                      .dwattr $C$DW$1986, DW_AT_name("rsvd_8")
   10743                      .dwattr $C$DW$1986, DW_AT_TI_symbol_name("_rsvd_8")
   10744                      .dwattr $C$DW$1986, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   10745                      .dwattr $C$DW$1986, DW_AT_accessibility(DW_ACCESS_public)
   10746              $C$DW$1987      .dwtag  DW_TAG_member
   10747                      .dwattr $C$DW$1987, DW_AT_type(*$C$DW$T$22)
   10748                      .dwattr $C$DW$1987, DW_AT_name("ADCSOCOVF1")
   10749                      .dwattr $C$DW$1987, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   10750                      .dwattr $C$DW$1987, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   10751                      .dwattr $C$DW$1987, DW_AT_accessibility(DW_ACCESS_public)
   10752              $C$DW$1988      .dwtag  DW_TAG_member
   10753                      .dwattr $C$DW$1988, DW_AT_type(*$C$DW$T$22)
   10754                      .dwattr $C$DW$1988, DW_AT_name("rsvd_9")
   10755                      .dwattr $C$DW$1988, DW_AT_TI_symbol_name("_rsvd_9")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  207

   10756                      .dwattr $C$DW$1988, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   10757                      .dwattr $C$DW$1988, DW_AT_accessibility(DW_ACCESS_public)
   10758              $C$DW$1989      .dwtag  DW_TAG_member
   10759                      .dwattr $C$DW$1989, DW_AT_type(*$C$DW$T$22)
   10760                      .dwattr $C$DW$1989, DW_AT_name("ADCSOCOVFCLR1")
   10761                      .dwattr $C$DW$1989, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   10762                      .dwattr $C$DW$1989, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   10763                      .dwattr $C$DW$1989, DW_AT_accessibility(DW_ACCESS_public)
   10764              $C$DW$1990      .dwtag  DW_TAG_member
   10765                      .dwattr $C$DW$1990, DW_AT_type(*$C$DW$T$22)
   10766                      .dwattr $C$DW$1990, DW_AT_name("rsvd_10")
   10767                      .dwattr $C$DW$1990, DW_AT_TI_symbol_name("_rsvd_10")
   10768                      .dwattr $C$DW$1990, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   10769                      .dwattr $C$DW$1990, DW_AT_accessibility(DW_ACCESS_public)
   10770              $C$DW$1991      .dwtag  DW_TAG_member
   10771                      .dwattr $C$DW$1991, DW_AT_type(*$C$DW$T$23)
   10772                      .dwattr $C$DW$1991, DW_AT_name("ADCSOCxCTL")
   10773                      .dwattr $C$DW$1991, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   10774                      .dwattr $C$DW$1991, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   10775                      .dwattr $C$DW$1991, DW_AT_accessibility(DW_ACCESS_public)
   10776              $C$DW$1992      .dwtag  DW_TAG_member
   10777                      .dwattr $C$DW$1992, DW_AT_type(*$C$DW$T$23)
   10778                      .dwattr $C$DW$1992, DW_AT_name("rsvd_11")
   10779                      .dwattr $C$DW$1992, DW_AT_TI_symbol_name("_rsvd_11")
   10780                      .dwattr $C$DW$1992, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   10781                      .dwattr $C$DW$1992, DW_AT_accessibility(DW_ACCESS_public)
   10782              $C$DW$1993      .dwtag  DW_TAG_member
   10783                      .dwattr $C$DW$1993, DW_AT_type(*$C$DW$T$22)
   10784                      .dwattr $C$DW$1993, DW_AT_name("ADCREFTRIM")
   10785                      .dwattr $C$DW$1993, DW_AT_TI_symbol_name("_ADCREFTRIM")
   10786                      .dwattr $C$DW$1993, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   10787                      .dwattr $C$DW$1993, DW_AT_accessibility(DW_ACCESS_public)
   10788              $C$DW$1994      .dwtag  DW_TAG_member
   10789                      .dwattr $C$DW$1994, DW_AT_type(*$C$DW$T$22)
   10790                      .dwattr $C$DW$1994, DW_AT_name("ADCOFFTRIM")
   10791                      .dwattr $C$DW$1994, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   10792                      .dwattr $C$DW$1994, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   10793                      .dwattr $C$DW$1994, DW_AT_accessibility(DW_ACCESS_public)
   10794              $C$DW$1995      .dwtag  DW_TAG_member
   10795                      .dwattr $C$DW$1995, DW_AT_type(*$C$DW$T$28)
   10796                      .dwattr $C$DW$1995, DW_AT_name("resvd_12")
   10797                      .dwattr $C$DW$1995, DW_AT_TI_symbol_name("_resvd_12")
   10798                      .dwattr $C$DW$1995, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   10799                      .dwattr $C$DW$1995, DW_AT_accessibility(DW_ACCESS_public)
   10800              $C$DW$1996      .dwtag  DW_TAG_member
   10801                      .dwattr $C$DW$1996, DW_AT_type(*$C$DW$T$22)
   10802                      .dwattr $C$DW$1996, DW_AT_name("ADCREV")
   10803                      .dwattr $C$DW$1996, DW_AT_TI_symbol_name("_ADCREV")
   10804                      .dwattr $C$DW$1996, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   10805                      .dwattr $C$DW$1996, DW_AT_accessibility(DW_ACCESS_public)
   10806                      .dwendtag $C$DW$T$29
   10807              
   10808              $C$DW$T$324     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   10809                      .dwattr $C$DW$T$324, DW_AT_type(*$C$DW$T$29)
   10810                      .dwattr $C$DW$T$324, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  208

   10811              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   10812                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$29)
   10813                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
   10814              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   10815                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   10816                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   10817              
   10818              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   10819                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
   10820                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
   10821              $C$DW$1997      .dwtag  DW_TAG_member
   10822                      .dwattr $C$DW$1997, DW_AT_type(*$C$DW$T$22)
   10823                      .dwattr $C$DW$1997, DW_AT_name("XCLK")
   10824                      .dwattr $C$DW$1997, DW_AT_TI_symbol_name("_XCLK")
   10825                      .dwattr $C$DW$1997, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10826                      .dwattr $C$DW$1997, DW_AT_accessibility(DW_ACCESS_public)
   10827              $C$DW$1998      .dwtag  DW_TAG_member
   10828                      .dwattr $C$DW$1998, DW_AT_type(*$C$DW$T$22)
   10829                      .dwattr $C$DW$1998, DW_AT_name("rsvd_1")
   10830                      .dwattr $C$DW$1998, DW_AT_TI_symbol_name("_rsvd_1")
   10831                      .dwattr $C$DW$1998, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10832                      .dwattr $C$DW$1998, DW_AT_accessibility(DW_ACCESS_public)
   10833              $C$DW$1999      .dwtag  DW_TAG_member
   10834                      .dwattr $C$DW$1999, DW_AT_type(*$C$DW$T$22)
   10835                      .dwattr $C$DW$1999, DW_AT_name("CLKCTL")
   10836                      .dwattr $C$DW$1999, DW_AT_TI_symbol_name("_CLKCTL")
   10837                      .dwattr $C$DW$1999, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10838                      .dwattr $C$DW$1999, DW_AT_accessibility(DW_ACCESS_public)
   10839              $C$DW$2000      .dwtag  DW_TAG_member
   10840                      .dwattr $C$DW$2000, DW_AT_type(*$C$DW$T$30)
   10841                      .dwattr $C$DW$2000, DW_AT_name("rsvd_2")
   10842                      .dwattr $C$DW$2000, DW_AT_TI_symbol_name("_rsvd_2")
   10843                      .dwattr $C$DW$2000, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10844                      .dwattr $C$DW$2000, DW_AT_accessibility(DW_ACCESS_public)
   10845              $C$DW$2001      .dwtag  DW_TAG_member
   10846                      .dwattr $C$DW$2001, DW_AT_type(*$C$DW$T$22)
   10847                      .dwattr $C$DW$2001, DW_AT_name("LOSPCP")
   10848                      .dwattr $C$DW$2001, DW_AT_TI_symbol_name("_LOSPCP")
   10849                      .dwattr $C$DW$2001, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10850                      .dwattr $C$DW$2001, DW_AT_accessibility(DW_ACCESS_public)
   10851              $C$DW$2002      .dwtag  DW_TAG_member
   10852                      .dwattr $C$DW$2002, DW_AT_type(*$C$DW$T$22)
   10853                      .dwattr $C$DW$2002, DW_AT_name("PCLKCR0")
   10854                      .dwattr $C$DW$2002, DW_AT_TI_symbol_name("_PCLKCR0")
   10855                      .dwattr $C$DW$2002, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10856                      .dwattr $C$DW$2002, DW_AT_accessibility(DW_ACCESS_public)
   10857              $C$DW$2003      .dwtag  DW_TAG_member
   10858                      .dwattr $C$DW$2003, DW_AT_type(*$C$DW$T$22)
   10859                      .dwattr $C$DW$2003, DW_AT_name("PCLKCR1")
   10860                      .dwattr $C$DW$2003, DW_AT_TI_symbol_name("_PCLKCR1")
   10861                      .dwattr $C$DW$2003, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10862                      .dwattr $C$DW$2003, DW_AT_accessibility(DW_ACCESS_public)
   10863              $C$DW$2004      .dwtag  DW_TAG_member
   10864                      .dwattr $C$DW$2004, DW_AT_type(*$C$DW$T$25)
   10865                      .dwattr $C$DW$2004, DW_AT_name("rsvd_3")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  209

   10866                      .dwattr $C$DW$2004, DW_AT_TI_symbol_name("_rsvd_3")
   10867                      .dwattr $C$DW$2004, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10868                      .dwattr $C$DW$2004, DW_AT_accessibility(DW_ACCESS_public)
   10869              $C$DW$2005      .dwtag  DW_TAG_member
   10870                      .dwattr $C$DW$2005, DW_AT_type(*$C$DW$T$22)
   10871                      .dwattr $C$DW$2005, DW_AT_name("PCLKCR3")
   10872                      .dwattr $C$DW$2005, DW_AT_TI_symbol_name("_PCLKCR3")
   10873                      .dwattr $C$DW$2005, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10874                      .dwattr $C$DW$2005, DW_AT_accessibility(DW_ACCESS_public)
   10875                      .dwendtag $C$DW$T$31
   10876              
   10877              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
   10878                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$31)
   10879                      .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
   10880              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   10881                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
   10882                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   10883              
   10884              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   10885                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
   10886                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   10887              $C$DW$2006      .dwtag  DW_TAG_member
   10888                      .dwattr $C$DW$2006, DW_AT_type(*$C$DW$T$32)
   10889                      .dwattr $C$DW$2006, DW_AT_name("tmp")
   10890                      .dwattr $C$DW$2006, DW_AT_TI_symbol_name("_tmp")
   10891                      .dwattr $C$DW$2006, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10892                      .dwattr $C$DW$2006, DW_AT_accessibility(DW_ACCESS_public)
   10893                      .dwendtag $C$DW$T$33
   10894              
   10895              $C$DW$T$333     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   10896                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$33)
   10897                      .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
   10898              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
   10899                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
   10900                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
   10901              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   10902                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   10903                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
   10904              
   10905              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   10906                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8301_Obj_")
   10907                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
   10908              $C$DW$2007      .dwtag  DW_TAG_member
   10909                      .dwattr $C$DW$2007, DW_AT_type(*$C$DW$T$35)
   10910                      .dwattr $C$DW$2007, DW_AT_name("spiHandle")
   10911                      .dwattr $C$DW$2007, DW_AT_TI_symbol_name("_spiHandle")
   10912                      .dwattr $C$DW$2007, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10913                      .dwattr $C$DW$2007, DW_AT_accessibility(DW_ACCESS_public)
   10914              $C$DW$2008      .dwtag  DW_TAG_member
   10915                      .dwattr $C$DW$2008, DW_AT_type(*$C$DW$T$37)
   10916                      .dwattr $C$DW$2008, DW_AT_name("gpioHandle")
   10917                      .dwattr $C$DW$2008, DW_AT_TI_symbol_name("_gpioHandle")
   10918                      .dwattr $C$DW$2008, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10919                      .dwattr $C$DW$2008, DW_AT_accessibility(DW_ACCESS_public)
   10920              $C$DW$2009      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  210

   10921                      .dwattr $C$DW$2009, DW_AT_type(*$C$DW$T$39)
   10922                      .dwattr $C$DW$2009, DW_AT_name("gpioNumber")
   10923                      .dwattr $C$DW$2009, DW_AT_TI_symbol_name("_gpioNumber")
   10924                      .dwattr $C$DW$2009, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10925                      .dwattr $C$DW$2009, DW_AT_accessibility(DW_ACCESS_public)
   10926              $C$DW$2010      .dwtag  DW_TAG_member
   10927                      .dwattr $C$DW$2010, DW_AT_type(*$C$DW$T$40)
   10928                      .dwattr $C$DW$2010, DW_AT_name("RxTimeOut")
   10929                      .dwattr $C$DW$2010, DW_AT_TI_symbol_name("_RxTimeOut")
   10930                      .dwattr $C$DW$2010, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10931                      .dwattr $C$DW$2010, DW_AT_accessibility(DW_ACCESS_public)
   10932              $C$DW$2011      .dwtag  DW_TAG_member
   10933                      .dwattr $C$DW$2011, DW_AT_type(*$C$DW$T$40)
   10934                      .dwattr $C$DW$2011, DW_AT_name("enableTimeOut")
   10935                      .dwattr $C$DW$2011, DW_AT_TI_symbol_name("_enableTimeOut")
   10936                      .dwattr $C$DW$2011, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10937                      .dwattr $C$DW$2011, DW_AT_accessibility(DW_ACCESS_public)
   10938                      .dwendtag $C$DW$T$41
   10939              
   10940              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
   10941                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$41)
   10942                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
   10943              $C$DW$T$110     .dwtag  DW_TAG_pointer_type
   10944                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$41)
   10945                      .dwattr $C$DW$T$110, DW_AT_address_class(0x20)
   10946              $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
   10947                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
   10948                      .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
   10949              
   10950              $C$DW$T$52      .dwtag  DW_TAG_structure_type
   10951                      .dwattr $C$DW$T$52, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   10952                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
   10953              $C$DW$2012      .dwtag  DW_TAG_member
   10954                      .dwattr $C$DW$2012, DW_AT_type(*$C$DW$T$43)
   10955                      .dwattr $C$DW$2012, DW_AT_name("DRV8301_CURRENT")
   10956                      .dwattr $C$DW$2012, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   10957                      .dwattr $C$DW$2012, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10958                      .dwattr $C$DW$2012, DW_AT_accessibility(DW_ACCESS_public)
   10959              $C$DW$2013      .dwtag  DW_TAG_member
   10960                      .dwattr $C$DW$2013, DW_AT_type(*$C$DW$T$45)
   10961                      .dwattr $C$DW$2013, DW_AT_name("DRV8301_RESET")
   10962                      .dwattr $C$DW$2013, DW_AT_TI_symbol_name("_DRV8301_RESET")
   10963                      .dwattr $C$DW$2013, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10964                      .dwattr $C$DW$2013, DW_AT_accessibility(DW_ACCESS_public)
   10965              $C$DW$2014      .dwtag  DW_TAG_member
   10966                      .dwattr $C$DW$2014, DW_AT_type(*$C$DW$T$47)
   10967                      .dwattr $C$DW$2014, DW_AT_name("PWM_MODE")
   10968                      .dwattr $C$DW$2014, DW_AT_TI_symbol_name("_PWM_MODE")
   10969                      .dwattr $C$DW$2014, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10970                      .dwattr $C$DW$2014, DW_AT_accessibility(DW_ACCESS_public)
   10971              $C$DW$2015      .dwtag  DW_TAG_member
   10972                      .dwattr $C$DW$2015, DW_AT_type(*$C$DW$T$49)
   10973                      .dwattr $C$DW$2015, DW_AT_name("OC_MODE")
   10974                      .dwattr $C$DW$2015, DW_AT_TI_symbol_name("_OC_MODE")
   10975                      .dwattr $C$DW$2015, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  211

   10976                      .dwattr $C$DW$2015, DW_AT_accessibility(DW_ACCESS_public)
   10977              $C$DW$2016      .dwtag  DW_TAG_member
   10978                      .dwattr $C$DW$2016, DW_AT_type(*$C$DW$T$51)
   10979                      .dwattr $C$DW$2016, DW_AT_name("OC_ADJ_SET")
   10980                      .dwattr $C$DW$2016, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   10981                      .dwattr $C$DW$2016, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10982                      .dwattr $C$DW$2016, DW_AT_accessibility(DW_ACCESS_public)
   10983                      .dwendtag $C$DW$T$52
   10984              
   10985              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   10986                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$52)
   10987                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   10988              
   10989              $C$DW$T$61      .dwtag  DW_TAG_structure_type
   10990                      .dwattr $C$DW$T$61, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   10991                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
   10992              $C$DW$2017      .dwtag  DW_TAG_member
   10993                      .dwattr $C$DW$2017, DW_AT_type(*$C$DW$T$54)
   10994                      .dwattr $C$DW$2017, DW_AT_name("OCTW_SET")
   10995                      .dwattr $C$DW$2017, DW_AT_TI_symbol_name("_OCTW_SET")
   10996                      .dwattr $C$DW$2017, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10997                      .dwattr $C$DW$2017, DW_AT_accessibility(DW_ACCESS_public)
   10998              $C$DW$2018      .dwtag  DW_TAG_member
   10999                      .dwattr $C$DW$2018, DW_AT_type(*$C$DW$T$56)
   11000                      .dwattr $C$DW$2018, DW_AT_name("GAIN")
   11001                      .dwattr $C$DW$2018, DW_AT_TI_symbol_name("_GAIN")
   11002                      .dwattr $C$DW$2018, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11003                      .dwattr $C$DW$2018, DW_AT_accessibility(DW_ACCESS_public)
   11004              $C$DW$2019      .dwtag  DW_TAG_member
   11005                      .dwattr $C$DW$2019, DW_AT_type(*$C$DW$T$58)
   11006                      .dwattr $C$DW$2019, DW_AT_name("DC_CAL_CH1p2")
   11007                      .dwattr $C$DW$2019, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   11008                      .dwattr $C$DW$2019, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11009                      .dwattr $C$DW$2019, DW_AT_accessibility(DW_ACCESS_public)
   11010              $C$DW$2020      .dwtag  DW_TAG_member
   11011                      .dwattr $C$DW$2020, DW_AT_type(*$C$DW$T$60)
   11012                      .dwattr $C$DW$2020, DW_AT_name("OC_TOFF")
   11013                      .dwattr $C$DW$2020, DW_AT_TI_symbol_name("_OC_TOFF")
   11014                      .dwattr $C$DW$2020, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11015                      .dwattr $C$DW$2020, DW_AT_accessibility(DW_ACCESS_public)
   11016                      .dwendtag $C$DW$T$61
   11017              
   11018              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   11019                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$61)
   11020                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   11021              
   11022              $C$DW$T$62      .dwtag  DW_TAG_structure_type
   11023                      .dwattr $C$DW$T$62, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   11024                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x0b)
   11025              $C$DW$2021      .dwtag  DW_TAG_member
   11026                      .dwattr $C$DW$2021, DW_AT_type(*$C$DW$T$40)
   11027                      .dwattr $C$DW$2021, DW_AT_name("FAULT")
   11028                      .dwattr $C$DW$2021, DW_AT_TI_symbol_name("_FAULT")
   11029                      .dwattr $C$DW$2021, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11030                      .dwattr $C$DW$2021, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  212

   11031              $C$DW$2022      .dwtag  DW_TAG_member
   11032                      .dwattr $C$DW$2022, DW_AT_type(*$C$DW$T$40)
   11033                      .dwattr $C$DW$2022, DW_AT_name("GVDD_UV")
   11034                      .dwattr $C$DW$2022, DW_AT_TI_symbol_name("_GVDD_UV")
   11035                      .dwattr $C$DW$2022, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11036                      .dwattr $C$DW$2022, DW_AT_accessibility(DW_ACCESS_public)
   11037              $C$DW$2023      .dwtag  DW_TAG_member
   11038                      .dwattr $C$DW$2023, DW_AT_type(*$C$DW$T$40)
   11039                      .dwattr $C$DW$2023, DW_AT_name("PVDD_UV")
   11040                      .dwattr $C$DW$2023, DW_AT_TI_symbol_name("_PVDD_UV")
   11041                      .dwattr $C$DW$2023, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11042                      .dwattr $C$DW$2023, DW_AT_accessibility(DW_ACCESS_public)
   11043              $C$DW$2024      .dwtag  DW_TAG_member
   11044                      .dwattr $C$DW$2024, DW_AT_type(*$C$DW$T$40)
   11045                      .dwattr $C$DW$2024, DW_AT_name("OTSD")
   11046                      .dwattr $C$DW$2024, DW_AT_TI_symbol_name("_OTSD")
   11047                      .dwattr $C$DW$2024, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11048                      .dwattr $C$DW$2024, DW_AT_accessibility(DW_ACCESS_public)
   11049              $C$DW$2025      .dwtag  DW_TAG_member
   11050                      .dwattr $C$DW$2025, DW_AT_type(*$C$DW$T$40)
   11051                      .dwattr $C$DW$2025, DW_AT_name("OTW")
   11052                      .dwattr $C$DW$2025, DW_AT_TI_symbol_name("_OTW")
   11053                      .dwattr $C$DW$2025, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11054                      .dwattr $C$DW$2025, DW_AT_accessibility(DW_ACCESS_public)
   11055              $C$DW$2026      .dwtag  DW_TAG_member
   11056                      .dwattr $C$DW$2026, DW_AT_type(*$C$DW$T$40)
   11057                      .dwattr $C$DW$2026, DW_AT_name("FETHA_OC")
   11058                      .dwattr $C$DW$2026, DW_AT_TI_symbol_name("_FETHA_OC")
   11059                      .dwattr $C$DW$2026, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11060                      .dwattr $C$DW$2026, DW_AT_accessibility(DW_ACCESS_public)
   11061              $C$DW$2027      .dwtag  DW_TAG_member
   11062                      .dwattr $C$DW$2027, DW_AT_type(*$C$DW$T$40)
   11063                      .dwattr $C$DW$2027, DW_AT_name("FETLA_OC")
   11064                      .dwattr $C$DW$2027, DW_AT_TI_symbol_name("_FETLA_OC")
   11065                      .dwattr $C$DW$2027, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11066                      .dwattr $C$DW$2027, DW_AT_accessibility(DW_ACCESS_public)
   11067              $C$DW$2028      .dwtag  DW_TAG_member
   11068                      .dwattr $C$DW$2028, DW_AT_type(*$C$DW$T$40)
   11069                      .dwattr $C$DW$2028, DW_AT_name("FETHB_OC")
   11070                      .dwattr $C$DW$2028, DW_AT_TI_symbol_name("_FETHB_OC")
   11071                      .dwattr $C$DW$2028, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11072                      .dwattr $C$DW$2028, DW_AT_accessibility(DW_ACCESS_public)
   11073              $C$DW$2029      .dwtag  DW_TAG_member
   11074                      .dwattr $C$DW$2029, DW_AT_type(*$C$DW$T$40)
   11075                      .dwattr $C$DW$2029, DW_AT_name("FETLB_OC")
   11076                      .dwattr $C$DW$2029, DW_AT_TI_symbol_name("_FETLB_OC")
   11077                      .dwattr $C$DW$2029, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11078                      .dwattr $C$DW$2029, DW_AT_accessibility(DW_ACCESS_public)
   11079              $C$DW$2030      .dwtag  DW_TAG_member
   11080                      .dwattr $C$DW$2030, DW_AT_type(*$C$DW$T$40)
   11081                      .dwattr $C$DW$2030, DW_AT_name("FETHC_OC")
   11082                      .dwattr $C$DW$2030, DW_AT_TI_symbol_name("_FETHC_OC")
   11083                      .dwattr $C$DW$2030, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   11084                      .dwattr $C$DW$2030, DW_AT_accessibility(DW_ACCESS_public)
   11085              $C$DW$2031      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  213

   11086                      .dwattr $C$DW$2031, DW_AT_type(*$C$DW$T$40)
   11087                      .dwattr $C$DW$2031, DW_AT_name("FETLC_OC")
   11088                      .dwattr $C$DW$2031, DW_AT_TI_symbol_name("_FETLC_OC")
   11089                      .dwattr $C$DW$2031, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11090                      .dwattr $C$DW$2031, DW_AT_accessibility(DW_ACCESS_public)
   11091                      .dwendtag $C$DW$T$62
   11092              
   11093              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   11094                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$62)
   11095                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   11096              
   11097              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   11098                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   11099                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x02)
   11100              $C$DW$2032      .dwtag  DW_TAG_member
   11101                      .dwattr $C$DW$2032, DW_AT_type(*$C$DW$T$40)
   11102                      .dwattr $C$DW$2032, DW_AT_name("GVDD_OV")
   11103                      .dwattr $C$DW$2032, DW_AT_TI_symbol_name("_GVDD_OV")
   11104                      .dwattr $C$DW$2032, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11105                      .dwattr $C$DW$2032, DW_AT_accessibility(DW_ACCESS_public)
   11106              $C$DW$2033      .dwtag  DW_TAG_member
   11107                      .dwattr $C$DW$2033, DW_AT_type(*$C$DW$T$21)
   11108                      .dwattr $C$DW$2033, DW_AT_name("DeviceID")
   11109                      .dwattr $C$DW$2033, DW_AT_TI_symbol_name("_DeviceID")
   11110                      .dwattr $C$DW$2033, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11111                      .dwattr $C$DW$2033, DW_AT_accessibility(DW_ACCESS_public)
   11112                      .dwendtag $C$DW$T$63
   11113              
   11114              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   11115                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
   11116                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   11117              
   11118              $C$DW$T$68      .dwtag  DW_TAG_structure_type
   11119                      .dwattr $C$DW$T$68, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   11120                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x18)
   11121              $C$DW$2034      .dwtag  DW_TAG_member
   11122                      .dwattr $C$DW$2034, DW_AT_type(*$C$DW$T$64)
   11123                      .dwattr $C$DW$2034, DW_AT_name("Stat_Reg_1")
   11124                      .dwattr $C$DW$2034, DW_AT_TI_symbol_name("_Stat_Reg_1")
   11125                      .dwattr $C$DW$2034, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11126                      .dwattr $C$DW$2034, DW_AT_accessibility(DW_ACCESS_public)
   11127              $C$DW$2035      .dwtag  DW_TAG_member
   11128                      .dwattr $C$DW$2035, DW_AT_type(*$C$DW$T$65)
   11129                      .dwattr $C$DW$2035, DW_AT_name("Stat_Reg_2")
   11130                      .dwattr $C$DW$2035, DW_AT_TI_symbol_name("_Stat_Reg_2")
   11131                      .dwattr $C$DW$2035, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11132                      .dwattr $C$DW$2035, DW_AT_accessibility(DW_ACCESS_public)
   11133              $C$DW$2036      .dwtag  DW_TAG_member
   11134                      .dwattr $C$DW$2036, DW_AT_type(*$C$DW$T$66)
   11135                      .dwattr $C$DW$2036, DW_AT_name("Ctrl_Reg_1")
   11136                      .dwattr $C$DW$2036, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   11137                      .dwattr $C$DW$2036, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11138                      .dwattr $C$DW$2036, DW_AT_accessibility(DW_ACCESS_public)
   11139              $C$DW$2037      .dwtag  DW_TAG_member
   11140                      .dwattr $C$DW$2037, DW_AT_type(*$C$DW$T$67)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  214

   11141                      .dwattr $C$DW$2037, DW_AT_name("Ctrl_Reg_2")
   11142                      .dwattr $C$DW$2037, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   11143                      .dwattr $C$DW$2037, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11144                      .dwattr $C$DW$2037, DW_AT_accessibility(DW_ACCESS_public)
   11145              $C$DW$2038      .dwtag  DW_TAG_member
   11146                      .dwattr $C$DW$2038, DW_AT_type(*$C$DW$T$40)
   11147                      .dwattr $C$DW$2038, DW_AT_name("SndCmd")
   11148                      .dwattr $C$DW$2038, DW_AT_TI_symbol_name("_SndCmd")
   11149                      .dwattr $C$DW$2038, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11150                      .dwattr $C$DW$2038, DW_AT_accessibility(DW_ACCESS_public)
   11151              $C$DW$2039      .dwtag  DW_TAG_member
   11152                      .dwattr $C$DW$2039, DW_AT_type(*$C$DW$T$40)
   11153                      .dwattr $C$DW$2039, DW_AT_name("RcvCmd")
   11154                      .dwattr $C$DW$2039, DW_AT_TI_symbol_name("_RcvCmd")
   11155                      .dwattr $C$DW$2039, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   11156                      .dwattr $C$DW$2039, DW_AT_accessibility(DW_ACCESS_public)
   11157                      .dwendtag $C$DW$T$68
   11158              
   11159              $C$DW$T$340     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
   11160                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$68)
   11161                      .dwattr $C$DW$T$340, DW_AT_language(DW_LANG_C)
   11162              $C$DW$T$341     .dwtag  DW_TAG_pointer_type
   11163                      .dwattr $C$DW$T$341, DW_AT_type(*$C$DW$T$340)
   11164                      .dwattr $C$DW$T$341, DW_AT_address_class(0x20)
   11165              
   11166              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   11167                      .dwattr $C$DW$T$70, DW_AT_name("_FILTER_FO_")
   11168                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
   11169              $C$DW$2040      .dwtag  DW_TAG_member
   11170                      .dwattr $C$DW$2040, DW_AT_type(*$C$DW$T$69)
   11171                      .dwattr $C$DW$2040, DW_AT_name("a1")
   11172                      .dwattr $C$DW$2040, DW_AT_TI_symbol_name("_a1")
   11173                      .dwattr $C$DW$2040, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11174                      .dwattr $C$DW$2040, DW_AT_accessibility(DW_ACCESS_public)
   11175              $C$DW$2041      .dwtag  DW_TAG_member
   11176                      .dwattr $C$DW$2041, DW_AT_type(*$C$DW$T$69)
   11177                      .dwattr $C$DW$2041, DW_AT_name("b0")
   11178                      .dwattr $C$DW$2041, DW_AT_TI_symbol_name("_b0")
   11179                      .dwattr $C$DW$2041, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11180                      .dwattr $C$DW$2041, DW_AT_accessibility(DW_ACCESS_public)
   11181              $C$DW$2042      .dwtag  DW_TAG_member
   11182                      .dwattr $C$DW$2042, DW_AT_type(*$C$DW$T$69)
   11183                      .dwattr $C$DW$2042, DW_AT_name("b1")
   11184                      .dwattr $C$DW$2042, DW_AT_TI_symbol_name("_b1")
   11185                      .dwattr $C$DW$2042, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11186                      .dwattr $C$DW$2042, DW_AT_accessibility(DW_ACCESS_public)
   11187              $C$DW$2043      .dwtag  DW_TAG_member
   11188                      .dwattr $C$DW$2043, DW_AT_type(*$C$DW$T$69)
   11189                      .dwattr $C$DW$2043, DW_AT_name("x1")
   11190                      .dwattr $C$DW$2043, DW_AT_TI_symbol_name("_x1")
   11191                      .dwattr $C$DW$2043, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11192                      .dwattr $C$DW$2043, DW_AT_accessibility(DW_ACCESS_public)
   11193              $C$DW$2044      .dwtag  DW_TAG_member
   11194                      .dwattr $C$DW$2044, DW_AT_type(*$C$DW$T$69)
   11195                      .dwattr $C$DW$2044, DW_AT_name("y1")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  215

   11196                      .dwattr $C$DW$2044, DW_AT_TI_symbol_name("_y1")
   11197                      .dwattr $C$DW$2044, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11198                      .dwattr $C$DW$2044, DW_AT_accessibility(DW_ACCESS_public)
   11199                      .dwendtag $C$DW$T$70
   11200              
   11201              $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   11202                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$70)
   11203                      .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
   11204              
   11205              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   11206                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   11207                      .dwattr $C$DW$T$19, DW_AT_declaration
   11208                      .dwendtag $C$DW$T$19
   11209              
   11210              $C$DW$T$117     .dwtag  DW_TAG_pointer_type
   11211                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$19)
   11212                      .dwattr $C$DW$T$117, DW_AT_address_class(0x20)
   11213              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   11214                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
   11215                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
   11216              
   11217              $C$DW$T$71      .dwtag  DW_TAG_structure_type
   11218                      .dwattr $C$DW$T$71, DW_AT_name("_FLASH_Obj_")
   11219                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
   11220              $C$DW$2045      .dwtag  DW_TAG_member
   11221                      .dwattr $C$DW$2045, DW_AT_type(*$C$DW$T$22)
   11222                      .dwattr $C$DW$2045, DW_AT_name("FOPT")
   11223                      .dwattr $C$DW$2045, DW_AT_TI_symbol_name("_FOPT")
   11224                      .dwattr $C$DW$2045, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11225                      .dwattr $C$DW$2045, DW_AT_accessibility(DW_ACCESS_public)
   11226              $C$DW$2046      .dwtag  DW_TAG_member
   11227                      .dwattr $C$DW$2046, DW_AT_type(*$C$DW$T$22)
   11228                      .dwattr $C$DW$2046, DW_AT_name("rsvd_1")
   11229                      .dwattr $C$DW$2046, DW_AT_TI_symbol_name("_rsvd_1")
   11230                      .dwattr $C$DW$2046, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11231                      .dwattr $C$DW$2046, DW_AT_accessibility(DW_ACCESS_public)
   11232              $C$DW$2047      .dwtag  DW_TAG_member
   11233                      .dwattr $C$DW$2047, DW_AT_type(*$C$DW$T$22)
   11234                      .dwattr $C$DW$2047, DW_AT_name("FPWR")
   11235                      .dwattr $C$DW$2047, DW_AT_TI_symbol_name("_FPWR")
   11236                      .dwattr $C$DW$2047, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11237                      .dwattr $C$DW$2047, DW_AT_accessibility(DW_ACCESS_public)
   11238              $C$DW$2048      .dwtag  DW_TAG_member
   11239                      .dwattr $C$DW$2048, DW_AT_type(*$C$DW$T$22)
   11240                      .dwattr $C$DW$2048, DW_AT_name("FSTATUS")
   11241                      .dwattr $C$DW$2048, DW_AT_TI_symbol_name("_FSTATUS")
   11242                      .dwattr $C$DW$2048, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11243                      .dwattr $C$DW$2048, DW_AT_accessibility(DW_ACCESS_public)
   11244              $C$DW$2049      .dwtag  DW_TAG_member
   11245                      .dwattr $C$DW$2049, DW_AT_type(*$C$DW$T$22)
   11246                      .dwattr $C$DW$2049, DW_AT_name("FSTDBYWAIT")
   11247                      .dwattr $C$DW$2049, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   11248                      .dwattr $C$DW$2049, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11249                      .dwattr $C$DW$2049, DW_AT_accessibility(DW_ACCESS_public)
   11250              $C$DW$2050      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  216

   11251                      .dwattr $C$DW$2050, DW_AT_type(*$C$DW$T$22)
   11252                      .dwattr $C$DW$2050, DW_AT_name("FACTIVEWAIT")
   11253                      .dwattr $C$DW$2050, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   11254                      .dwattr $C$DW$2050, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11255                      .dwattr $C$DW$2050, DW_AT_accessibility(DW_ACCESS_public)
   11256              $C$DW$2051      .dwtag  DW_TAG_member
   11257                      .dwattr $C$DW$2051, DW_AT_type(*$C$DW$T$22)
   11258                      .dwattr $C$DW$2051, DW_AT_name("FBANKWAIT")
   11259                      .dwattr $C$DW$2051, DW_AT_TI_symbol_name("_FBANKWAIT")
   11260                      .dwattr $C$DW$2051, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11261                      .dwattr $C$DW$2051, DW_AT_accessibility(DW_ACCESS_public)
   11262              $C$DW$2052      .dwtag  DW_TAG_member
   11263                      .dwattr $C$DW$2052, DW_AT_type(*$C$DW$T$22)
   11264                      .dwattr $C$DW$2052, DW_AT_name("FOTPWAIT")
   11265                      .dwattr $C$DW$2052, DW_AT_TI_symbol_name("_FOTPWAIT")
   11266                      .dwattr $C$DW$2052, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11267                      .dwattr $C$DW$2052, DW_AT_accessibility(DW_ACCESS_public)
   11268                      .dwendtag $C$DW$T$71
   11269              
   11270              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
   11271                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$71)
   11272                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
   11273              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   11274                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
   11275                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
   11276              
   11277              $C$DW$T$76      .dwtag  DW_TAG_structure_type
   11278                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
   11279                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
   11280              $C$DW$2053      .dwtag  DW_TAG_member
   11281                      .dwattr $C$DW$2053, DW_AT_type(*$C$DW$T$73)
   11282                      .dwattr $C$DW$2053, DW_AT_name("GPACTRL")
   11283                      .dwattr $C$DW$2053, DW_AT_TI_symbol_name("_GPACTRL")
   11284                      .dwattr $C$DW$2053, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11285                      .dwattr $C$DW$2053, DW_AT_accessibility(DW_ACCESS_public)
   11286              $C$DW$2054      .dwtag  DW_TAG_member
   11287                      .dwattr $C$DW$2054, DW_AT_type(*$C$DW$T$73)
   11288                      .dwattr $C$DW$2054, DW_AT_name("GPAQSEL1")
   11289                      .dwattr $C$DW$2054, DW_AT_TI_symbol_name("_GPAQSEL1")
   11290                      .dwattr $C$DW$2054, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11291                      .dwattr $C$DW$2054, DW_AT_accessibility(DW_ACCESS_public)
   11292              $C$DW$2055      .dwtag  DW_TAG_member
   11293                      .dwattr $C$DW$2055, DW_AT_type(*$C$DW$T$73)
   11294                      .dwattr $C$DW$2055, DW_AT_name("GPAQSEL2")
   11295                      .dwattr $C$DW$2055, DW_AT_TI_symbol_name("_GPAQSEL2")
   11296                      .dwattr $C$DW$2055, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11297                      .dwattr $C$DW$2055, DW_AT_accessibility(DW_ACCESS_public)
   11298              $C$DW$2056      .dwtag  DW_TAG_member
   11299                      .dwattr $C$DW$2056, DW_AT_type(*$C$DW$T$73)
   11300                      .dwattr $C$DW$2056, DW_AT_name("GPAMUX1")
   11301                      .dwattr $C$DW$2056, DW_AT_TI_symbol_name("_GPAMUX1")
   11302                      .dwattr $C$DW$2056, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11303                      .dwattr $C$DW$2056, DW_AT_accessibility(DW_ACCESS_public)
   11304              $C$DW$2057      .dwtag  DW_TAG_member
   11305                      .dwattr $C$DW$2057, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  217

   11306                      .dwattr $C$DW$2057, DW_AT_name("GPAMUX2")
   11307                      .dwattr $C$DW$2057, DW_AT_TI_symbol_name("_GPAMUX2")
   11308                      .dwattr $C$DW$2057, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11309                      .dwattr $C$DW$2057, DW_AT_accessibility(DW_ACCESS_public)
   11310              $C$DW$2058      .dwtag  DW_TAG_member
   11311                      .dwattr $C$DW$2058, DW_AT_type(*$C$DW$T$73)
   11312                      .dwattr $C$DW$2058, DW_AT_name("GPADIR")
   11313                      .dwattr $C$DW$2058, DW_AT_TI_symbol_name("_GPADIR")
   11314                      .dwattr $C$DW$2058, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11315                      .dwattr $C$DW$2058, DW_AT_accessibility(DW_ACCESS_public)
   11316              $C$DW$2059      .dwtag  DW_TAG_member
   11317                      .dwattr $C$DW$2059, DW_AT_type(*$C$DW$T$73)
   11318                      .dwattr $C$DW$2059, DW_AT_name("GPAPUD")
   11319                      .dwattr $C$DW$2059, DW_AT_TI_symbol_name("_GPAPUD")
   11320                      .dwattr $C$DW$2059, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11321                      .dwattr $C$DW$2059, DW_AT_accessibility(DW_ACCESS_public)
   11322              $C$DW$2060      .dwtag  DW_TAG_member
   11323                      .dwattr $C$DW$2060, DW_AT_type(*$C$DW$T$25)
   11324                      .dwattr $C$DW$2060, DW_AT_name("rsvd_1")
   11325                      .dwattr $C$DW$2060, DW_AT_TI_symbol_name("_rsvd_1")
   11326                      .dwattr $C$DW$2060, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11327                      .dwattr $C$DW$2060, DW_AT_accessibility(DW_ACCESS_public)
   11328              $C$DW$2061      .dwtag  DW_TAG_member
   11329                      .dwattr $C$DW$2061, DW_AT_type(*$C$DW$T$73)
   11330                      .dwattr $C$DW$2061, DW_AT_name("GPBCTRL")
   11331                      .dwattr $C$DW$2061, DW_AT_TI_symbol_name("_GPBCTRL")
   11332                      .dwattr $C$DW$2061, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11333                      .dwattr $C$DW$2061, DW_AT_accessibility(DW_ACCESS_public)
   11334              $C$DW$2062      .dwtag  DW_TAG_member
   11335                      .dwattr $C$DW$2062, DW_AT_type(*$C$DW$T$73)
   11336                      .dwattr $C$DW$2062, DW_AT_name("GPBQSEL1")
   11337                      .dwattr $C$DW$2062, DW_AT_TI_symbol_name("_GPBQSEL1")
   11338                      .dwattr $C$DW$2062, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11339                      .dwattr $C$DW$2062, DW_AT_accessibility(DW_ACCESS_public)
   11340              $C$DW$2063      .dwtag  DW_TAG_member
   11341                      .dwattr $C$DW$2063, DW_AT_type(*$C$DW$T$73)
   11342                      .dwattr $C$DW$2063, DW_AT_name("GPBQSEL2")
   11343                      .dwattr $C$DW$2063, DW_AT_TI_symbol_name("_GPBQSEL2")
   11344                      .dwattr $C$DW$2063, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11345                      .dwattr $C$DW$2063, DW_AT_accessibility(DW_ACCESS_public)
   11346              $C$DW$2064      .dwtag  DW_TAG_member
   11347                      .dwattr $C$DW$2064, DW_AT_type(*$C$DW$T$73)
   11348                      .dwattr $C$DW$2064, DW_AT_name("GPBMUX1")
   11349                      .dwattr $C$DW$2064, DW_AT_TI_symbol_name("_GPBMUX1")
   11350                      .dwattr $C$DW$2064, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11351                      .dwattr $C$DW$2064, DW_AT_accessibility(DW_ACCESS_public)
   11352              $C$DW$2065      .dwtag  DW_TAG_member
   11353                      .dwattr $C$DW$2065, DW_AT_type(*$C$DW$T$73)
   11354                      .dwattr $C$DW$2065, DW_AT_name("GPBMUX2")
   11355                      .dwattr $C$DW$2065, DW_AT_TI_symbol_name("_GPBMUX2")
   11356                      .dwattr $C$DW$2065, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11357                      .dwattr $C$DW$2065, DW_AT_accessibility(DW_ACCESS_public)
   11358              $C$DW$2066      .dwtag  DW_TAG_member
   11359                      .dwattr $C$DW$2066, DW_AT_type(*$C$DW$T$73)
   11360                      .dwattr $C$DW$2066, DW_AT_name("GPBDIR")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  218

   11361                      .dwattr $C$DW$2066, DW_AT_TI_symbol_name("_GPBDIR")
   11362                      .dwattr $C$DW$2066, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11363                      .dwattr $C$DW$2066, DW_AT_accessibility(DW_ACCESS_public)
   11364              $C$DW$2067      .dwtag  DW_TAG_member
   11365                      .dwattr $C$DW$2067, DW_AT_type(*$C$DW$T$73)
   11366                      .dwattr $C$DW$2067, DW_AT_name("GPBPUD")
   11367                      .dwattr $C$DW$2067, DW_AT_TI_symbol_name("_GPBPUD")
   11368                      .dwattr $C$DW$2067, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   11369                      .dwattr $C$DW$2067, DW_AT_accessibility(DW_ACCESS_public)
   11370              $C$DW$2068      .dwtag  DW_TAG_member
   11371                      .dwattr $C$DW$2068, DW_AT_type(*$C$DW$T$74)
   11372                      .dwattr $C$DW$2068, DW_AT_name("rsvd_4")
   11373                      .dwattr $C$DW$2068, DW_AT_TI_symbol_name("_rsvd_4")
   11374                      .dwattr $C$DW$2068, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   11375                      .dwattr $C$DW$2068, DW_AT_accessibility(DW_ACCESS_public)
   11376              $C$DW$2069      .dwtag  DW_TAG_member
   11377                      .dwattr $C$DW$2069, DW_AT_type(*$C$DW$T$73)
   11378                      .dwattr $C$DW$2069, DW_AT_name("AIOMUX1")
   11379                      .dwattr $C$DW$2069, DW_AT_TI_symbol_name("_AIOMUX1")
   11380                      .dwattr $C$DW$2069, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   11381                      .dwattr $C$DW$2069, DW_AT_accessibility(DW_ACCESS_public)
   11382              $C$DW$2070      .dwtag  DW_TAG_member
   11383                      .dwattr $C$DW$2070, DW_AT_type(*$C$DW$T$25)
   11384                      .dwattr $C$DW$2070, DW_AT_name("rsvd_5")
   11385                      .dwattr $C$DW$2070, DW_AT_TI_symbol_name("_rsvd_5")
   11386                      .dwattr $C$DW$2070, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   11387                      .dwattr $C$DW$2070, DW_AT_accessibility(DW_ACCESS_public)
   11388              $C$DW$2071      .dwtag  DW_TAG_member
   11389                      .dwattr $C$DW$2071, DW_AT_type(*$C$DW$T$73)
   11390                      .dwattr $C$DW$2071, DW_AT_name("AIODIR")
   11391                      .dwattr $C$DW$2071, DW_AT_TI_symbol_name("_AIODIR")
   11392                      .dwattr $C$DW$2071, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   11393                      .dwattr $C$DW$2071, DW_AT_accessibility(DW_ACCESS_public)
   11394              $C$DW$2072      .dwtag  DW_TAG_member
   11395                      .dwattr $C$DW$2072, DW_AT_type(*$C$DW$T$75)
   11396                      .dwattr $C$DW$2072, DW_AT_name("rsvd_6")
   11397                      .dwattr $C$DW$2072, DW_AT_TI_symbol_name("_rsvd_6")
   11398                      .dwattr $C$DW$2072, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   11399                      .dwattr $C$DW$2072, DW_AT_accessibility(DW_ACCESS_public)
   11400              $C$DW$2073      .dwtag  DW_TAG_member
   11401                      .dwattr $C$DW$2073, DW_AT_type(*$C$DW$T$73)
   11402                      .dwattr $C$DW$2073, DW_AT_name("GPADAT")
   11403                      .dwattr $C$DW$2073, DW_AT_TI_symbol_name("_GPADAT")
   11404                      .dwattr $C$DW$2073, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   11405                      .dwattr $C$DW$2073, DW_AT_accessibility(DW_ACCESS_public)
   11406              $C$DW$2074      .dwtag  DW_TAG_member
   11407                      .dwattr $C$DW$2074, DW_AT_type(*$C$DW$T$73)
   11408                      .dwattr $C$DW$2074, DW_AT_name("GPASET")
   11409                      .dwattr $C$DW$2074, DW_AT_TI_symbol_name("_GPASET")
   11410                      .dwattr $C$DW$2074, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   11411                      .dwattr $C$DW$2074, DW_AT_accessibility(DW_ACCESS_public)
   11412              $C$DW$2075      .dwtag  DW_TAG_member
   11413                      .dwattr $C$DW$2075, DW_AT_type(*$C$DW$T$73)
   11414                      .dwattr $C$DW$2075, DW_AT_name("GPACLEAR")
   11415                      .dwattr $C$DW$2075, DW_AT_TI_symbol_name("_GPACLEAR")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  219

   11416                      .dwattr $C$DW$2075, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   11417                      .dwattr $C$DW$2075, DW_AT_accessibility(DW_ACCESS_public)
   11418              $C$DW$2076      .dwtag  DW_TAG_member
   11419                      .dwattr $C$DW$2076, DW_AT_type(*$C$DW$T$73)
   11420                      .dwattr $C$DW$2076, DW_AT_name("GPATOGGLE")
   11421                      .dwattr $C$DW$2076, DW_AT_TI_symbol_name("_GPATOGGLE")
   11422                      .dwattr $C$DW$2076, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   11423                      .dwattr $C$DW$2076, DW_AT_accessibility(DW_ACCESS_public)
   11424              $C$DW$2077      .dwtag  DW_TAG_member
   11425                      .dwattr $C$DW$2077, DW_AT_type(*$C$DW$T$73)
   11426                      .dwattr $C$DW$2077, DW_AT_name("GPBDAT")
   11427                      .dwattr $C$DW$2077, DW_AT_TI_symbol_name("_GPBDAT")
   11428                      .dwattr $C$DW$2077, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   11429                      .dwattr $C$DW$2077, DW_AT_accessibility(DW_ACCESS_public)
   11430              $C$DW$2078      .dwtag  DW_TAG_member
   11431                      .dwattr $C$DW$2078, DW_AT_type(*$C$DW$T$73)
   11432                      .dwattr $C$DW$2078, DW_AT_name("GPBSET")
   11433                      .dwattr $C$DW$2078, DW_AT_TI_symbol_name("_GPBSET")
   11434                      .dwattr $C$DW$2078, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   11435                      .dwattr $C$DW$2078, DW_AT_accessibility(DW_ACCESS_public)
   11436              $C$DW$2079      .dwtag  DW_TAG_member
   11437                      .dwattr $C$DW$2079, DW_AT_type(*$C$DW$T$73)
   11438                      .dwattr $C$DW$2079, DW_AT_name("GPBCLEAR")
   11439                      .dwattr $C$DW$2079, DW_AT_TI_symbol_name("_GPBCLEAR")
   11440                      .dwattr $C$DW$2079, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   11441                      .dwattr $C$DW$2079, DW_AT_accessibility(DW_ACCESS_public)
   11442              $C$DW$2080      .dwtag  DW_TAG_member
   11443                      .dwattr $C$DW$2080, DW_AT_type(*$C$DW$T$73)
   11444                      .dwattr $C$DW$2080, DW_AT_name("GPBTOGGLE")
   11445                      .dwattr $C$DW$2080, DW_AT_TI_symbol_name("_GPBTOGGLE")
   11446                      .dwattr $C$DW$2080, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   11447                      .dwattr $C$DW$2080, DW_AT_accessibility(DW_ACCESS_public)
   11448              $C$DW$2081      .dwtag  DW_TAG_member
   11449                      .dwattr $C$DW$2081, DW_AT_type(*$C$DW$T$30)
   11450                      .dwattr $C$DW$2081, DW_AT_name("rsvd_7")
   11451                      .dwattr $C$DW$2081, DW_AT_TI_symbol_name("_rsvd_7")
   11452                      .dwattr $C$DW$2081, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   11453                      .dwattr $C$DW$2081, DW_AT_accessibility(DW_ACCESS_public)
   11454              $C$DW$2082      .dwtag  DW_TAG_member
   11455                      .dwattr $C$DW$2082, DW_AT_type(*$C$DW$T$73)
   11456                      .dwattr $C$DW$2082, DW_AT_name("AIODAT")
   11457                      .dwattr $C$DW$2082, DW_AT_TI_symbol_name("_AIODAT")
   11458                      .dwattr $C$DW$2082, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   11459                      .dwattr $C$DW$2082, DW_AT_accessibility(DW_ACCESS_public)
   11460              $C$DW$2083      .dwtag  DW_TAG_member
   11461                      .dwattr $C$DW$2083, DW_AT_type(*$C$DW$T$73)
   11462                      .dwattr $C$DW$2083, DW_AT_name("AIOSET")
   11463                      .dwattr $C$DW$2083, DW_AT_TI_symbol_name("_AIOSET")
   11464                      .dwattr $C$DW$2083, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   11465                      .dwattr $C$DW$2083, DW_AT_accessibility(DW_ACCESS_public)
   11466              $C$DW$2084      .dwtag  DW_TAG_member
   11467                      .dwattr $C$DW$2084, DW_AT_type(*$C$DW$T$73)
   11468                      .dwattr $C$DW$2084, DW_AT_name("AIOCLEAR")
   11469                      .dwattr $C$DW$2084, DW_AT_TI_symbol_name("_AIOCLEAR")
   11470                      .dwattr $C$DW$2084, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  220

   11471                      .dwattr $C$DW$2084, DW_AT_accessibility(DW_ACCESS_public)
   11472              $C$DW$2085      .dwtag  DW_TAG_member
   11473                      .dwattr $C$DW$2085, DW_AT_type(*$C$DW$T$73)
   11474                      .dwattr $C$DW$2085, DW_AT_name("AIOTOGGLE")
   11475                      .dwattr $C$DW$2085, DW_AT_TI_symbol_name("_AIOTOGGLE")
   11476                      .dwattr $C$DW$2085, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   11477                      .dwattr $C$DW$2085, DW_AT_accessibility(DW_ACCESS_public)
   11478              $C$DW$2086      .dwtag  DW_TAG_member
   11479                      .dwattr $C$DW$2086, DW_AT_type(*$C$DW$T$27)
   11480                      .dwattr $C$DW$2086, DW_AT_name("GPIOXINTnSEL")
   11481                      .dwattr $C$DW$2086, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   11482                      .dwattr $C$DW$2086, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   11483                      .dwattr $C$DW$2086, DW_AT_accessibility(DW_ACCESS_public)
   11484              $C$DW$2087      .dwtag  DW_TAG_member
   11485                      .dwattr $C$DW$2087, DW_AT_type(*$C$DW$T$26)
   11486                      .dwattr $C$DW$2087, DW_AT_name("rsvd_8")
   11487                      .dwattr $C$DW$2087, DW_AT_TI_symbol_name("_rsvd_8")
   11488                      .dwattr $C$DW$2087, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   11489                      .dwattr $C$DW$2087, DW_AT_accessibility(DW_ACCESS_public)
   11490              $C$DW$2088      .dwtag  DW_TAG_member
   11491                      .dwattr $C$DW$2088, DW_AT_type(*$C$DW$T$73)
   11492                      .dwattr $C$DW$2088, DW_AT_name("GPIOLPMSEL")
   11493                      .dwattr $C$DW$2088, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   11494                      .dwattr $C$DW$2088, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   11495                      .dwattr $C$DW$2088, DW_AT_accessibility(DW_ACCESS_public)
   11496                      .dwendtag $C$DW$T$76
   11497              
   11498              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
   11499                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$76)
   11500                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
   11501              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   11502                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
   11503                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
   11504              
   11505              $C$DW$T$78      .dwtag  DW_TAG_structure_type
   11506                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
   11507                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0e)
   11508              $C$DW$2089      .dwtag  DW_TAG_member
   11509                      .dwattr $C$DW$2089, DW_AT_type(*$C$DW$T$77)
   11510                      .dwattr $C$DW$2089, DW_AT_name("I")
   11511                      .dwattr $C$DW$2089, DW_AT_TI_symbol_name("_I")
   11512                      .dwattr $C$DW$2089, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11513                      .dwattr $C$DW$2089, DW_AT_accessibility(DW_ACCESS_public)
   11514              $C$DW$2090      .dwtag  DW_TAG_member
   11515                      .dwattr $C$DW$2090, DW_AT_type(*$C$DW$T$77)
   11516                      .dwattr $C$DW$2090, DW_AT_name("V")
   11517                      .dwattr $C$DW$2090, DW_AT_TI_symbol_name("_V")
   11518                      .dwattr $C$DW$2090, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11519                      .dwattr $C$DW$2090, DW_AT_accessibility(DW_ACCESS_public)
   11520              $C$DW$2091      .dwtag  DW_TAG_member
   11521                      .dwattr $C$DW$2091, DW_AT_type(*$C$DW$T$69)
   11522                      .dwattr $C$DW$2091, DW_AT_name("dcBus")
   11523                      .dwattr $C$DW$2091, DW_AT_TI_symbol_name("_dcBus")
   11524                      .dwattr $C$DW$2091, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11525                      .dwattr $C$DW$2091, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  221

   11526                      .dwendtag $C$DW$T$78
   11527              
   11528              $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   11529                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$78)
   11530                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
   11531              
   11532              $C$DW$T$113     .dwtag  DW_TAG_structure_type
   11533                      .dwattr $C$DW$T$113, DW_AT_name("_HAL_Obj_")
   11534                      .dwattr $C$DW$T$113, DW_AT_byte_size(0xa6)
   11535              $C$DW$2092      .dwtag  DW_TAG_member
   11536                      .dwattr $C$DW$2092, DW_AT_type(*$C$DW$T$80)
   11537                      .dwattr $C$DW$2092, DW_AT_name("adcHandle")
   11538                      .dwattr $C$DW$2092, DW_AT_TI_symbol_name("_adcHandle")
   11539                      .dwattr $C$DW$2092, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11540                      .dwattr $C$DW$2092, DW_AT_accessibility(DW_ACCESS_public)
   11541              $C$DW$2093      .dwtag  DW_TAG_member
   11542                      .dwattr $C$DW$2093, DW_AT_type(*$C$DW$T$82)
   11543                      .dwattr $C$DW$2093, DW_AT_name("clkHandle")
   11544                      .dwattr $C$DW$2093, DW_AT_TI_symbol_name("_clkHandle")
   11545                      .dwattr $C$DW$2093, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11546                      .dwattr $C$DW$2093, DW_AT_accessibility(DW_ACCESS_public)
   11547              $C$DW$2094      .dwtag  DW_TAG_member
   11548                      .dwattr $C$DW$2094, DW_AT_type(*$C$DW$T$84)
   11549                      .dwattr $C$DW$2094, DW_AT_name("cpuHandle")
   11550                      .dwattr $C$DW$2094, DW_AT_TI_symbol_name("_cpuHandle")
   11551                      .dwattr $C$DW$2094, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11552                      .dwattr $C$DW$2094, DW_AT_accessibility(DW_ACCESS_public)
   11553              $C$DW$2095      .dwtag  DW_TAG_member
   11554                      .dwattr $C$DW$2095, DW_AT_type(*$C$DW$T$86)
   11555                      .dwattr $C$DW$2095, DW_AT_name("flashHandle")
   11556                      .dwattr $C$DW$2095, DW_AT_TI_symbol_name("_flashHandle")
   11557                      .dwattr $C$DW$2095, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11558                      .dwattr $C$DW$2095, DW_AT_accessibility(DW_ACCESS_public)
   11559              $C$DW$2096      .dwtag  DW_TAG_member
   11560                      .dwattr $C$DW$2096, DW_AT_type(*$C$DW$T$37)
   11561                      .dwattr $C$DW$2096, DW_AT_name("gpioHandle")
   11562                      .dwattr $C$DW$2096, DW_AT_TI_symbol_name("_gpioHandle")
   11563                      .dwattr $C$DW$2096, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11564                      .dwattr $C$DW$2096, DW_AT_accessibility(DW_ACCESS_public)
   11565              $C$DW$2097      .dwtag  DW_TAG_member
   11566                      .dwattr $C$DW$2097, DW_AT_type(*$C$DW$T$89)
   11567                      .dwattr $C$DW$2097, DW_AT_name("offsetHandle_I")
   11568                      .dwattr $C$DW$2097, DW_AT_TI_symbol_name("_offsetHandle_I")
   11569                      .dwattr $C$DW$2097, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11570                      .dwattr $C$DW$2097, DW_AT_accessibility(DW_ACCESS_public)
   11571              $C$DW$2098      .dwtag  DW_TAG_member
   11572                      .dwattr $C$DW$2098, DW_AT_type(*$C$DW$T$91)
   11573                      .dwattr $C$DW$2098, DW_AT_name("offset_I")
   11574                      .dwattr $C$DW$2098, DW_AT_TI_symbol_name("_offset_I")
   11575                      .dwattr $C$DW$2098, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11576                      .dwattr $C$DW$2098, DW_AT_accessibility(DW_ACCESS_public)
   11577              $C$DW$2099      .dwtag  DW_TAG_member
   11578                      .dwattr $C$DW$2099, DW_AT_type(*$C$DW$T$89)
   11579                      .dwattr $C$DW$2099, DW_AT_name("offsetHandle_V")
   11580                      .dwattr $C$DW$2099, DW_AT_TI_symbol_name("_offsetHandle_V")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  222

   11581                      .dwattr $C$DW$2099, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   11582                      .dwattr $C$DW$2099, DW_AT_accessibility(DW_ACCESS_public)
   11583              $C$DW$2100      .dwtag  DW_TAG_member
   11584                      .dwattr $C$DW$2100, DW_AT_type(*$C$DW$T$91)
   11585                      .dwattr $C$DW$2100, DW_AT_name("offset_V")
   11586                      .dwattr $C$DW$2100, DW_AT_TI_symbol_name("_offset_V")
   11587                      .dwattr $C$DW$2100, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   11588                      .dwattr $C$DW$2100, DW_AT_accessibility(DW_ACCESS_public)
   11589              $C$DW$2101      .dwtag  DW_TAG_member
   11590                      .dwattr $C$DW$2101, DW_AT_type(*$C$DW$T$93)
   11591                      .dwattr $C$DW$2101, DW_AT_name("oscHandle")
   11592                      .dwattr $C$DW$2101, DW_AT_TI_symbol_name("_oscHandle")
   11593                      .dwattr $C$DW$2101, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
   11594                      .dwattr $C$DW$2101, DW_AT_accessibility(DW_ACCESS_public)
   11595              $C$DW$2102      .dwtag  DW_TAG_member
   11596                      .dwattr $C$DW$2102, DW_AT_type(*$C$DW$T$95)
   11597                      .dwattr $C$DW$2102, DW_AT_name("pieHandle")
   11598                      .dwattr $C$DW$2102, DW_AT_TI_symbol_name("_pieHandle")
   11599                      .dwattr $C$DW$2102, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   11600                      .dwattr $C$DW$2102, DW_AT_accessibility(DW_ACCESS_public)
   11601              $C$DW$2103      .dwtag  DW_TAG_member
   11602                      .dwattr $C$DW$2103, DW_AT_type(*$C$DW$T$97)
   11603                      .dwattr $C$DW$2103, DW_AT_name("pllHandle")
   11604                      .dwattr $C$DW$2103, DW_AT_TI_symbol_name("_pllHandle")
   11605                      .dwattr $C$DW$2103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
   11606                      .dwattr $C$DW$2103, DW_AT_accessibility(DW_ACCESS_public)
   11607              $C$DW$2104      .dwtag  DW_TAG_member
   11608                      .dwattr $C$DW$2104, DW_AT_type(*$C$DW$T$100)
   11609                      .dwattr $C$DW$2104, DW_AT_name("pwmHandle")
   11610                      .dwattr $C$DW$2104, DW_AT_TI_symbol_name("_pwmHandle")
   11611                      .dwattr $C$DW$2104, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   11612                      .dwattr $C$DW$2104, DW_AT_accessibility(DW_ACCESS_public)
   11613              $C$DW$2105      .dwtag  DW_TAG_member
   11614                      .dwattr $C$DW$2105, DW_AT_type(*$C$DW$T$101)
   11615                      .dwattr $C$DW$2105, DW_AT_name("pwmDacHandle")
   11616                      .dwattr $C$DW$2105, DW_AT_TI_symbol_name("_pwmDacHandle")
   11617                      .dwattr $C$DW$2105, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   11618                      .dwattr $C$DW$2105, DW_AT_accessibility(DW_ACCESS_public)
   11619              $C$DW$2106      .dwtag  DW_TAG_member
   11620                      .dwattr $C$DW$2106, DW_AT_type(*$C$DW$T$103)
   11621                      .dwattr $C$DW$2106, DW_AT_name("pwrHandle")
   11622                      .dwattr $C$DW$2106, DW_AT_TI_symbol_name("_pwrHandle")
   11623                      .dwattr $C$DW$2106, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   11624                      .dwattr $C$DW$2106, DW_AT_accessibility(DW_ACCESS_public)
   11625              $C$DW$2107      .dwtag  DW_TAG_member
   11626                      .dwattr $C$DW$2107, DW_AT_type(*$C$DW$T$106)
   11627                      .dwattr $C$DW$2107, DW_AT_name("timerHandle")
   11628                      .dwattr $C$DW$2107, DW_AT_TI_symbol_name("_timerHandle")
   11629                      .dwattr $C$DW$2107, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   11630                      .dwattr $C$DW$2107, DW_AT_accessibility(DW_ACCESS_public)
   11631              $C$DW$2108      .dwtag  DW_TAG_member
   11632                      .dwattr $C$DW$2108, DW_AT_type(*$C$DW$T$108)
   11633                      .dwattr $C$DW$2108, DW_AT_name("wdogHandle")
   11634                      .dwattr $C$DW$2108, DW_AT_TI_symbol_name("_wdogHandle")
   11635                      .dwattr $C$DW$2108, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  223

   11636                      .dwattr $C$DW$2108, DW_AT_accessibility(DW_ACCESS_public)
   11637              $C$DW$2109      .dwtag  DW_TAG_member
   11638                      .dwattr $C$DW$2109, DW_AT_type(*$C$DW$T$109)
   11639                      .dwattr $C$DW$2109, DW_AT_name("adcBias")
   11640                      .dwattr $C$DW$2109, DW_AT_TI_symbol_name("_adcBias")
   11641                      .dwattr $C$DW$2109, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
   11642                      .dwattr $C$DW$2109, DW_AT_accessibility(DW_ACCESS_public)
   11643              $C$DW$2110      .dwtag  DW_TAG_member
   11644                      .dwattr $C$DW$2110, DW_AT_type(*$C$DW$T$69)
   11645                      .dwattr $C$DW$2110, DW_AT_name("current_sf")
   11646                      .dwattr $C$DW$2110, DW_AT_TI_symbol_name("_current_sf")
   11647                      .dwattr $C$DW$2110, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   11648                      .dwattr $C$DW$2110, DW_AT_accessibility(DW_ACCESS_public)
   11649              $C$DW$2111      .dwtag  DW_TAG_member
   11650                      .dwattr $C$DW$2111, DW_AT_type(*$C$DW$T$69)
   11651                      .dwattr $C$DW$2111, DW_AT_name("voltage_sf")
   11652                      .dwattr $C$DW$2111, DW_AT_TI_symbol_name("_voltage_sf")
   11653                      .dwattr $C$DW$2111, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   11654                      .dwattr $C$DW$2111, DW_AT_accessibility(DW_ACCESS_public)
   11655              $C$DW$2112      .dwtag  DW_TAG_member
   11656                      .dwattr $C$DW$2112, DW_AT_type(*$C$DW$T$32)
   11657                      .dwattr $C$DW$2112, DW_AT_name("numCurrentSensors")
   11658                      .dwattr $C$DW$2112, DW_AT_TI_symbol_name("_numCurrentSensors")
   11659                      .dwattr $C$DW$2112, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   11660                      .dwattr $C$DW$2112, DW_AT_accessibility(DW_ACCESS_public)
   11661              $C$DW$2113      .dwtag  DW_TAG_member
   11662                      .dwattr $C$DW$2113, DW_AT_type(*$C$DW$T$32)
   11663                      .dwattr $C$DW$2113, DW_AT_name("numVoltageSensors")
   11664                      .dwattr $C$DW$2113, DW_AT_TI_symbol_name("_numVoltageSensors")
   11665                      .dwattr $C$DW$2113, DW_AT_data_member_location[DW_OP_plus_uconst 0x97]
   11666                      .dwattr $C$DW$2113, DW_AT_accessibility(DW_ACCESS_public)
   11667              $C$DW$2114      .dwtag  DW_TAG_member
   11668                      .dwattr $C$DW$2114, DW_AT_type(*$C$DW$T$35)
   11669                      .dwattr $C$DW$2114, DW_AT_name("spiAHandle")
   11670                      .dwattr $C$DW$2114, DW_AT_TI_symbol_name("_spiAHandle")
   11671                      .dwattr $C$DW$2114, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
   11672                      .dwattr $C$DW$2114, DW_AT_accessibility(DW_ACCESS_public)
   11673              $C$DW$2115      .dwtag  DW_TAG_member
   11674                      .dwattr $C$DW$2115, DW_AT_type(*$C$DW$T$35)
   11675                      .dwattr $C$DW$2115, DW_AT_name("spiBHandle")
   11676                      .dwattr $C$DW$2115, DW_AT_TI_symbol_name("_spiBHandle")
   11677                      .dwattr $C$DW$2115, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
   11678                      .dwattr $C$DW$2115, DW_AT_accessibility(DW_ACCESS_public)
   11679              $C$DW$2116      .dwtag  DW_TAG_member
   11680                      .dwattr $C$DW$2116, DW_AT_type(*$C$DW$T$111)
   11681                      .dwattr $C$DW$2116, DW_AT_name("drv8301Handle")
   11682                      .dwattr $C$DW$2116, DW_AT_TI_symbol_name("_drv8301Handle")
   11683                      .dwattr $C$DW$2116, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
   11684                      .dwattr $C$DW$2116, DW_AT_accessibility(DW_ACCESS_public)
   11685              $C$DW$2117      .dwtag  DW_TAG_member
   11686                      .dwattr $C$DW$2117, DW_AT_type(*$C$DW$T$112)
   11687                      .dwattr $C$DW$2117, DW_AT_name("drv8301")
   11688                      .dwattr $C$DW$2117, DW_AT_TI_symbol_name("_drv8301")
   11689                      .dwattr $C$DW$2117, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
   11690                      .dwattr $C$DW$2117, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:31 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0740411                            PAGE  224

   11691                      .dwendtag $C$DW$T$113
   11692              
   11693              $C$DW$T$351     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   11694                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$113)
   11695                      .dwattr $C$DW$T$351, DW_AT_language(DW_LANG_C)
   11696              $C$DW$T$352     .dwtag  DW_TAG_pointer_type
   11697                      .dwattr $C$DW$T$352, DW_AT_type(*$C$DW$T$351)
   11698                      .dwattr $C$DW$T$352, DW_AT_address_class(0x20)
   11699              $C$DW$T$353     .dwtag  DW_TAG_pointer_type
   11700                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$113)
   11701                      .dwattr $C$DW$T$353, DW_AT_address_class(0x20)
   11702              $C$DW$T$354     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
   11703                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$353)
   11704                      .dwattr $C$DW$T$354, DW_AT_language(DW_LANG_C)
   11705              $C$DW$2118      .dwtag  DW_TAG_TI_far_type
   11706                      .dwattr $C$DW$2118, DW_AT_type(*$C$DW$T$354)
   11707              $C$DW$T$355     .dwtag  DW_TAG_const_type
   11708                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$2118)
   11709              
   11710              $C$DW$T$115     .dwtag  DW_TAG_structure_type
   11711                      .dwattr $C$DW$T$115, DW_AT_name("_MATH_vec3_")
   11712                      .dwattr $C$DW$T$115, DW_AT_byte_size(0x06)
   11713              $C$DW$2119      .dwtag  DW_TAG_member
   11714                      .dwattr $C$DW$2119, DW_AT_type(*$C$DW$T$114)
   11715                      .dwattr $C$DW$2119, DW_AT_name("value")
   11716                      .dwattr $C$DW$2119, DW_AT_TI_symbol_name("_value")
   11717                      .dwattr $C$DW$2119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11718                      .dwattr $C$DW$2119, DW_AT_accessibility(DW_ACCESS_public)
   11719                      .dwendtag $C$DW$T$115
   11720              
   11721              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   11722                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$115)
   11723                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
   11724              
   11725              $C$DW$T$119     .dwtag  DW_TAG_structure_type
   11726                      .dwattr $C$DW$T$119, DW_AT_name("_OFFSET_")
   11727                      .dwattr $C$DW$T$119, DW_AT_byte_size(0x0e)
   11728              $C$DW$2120      .dwtag  DW_TAG_member
   11729                      .dwattr $C$DW$2120, DW_AT_type(*$C$DW$T$69)
   11730                      .dwattr $C$DW$2120, DW_AT_name("value")
   11731                      .dwattr $C$DW$2120, DW_AT_TI_symbol_name("_value")
   11732                      .dwattr $C$DW$2120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11733                      .dwattr $C$DW$2120, DW_AT_accessibility(DW_ACCESS_public)
   11734              $C$DW$2121      .dwtag  DW_TAG_member
   11735                      .dwattr $C$DW$2121, DW_AT_type(*$C$DW$T$116)
   11736                      .dwattr $C$DW$2121, DW_AT_name("filter")
   11737                      .dwattr $C$DW$2121, DW_AT_TI_symbol_name("_filter")
   11738                      .dwattr $C$DW$2121, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11739                      .dwattr $C$DW$2121, DW_AT_accessibility(DW_ACCESS_public)
   11740              $C$DW$2122      .dwtag  DW_TAG_member
   11741                      .dwattr $C$DW$2122, DW_AT_type(*$C$DW$T$118)
   11742                      .dwattr $C$DW$2122, DW_AT_name("filterHandle")
   11743                      .dwattr $C$DW$2122, DW_AT_TI_symbol_name("_filterHandle")
   11744                      .dwattr $C$DW$2122, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
