TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:42 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0808810                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 10:29:41 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/drivers/pwm/src/32b/f28x/f2806x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab20\Release")
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.4\bin\opt2000.exe C:\\Users\\grant\\AppData\\Local\\Temp\

    7132              $C$DW$746       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_ShadowMode_Shadow"), DW_AT_const_value(0x00)
    7133              $C$DW$747       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_ShadowMode_Immediate"), DW_AT_const_value(0x01)
    7134                      .dwendtag $C$DW$T$114
    7135              
    7136              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_ShadowMode_e")
    7137                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    7138                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:42 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0808810                            PAGE  133

    7139              $C$DW$748       .dwtag  DW_TAG_TI_far_type
    7140                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$115)
    7141              $C$DW$T$116     .dwtag  DW_TAG_const_type
    7142                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$748)
    7143              
    7144              $C$DW$T$117     .dwtag  DW_TAG_enumeration_type
    7145                      .dwattr $C$DW$T$117, DW_AT_byte_size(0x01)
    7146              $C$DW$749       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_EPWMxSYNC"), DW_AT_const_value(0x00)
    7147              $C$DW$750       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_CounterEqualZero"), DW_AT_const_value(0x1
    7148              $C$DW$751       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_CounterEqualCounterCompareZero"), DW_AT_c
    7149              $C$DW$752       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SyncMode_Disable"), DW_AT_const_value(0x30)
    7150                      .dwendtag $C$DW$T$117
    7151              
    7152              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_SyncMode_e")
    7153                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    7154                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    7155              $C$DW$753       .dwtag  DW_TAG_TI_far_type
    7156                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$118)
    7157              $C$DW$T$119     .dwtag  DW_TAG_const_type
    7158                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$753)
    7159              
    7160              $C$DW$T$120     .dwtag  DW_TAG_enumeration_type
    7161                      .dwattr $C$DW$T$120, DW_AT_byte_size(0x01)
    7162              $C$DW$754       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_Disabled"), DW_AT_const_value(0
    7163              $C$DW$755       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHL_DCxLX"), DW_AT_const_valu
    7164              $C$DW$756       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHH_DCxLX"), DW_AT_const_valu
    7165              $C$DW$757       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHx_DCxLL"), DW_AT_const_valu
    7166              $C$DW$758       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHx_DCxLH"), DW_AT_const_valu
    7167              $C$DW$759       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneDCEventSel_DCxHL_DCxLH"), DW_AT_const_valu
    7168                      .dwendtag $C$DW$T$120
    7169              
    7170              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_TripZoneDCEventSel_e")
    7171                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    7172                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    7173              $C$DW$760       .dwtag  DW_TAG_TI_far_type
    7174                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$121)
    7175              $C$DW$T$122     .dwtag  DW_TAG_const_type
    7176                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$760)
    7177              
    7178              $C$DW$T$123     .dwtag  DW_TAG_enumeration_type
    7179                      .dwattr $C$DW$T$123, DW_AT_byte_size(0x01)
    7180              $C$DW$761       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_HighImp"), DW_AT_const_value(0x00)
    7181              $C$DW$762       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_EPWM_High"), DW_AT_const_value(0x01)
    7182              $C$DW$763       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_EPWM_Low"), DW_AT_const_value(0x02)
    7183              $C$DW$764       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_TripZoneState_DoNothing"), DW_AT_const_value(0x03)
    7184                      .dwendtag $C$DW$T$123
    7185              
    7186              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_TripZoneState_e")
    7187                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    7188                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    7189              $C$DW$765       .dwtag  DW_TAG_TI_far_type
    7190                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$124)
    7191              $C$DW$T$125     .dwtag  DW_TAG_const_type
    7192                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$765)
    7193              
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:42 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0808810                            PAGE  134

    7194              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7195                      .dwattr $C$DW$T$23, DW_AT_name("_PWM_Obj_")
    7196                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x3a)
    7197              $C$DW$766       .dwtag  DW_TAG_member
    7198                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$20)
    7199                      .dwattr $C$DW$766, DW_AT_name("TBCTL")
    7200                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_TBCTL")
    7201                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7202                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7203              $C$DW$767       .dwtag  DW_TAG_member
    7204                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$20)
    7205                      .dwattr $C$DW$767, DW_AT_name("TBSTS")
    7206                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_TBSTS")
    7207                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7208                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7209              $C$DW$768       .dwtag  DW_TAG_member
    7210                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$20)
    7211                      .dwattr $C$DW$768, DW_AT_name("TBPHSHR")
    7212                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_TBPHSHR")
    7213                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7214                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7215              $C$DW$769       .dwtag  DW_TAG_member
    7216                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$20)
    7217                      .dwattr $C$DW$769, DW_AT_name("TBPHS")
    7218                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_TBPHS")
    7219                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7220                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7221              $C$DW$770       .dwtag  DW_TAG_member
    7222                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$20)
    7223                      .dwattr $C$DW$770, DW_AT_name("TBCTR")
    7224                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_TBCTR")
    7225                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7226                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7227              $C$DW$771       .dwtag  DW_TAG_member
    7228                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$20)
    7229                      .dwattr $C$DW$771, DW_AT_name("TBPRD")
    7230                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_TBPRD")
    7231                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7232                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7233              $C$DW$772       .dwtag  DW_TAG_member
    7234                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$20)
    7235                      .dwattr $C$DW$772, DW_AT_name("TBPRDHR")
    7236                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_TBPRDHR")
    7237                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7238                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7239              $C$DW$773       .dwtag  DW_TAG_member
    7240                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$20)
    7241                      .dwattr $C$DW$773, DW_AT_name("CMPCTL")
    7242                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_CMPCTL")
    7243                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7244                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7245              $C$DW$774       .dwtag  DW_TAG_member
    7246                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$20)
    7247                      .dwattr $C$DW$774, DW_AT_name("CMPAHR")
    7248                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_CMPAHR")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:42 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0808810                            PAGE  135

    7249                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7250                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7251              $C$DW$775       .dwtag  DW_TAG_member
    7252                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$20)
    7253                      .dwattr $C$DW$775, DW_AT_name("CMPA")
    7254                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_CMPA")
    7255                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7256                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7257              $C$DW$776       .dwtag  DW_TAG_member
    7258                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$20)
    7259                      .dwattr $C$DW$776, DW_AT_name("CMPB")
    7260                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_CMPB")
    7261                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7262                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7263              $C$DW$777       .dwtag  DW_TAG_member
    7264                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$20)
    7265                      .dwattr $C$DW$777, DW_AT_name("AQCTLA")
    7266                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_AQCTLA")
    7267                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7268                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7269              $C$DW$778       .dwtag  DW_TAG_member
    7270                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$20)
    7271                      .dwattr $C$DW$778, DW_AT_name("AQCTLB")
    7272                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_AQCTLB")
    7273                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7274                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7275              $C$DW$779       .dwtag  DW_TAG_member
    7276                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$20)
    7277                      .dwattr $C$DW$779, DW_AT_name("AQSFRC")
    7278                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_AQSFRC")
    7279                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7280                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7281              $C$DW$780       .dwtag  DW_TAG_member
    7282                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$20)
    7283                      .dwattr $C$DW$780, DW_AT_name("AQCSFRC")
    7284                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_AQCSFRC")
    7285                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7286                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7287              $C$DW$781       .dwtag  DW_TAG_member
    7288                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$20)
    7289                      .dwattr $C$DW$781, DW_AT_name("DBCTL")
    7290                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_DBCTL")
    7291                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    7292                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7293              $C$DW$782       .dwtag  DW_TAG_member
    7294                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$20)
    7295                      .dwattr $C$DW$782, DW_AT_name("DBRED")
    7296                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_DBRED")
    7297                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7298                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7299              $C$DW$783       .dwtag  DW_TAG_member
    7300                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$20)
    7301                      .dwattr $C$DW$783, DW_AT_name("DBFED")
    7302                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_DBFED")
    7303                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:42 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0808810                            PAGE  136

    7304                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7305              $C$DW$784       .dwtag  DW_TAG_member
    7306                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$20)
    7307                      .dwattr $C$DW$784, DW_AT_name("TZSEL")
    7308                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_TZSEL")
    7309                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7310                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7311              $C$DW$785       .dwtag  DW_TAG_member
    7312                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$20)
    7313                      .dwattr $C$DW$785, DW_AT_name("TZDCSEL")
    7314                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_TZDCSEL")
    7315                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    7316                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7317              $C$DW$786       .dwtag  DW_TAG_member
    7318                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$20)
    7319                      .dwattr $C$DW$786, DW_AT_name("TZCTL")
    7320                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_TZCTL")
    7321                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7322                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7323              $C$DW$787       .dwtag  DW_TAG_member
    7324                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$20)
    7325                      .dwattr $C$DW$787, DW_AT_name("TZEINT")
    7326                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_TZEINT")
    7327                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7328                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7329              $C$DW$788       .dwtag  DW_TAG_member
    7330                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$20)
    7331                      .dwattr $C$DW$788, DW_AT_name("TZFLG")
    7332                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_TZFLG")
    7333                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7334                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7335              $C$DW$789       .dwtag  DW_TAG_member
    7336                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$20)
    7337                      .dwattr $C$DW$789, DW_AT_name("TZCLR")
    7338                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_TZCLR")
    7339                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    7340                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7341              $C$DW$790       .dwtag  DW_TAG_member
    7342                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$20)
    7343                      .dwattr $C$DW$790, DW_AT_name("TZFRC")
    7344                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_TZFRC")
    7345                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7346                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7347              $C$DW$791       .dwtag  DW_TAG_member
    7348                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$20)
    7349                      .dwattr $C$DW$791, DW_AT_name("ETSEL")
    7350                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_ETSEL")
    7351                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    7352                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7353              $C$DW$792       .dwtag  DW_TAG_member
    7354                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$20)
    7355                      .dwattr $C$DW$792, DW_AT_name("ETPS")
    7356                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_ETPS")
    7357                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7358                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:42 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0808810                            PAGE  137

    7359              $C$DW$793       .dwtag  DW_TAG_member
    7360                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$20)
    7361                      .dwattr $C$DW$793, DW_AT_name("ETFLG")
    7362                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_ETFLG")
    7363                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    7364                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7365              $C$DW$794       .dwtag  DW_TAG_member
    7366                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$20)
    7367                      .dwattr $C$DW$794, DW_AT_name("ETCLR")
    7368                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_ETCLR")
    7369                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7370                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7371              $C$DW$795       .dwtag  DW_TAG_member
    7372                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$20)
    7373                      .dwattr $C$DW$795, DW_AT_name("ETFRC")
    7374                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_ETFRC")
    7375                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    7376                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7377              $C$DW$796       .dwtag  DW_TAG_member
    7378                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$20)
    7379                      .dwattr $C$DW$796, DW_AT_name("PCCTL")
    7380                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_PCCTL")
    7381                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7382                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7383              $C$DW$797       .dwtag  DW_TAG_member
    7384                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$20)
    7385                      .dwattr $C$DW$797, DW_AT_name("rsvd_1")
    7386                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_rsvd_1")
    7387                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    7388                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7389              $C$DW$798       .dwtag  DW_TAG_member
    7390                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$20)
    7391                      .dwattr $C$DW$798, DW_AT_name("HRCNFG")
    7392                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_HRCNFG")
    7393                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7394                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7395              $C$DW$799       .dwtag  DW_TAG_member
    7396                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$20)
    7397                      .dwattr $C$DW$799, DW_AT_name("HRPWR")
    7398                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_HRPWR")
    7399                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7400                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7401              $C$DW$800       .dwtag  DW_TAG_member
    7402                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$21)
    7403                      .dwattr $C$DW$800, DW_AT_name("rsvd_2")
    7404                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_rsvd_2")
    7405                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7406                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7407              $C$DW$801       .dwtag  DW_TAG_member
    7408                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$20)
    7409                      .dwattr $C$DW$801, DW_AT_name("HRMSTEP")
    7410                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_HRMSTEP")
    7411                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7412                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7413              $C$DW$802       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:42 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0808810                            PAGE  138

    7414                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$20)
    7415                      .dwattr $C$DW$802, DW_AT_name("rsvd_3")
    7416                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_rsvd_3")
    7417                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    7418                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7419              $C$DW$803       .dwtag  DW_TAG_member
    7420                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$20)
    7421                      .dwattr $C$DW$803, DW_AT_name("HRPCTL")
    7422                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_HRPCTL")
    7423                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7424                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7425              $C$DW$804       .dwtag  DW_TAG_member
    7426                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$20)
    7427                      .dwattr $C$DW$804, DW_AT_name("rsvd_4")
    7428                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_rsvd_4")
    7429                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    7430                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7431              $C$DW$805       .dwtag  DW_TAG_member
    7432                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$20)
    7433                      .dwattr $C$DW$805, DW_AT_name("TBPRDHRM")
    7434                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_TBPRDHRM")
    7435                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7436                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7437              $C$DW$806       .dwtag  DW_TAG_member
    7438                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$20)
    7439                      .dwattr $C$DW$806, DW_AT_name("TBPRDM")
    7440                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_TBPRDM")
    7441                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    7442                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7443              $C$DW$807       .dwtag  DW_TAG_member
    7444                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$20)
    7445                      .dwattr $C$DW$807, DW_AT_name("CMPAHRM")
    7446                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_CMPAHRM")
    7447                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7448                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7449              $C$DW$808       .dwtag  DW_TAG_member
    7450                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$20)
    7451                      .dwattr $C$DW$808, DW_AT_name("CMPAM")
    7452                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_CMPAM")
    7453                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    7454                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7455              $C$DW$809       .dwtag  DW_TAG_member
    7456                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$22)
    7457                      .dwattr $C$DW$809, DW_AT_name("rsvd_5")
    7458                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_rsvd_5")
    7459                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    7460                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7461              $C$DW$810       .dwtag  DW_TAG_member
    7462                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$20)
    7463                      .dwattr $C$DW$810, DW_AT_name("DCTRIPSEL")
    7464                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_DCTRIPSEL")
    7465                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7466                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7467              $C$DW$811       .dwtag  DW_TAG_member
    7468                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:42 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0808810                            PAGE  139

    7469                      .dwattr $C$DW$811, DW_AT_name("DCACTL")
    7470                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_DCACTL")
    7471                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    7472                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7473              $C$DW$812       .dwtag  DW_TAG_member
    7474                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$20)
    7475                      .dwattr $C$DW$812, DW_AT_name("DCBCTL")
    7476                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_DCBCTL")
    7477                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7478                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7479              $C$DW$813       .dwtag  DW_TAG_member
    7480                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$20)
    7481                      .dwattr $C$DW$813, DW_AT_name("DCFCTL")
    7482                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_DCFCTL")
    7483                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    7484                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7485              $C$DW$814       .dwtag  DW_TAG_member
    7486                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$20)
    7487                      .dwattr $C$DW$814, DW_AT_name("DCCAPCTL")
    7488                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_DCCAPCTL")
    7489                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7490                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7491              $C$DW$815       .dwtag  DW_TAG_member
    7492                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$20)
    7493                      .dwattr $C$DW$815, DW_AT_name("DCFOFFSET")
    7494                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_DCFOFFSET")
    7495                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    7496                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7497              $C$DW$816       .dwtag  DW_TAG_member
    7498                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$20)
    7499                      .dwattr $C$DW$816, DW_AT_name("DCFOFFSETCNT")
    7500                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_DCFOFFSETCNT")
    7501                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7502                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    7503              $C$DW$817       .dwtag  DW_TAG_member
    7504                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$20)
    7505                      .dwattr $C$DW$817, DW_AT_name("DCFWINDOW")
    7506                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_DCFWINDOW")
    7507                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    7508                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7509              $C$DW$818       .dwtag  DW_TAG_member
    7510                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$20)
    7511                      .dwattr $C$DW$818, DW_AT_name("DCFWINDOWCNT")
    7512                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_DCFWINDOWCNT")
    7513                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7514                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7515              $C$DW$819       .dwtag  DW_TAG_member
    7516                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$20)
    7517                      .dwattr $C$DW$819, DW_AT_name("DCCAP")
    7518                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_DCCAP")
    7519                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    7520                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    7521                      .dwendtag $C$DW$T$23
    7522              
    7523              $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Obj")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 10:29:42 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0808810                            PAGE  140

    7524                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$23)
    7525                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    7526              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    7527                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$23)
    7528                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    7529              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Handle")
    7530                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    7531                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    7532              $C$DW$820       .dwtag  DW_TAG_TI_far_type
    7533                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$33)
    7534              $C$DW$T$127     .dwtag  DW_TAG_const_type
    7535                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$820)
    7536              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    7537                      .dwattr $C$DW$T$2, DW_AT_name("void")
    7538              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    7539                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    7540                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    7541              $C$DW$T$4       .dwtag  DW_TAG_base_type
    7542                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    7543                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    7544                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    7545              $C$DW$T$5       .dwtag  DW_TAG_base_type
    7546                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    7547                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    7548                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    7549              $C$DW$T$6       .dwtag  DW_TAG_base_type
    7550                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    7551                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    7552                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    7553              $C$DW$T$7       .dwtag  DW_TAG_base_type
    7554                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    7555                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    7556                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    7557              $C$DW$T$8       .dwtag  DW_TAG_base_type
    7558                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    7559                      .dwattr $C$DW$T$8, DW_AT_name("short")
    7560                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    7561              $C$DW$T$9       .dwtag  DW_TAG_base_type
    7562                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    7563                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    7564                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    7565              $C$DW$T$10      .dwtag  DW_TAG_base_type
    7566                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    7567                      .dwattr $C$DW$T$10, DW_AT_name("int")
    7568                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    7569              $C$DW$T$11      .dwtag  DW_TAG_base_type
    7570                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
