TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:30 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0440810                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.4 *
       3              ;* Date/Time created: Wed Jul 08 12:49:30 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_14/sw/drivers/spi/src/32b/f28x/f2806x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.4 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\ws_ccs_motorware\foc_proj_lab20\Release")
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.4\bin\opt2000.exe C:\\Users\\grant\\AppData\\Local\\Temp\

    2403              $C$DW$223       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Priority_AfterRxRxSeq"), DW_AT_const_value(0x20)
    2404                      .dwendtag $C$DW$T$52
    2405              
    2406              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Priority_e")
    2407                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2408                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2409              $C$DW$224       .dwtag  DW_TAG_TI_far_type
    2410                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$53)
    2411              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2412                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$224)
    2413              
    2414              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    2415                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    2416              $C$DW$225       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_Empty"), DW_AT_const_value(0x00)
    2417              $C$DW$226       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_1_Word"), DW_AT_const_value(0x01)
    2418              $C$DW$227       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_2_Words"), DW_AT_const_value(0x02)
    2419              $C$DW$228       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_3_Words"), DW_AT_const_value(0x03)
    2420              $C$DW$229       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FifoLevel_4_Words"), DW_AT_const_value(0x04)
    2421                      .dwendtag $C$DW$T$55
    2422              
    2423              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FifoLevel_e")
    2424                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2425                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2426              $C$DW$230       .dwtag  DW_TAG_TI_far_type
    2427                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$56)
    2428              $C$DW$T$57      .dwtag  DW_TAG_const_type
    2429                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$230)
    2430              
    2431              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
    2432                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    2433              $C$DW$231       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_SteInv_ActiveLow"), DW_AT_const_value(0x00)
    2434              $C$DW$232       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_SteInv_ActiveHigh"), DW_AT_const_value(0x02)
    2435                      .dwendtag $C$DW$T$58
    2436              
    2437              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_SteInv_e")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:30 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0440810                            PAGE   46

    2438                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2439                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2440              $C$DW$233       .dwtag  DW_TAG_TI_far_type
    2441                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$59)
    2442              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2443                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$233)
    2444              
    2445              $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    2446                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
    2447              $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
    2448              $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
    2449              $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
    2450                      .dwendtag $C$DW$T$61
    2451              
    2452              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
    2453                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2454                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2455              $C$DW$237       .dwtag  DW_TAG_TI_far_type
    2456                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$62)
    2457              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2458                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$237)
    2459              
    2460              $C$DW$T$64      .dwtag  DW_TAG_enumeration_type
    2461                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    2462              $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TriWire_NormalFourWire"), DW_AT_const_value(0x00)
    2463              $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TriWire_ThreeWire"), DW_AT_const_value(0x01)
    2464                      .dwendtag $C$DW$T$64
    2465              
    2466              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_TriWire_e")
    2467                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2468                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2469              $C$DW$240       .dwtag  DW_TAG_TI_far_type
    2470                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$65)
    2471              $C$DW$T$66      .dwtag  DW_TAG_const_type
    2472                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$240)
    2473              
    2474              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2475                      .dwattr $C$DW$T$22, DW_AT_name("_SPI_Obj_")
    2476                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2477              $C$DW$241       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    2479                      .dwattr $C$DW$241, DW_AT_name("SPICCR")
    2480                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_SPICCR")
    2481                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2482                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2483              $C$DW$242       .dwtag  DW_TAG_member
    2484                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    2485                      .dwattr $C$DW$242, DW_AT_name("SPICTL")
    2486                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_SPICTL")
    2487                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2488                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2489              $C$DW$243       .dwtag  DW_TAG_member
    2490                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    2491                      .dwattr $C$DW$243, DW_AT_name("SPIST")
    2492                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_SPIST")
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:30 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0440810                            PAGE   47

    2493                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2494                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2495              $C$DW$244       .dwtag  DW_TAG_member
    2496                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    2497                      .dwattr $C$DW$244, DW_AT_name("rsvd_1")
    2498                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_rsvd_1")
    2499                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2500                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2501              $C$DW$245       .dwtag  DW_TAG_member
    2502                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2503                      .dwattr $C$DW$245, DW_AT_name("SPIBRR")
    2504                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_SPIBRR")
    2505                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2506                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2507              $C$DW$246       .dwtag  DW_TAG_member
    2508                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    2509                      .dwattr $C$DW$246, DW_AT_name("rsvd_2")
    2510                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_rsvd_2")
    2511                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2512                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2513              $C$DW$247       .dwtag  DW_TAG_member
    2514                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2515                      .dwattr $C$DW$247, DW_AT_name("SPIEMU")
    2516                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_SPIEMU")
    2517                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2518                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2519              $C$DW$248       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2521                      .dwattr $C$DW$248, DW_AT_name("SPIRXBUF")
    2522                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_SPIRXBUF")
    2523                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2524                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2525              $C$DW$249       .dwtag  DW_TAG_member
    2526                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2527                      .dwattr $C$DW$249, DW_AT_name("SPITXBUF")
    2528                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_SPITXBUF")
    2529                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2530                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2531              $C$DW$250       .dwtag  DW_TAG_member
    2532                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    2533                      .dwattr $C$DW$250, DW_AT_name("SPIDAT")
    2534                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_SPIDAT")
    2535                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2536                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2537              $C$DW$251       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2539                      .dwattr $C$DW$251, DW_AT_name("SPIFFTX")
    2540                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_SPIFFTX")
    2541                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2542                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2543              $C$DW$252       .dwtag  DW_TAG_member
    2544                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    2545                      .dwattr $C$DW$252, DW_AT_name("SPIFFRX")
    2546                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_SPIFFRX")
    2547                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:30 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0440810                            PAGE   48

    2548                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2549              $C$DW$253       .dwtag  DW_TAG_member
    2550                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    2551                      .dwattr $C$DW$253, DW_AT_name("SPIFFCT")
    2552                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_SPIFFCT")
    2553                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2554                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2555              $C$DW$254       .dwtag  DW_TAG_member
    2556                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$21)
    2557                      .dwattr $C$DW$254, DW_AT_name("rsvd_3")
    2558                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_rsvd_3")
    2559                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2560                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2561              $C$DW$255       .dwtag  DW_TAG_member
    2562                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2563                      .dwattr $C$DW$255, DW_AT_name("SPIPRI")
    2564                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_SPIPRI")
    2565                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2566                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2567                      .dwendtag $C$DW$T$22
    2568              
    2569              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Obj")
    2570                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
    2571                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2572              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    2573                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
    2574                      .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    2575              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Handle")
    2576                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2577                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2578              $C$DW$256       .dwtag  DW_TAG_TI_far_type
    2579                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$26)
    2580              $C$DW$T$68      .dwtag  DW_TAG_const_type
    2581                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$256)
    2582              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2583                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2584              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2585                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2586                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2587              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2588                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2589                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2590                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2591              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2592                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2593                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2594                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2595              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2596                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2597                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2598                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2599              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2600                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2601                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2602                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.4 Wed Jul 08 12:49:30 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\grant\AppData\Local\Temp\0440810                            PAGE   49

    2603              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2604                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2605                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2606                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2607              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2608                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2609                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2610                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2611              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2612                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2613                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2614                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2615              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2616                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
